<HTML><HEAD>    <TITLE>STARTRACK-Hardware</TITLE></HEAD><BODY BACKGROUND="struct.gif"><H2><CENTER>Hardware der STARTRACK-Harddisk-Recording-Karte</CENTER></H2><P><CENTER>updated 20.6.1997</CENTER><PRE><HR></PRE><H4>Die STARTRACK-Harddisk-Recording-Soundkarte ist eine 4Layer-Platine.<BR><BR>Die Karte besitzt digitale Ein/Ausg&auml;nge in Cinch und Opto-Ausf&uuml;hrung<BR><BR>und versteht die Consumer-Norm SP/DIF, aber auch die Studioausf&uuml;hrungAES/EBU.<BR><BR>Die Karte erkennt auch Fehler in der digitalen Daten&uuml;bertragung undzeigt die Art<BR><BR>des Fehlers an.<BR><BR>Die Samplerate der digitalen Aufnahme wird hardwarem&auml;&szlig;ig erkanntund im Programm<BR><BR>ausgewertet und angezeigt. Der Kopierschutz kann aus SCMS-gesch&uuml;tzten<BR><BR>Digitalaufnahmen vollst&auml;ndig entfernt werden. Eigene Aufnahmen<BR><BR>per Soundkarte k&ouml;nnen verlustfrei digital zur&uuml;ck per DAT/DCC/MD&uuml;berspielt werden.<BR><BR>Dabei kann gew&auml;hlt werden ob anschlie&szlig;end keine Kopien, 1Kopieoder mehrere Kopien<BR><BR>der Aufnahme m&ouml;glich bzw. erlaubt sind.<BR><BR>An Frequenzen verarbeiten die digitalen Eing&auml;nge 32/44.1/48kHz und<BR><BR>dank allerneuester SP/DIF-Chips auch 96kHz Samplerate. Hiermit <BR><BR>ist sogar 24Bit-Mastering m&ouml;glich - was will man mehr !<BR><BR>Es sind au&szlig;erdem nat&uuml;rlich je ein Stereo 16Bit A/D und 18BitD/A-Wandler<BR><BR>auf der Karte mit 64fachem Oversampling und Sigma-Delta-Linearwandlern.<BR><BR>Das sind keine Billigwandler wie im Falcon oder auf den meisten PC-Soundkarten<BR><BR>sondern erstklassige Wandler deren Qualit&auml;t von HIFI-Zeitschriftenbereits<BR><BR>gew&uuml;rdigt wurden. Zusammen mit den Digitaleing&auml;ngen kann die Karteim Vierkanal-<BR><BR>Modus arbeiten. Dabei kann man gleichzeitig vier Kan&auml;le aufnehmen undwiedergeben.<BR><BR>Eine De-Emphasis-Schaltung ist auch integriert und diese kann &uuml;berdas<BR><BR>Programm gesteuert werden. Das ist n&ouml;tig weil einige CDs (z.B. vonHeaven 17)<BR><BR>zwecks Rauschminderung mit stark angehobenen H&ouml;hen auf der CD verewigtwurden. <BR><BR>Die Karte besitzt digital steuerbare Highend-Lautst&auml;rkeregler/verst&auml;rkerim<BR><BR>Bereich -96dB bis +32dB,kanalgetrennt regelbar mit 256 Abstufungen f&uuml;rden<BR><BR>A/D-Wandler (Aufnahme) und auch f&uuml;r den D/A-Wandler (Wiedergabe).<BR><BR>Mit der Karte ist nat&uuml;rlich auch Harddisk-Recording m&ouml;glich.<BR><BR>Man kann die Karte durch eine Erweiterungsplatine mit einem Motorola<BR><BR>DSP56002-66MHz (doppelte Falcon-Leistung) aufr&uuml;sten der standartm&auml;&szlig;ig<BR><BR>&uuml;ber zus&auml;tzliche 128K x 24Bit SRAM/12ns verf&uuml;gt (viemal sovielwie im Falcon)<BR><BR>Der DSP ist aber f&uuml;r Harddisk-Recording nicht unbedingt n&ouml;tig,da die Karte<BR><BR>den Transfer selbst puffert.<BR><BR>Daher steht der DSP quasi komplett f&uuml;r Effekt-Berechnungen zur Verf&uuml;gung.<BR><BR>Auf der DSP-Erweiterung befindet sich auch ein Falcon-kompatibler DSP-Port<BR><BR>f&uuml;r Erweiterungen (Analog8,ADAT,JAM In/Out) z.B. auf 8 Einzelausg&auml;nge.<BR><BR>Optional gibt es einen aufgebohrten DSP-Doubleport f&uuml;r 2 Erweiterungen<BR><BR>(2x Analog8,JAM-Out) f&uuml;r bis zu 16 Einzelausg&auml;nge !<BR><BR>Der DSP-Debugport (ONCE) ist serienm&auml;&szlig;ig vorhanden und erlaubtEntwicklern<BR><BR>und Programmierern das komfortable Hardware-Debugging von DSP-Programmen.<BR><BR>Dieser Port ist kompatibel zum Entwicklungstool EVM56002 von Motorola.<BR><BR>Die Debug-Software ist kostenlos erh&auml;ltlich und erlaubt u.a. Breakpoints,<BR><BR>Trace, Auslesen und &Auml;ndern von Registern usw.<BR><BR>&Uuml;ber den DSP-Slot der HDR-Soundkarte sind prinzipiell auch andere DSPs<BR><BR>oder Erweiterungen denkbar. Anregungen hierzu sind durchaus erw&uuml;nscht.<BR><BR>Durch eine weitere Zusatzplatine kann das System voll Studiotauglich gemacht<BR><BR>werden, d.h. h&ouml;here Line-Pegel und alle Anschl&uuml;sse in XLR-Anschlu&szlig;norm.<BR><BR>Die 3 digitalen Eing&auml;nge (optisch,koaxial und AES/EBU) k&ouml;nnen&uuml;ber das<BR><BR>Sample-Editor-Programm umgeschaltet werden. Das erspart st&auml;ndiges Umstecken<BR><BR>der Kabel.<BR><BR>Die A/D und D/A-Wandler k&ouml;nnen mit den &uuml;blichen 32/44.1 und 48kHzarbeiten,<BR><BR>au&szlig;erdem aber noch mit 8/11/12/16/16.5/22.1/24/33.1 kHz und einemoptional<BR><BR>extern angelegten Takt (Wordclock) der durch 768/512/384 oder 256 intern<BR><BR>geteilt wird. Der Wandlertakt kann au&szlig;erdem &uuml;ber ein Koaxkabelmit einem<BR><BR>CD-Laufwerk verbunden werden. Das ist bei einigen HighEnd-Laufwerken m&ouml;glich<BR><BR>und verhindert wirkungsvoll Jitter.</H4><PRE></PRE><H3>Die Platinen sind in Produktion, und k&ouml;nnen vorraussichtlich<BR>Sommer &#180;97 geliefert werden.</H3><BR><HR><STRONG><A HREF="dmain.html">zur&uuml;ck zur Hauptseite...<BR></A></STRONG></BODY></HTML>