<HTML><HEAD>    <TITLE>STARTRACK-Software</TITLE></HEAD><BODY BACKGROUND="struct.gif"><H2><CENTER>Die Software der STARTRACK-Harddisk-Recording-Karte</CENTER></H2><PRE>                                                                                                  updated 5.6.1997<HR></PRE><H3>Das Programm l&auml;uft unter TOS,Multitos und Magic. <BR><BR>Die <A HREF="ftp://members.aol.com/vmestartrk/stardemo.zip">Demoversion</A>l&auml;uft (nat&uuml;rlich ohne Soundkarte) auf allen TOS-Rechnern und sogarunter MagicMac<BR><BR>und ist hier zum download bereit. Ein <A HREF="ftp://members.aol.com/vmestartrk/testsmpl.zip">Testsample</A>sollte man sich auch gleich herunterladen.</H3><H2><CENTER><BR>Die Software-Features:</CENTER></H2><PRE><HR></PRE><H4>Die Liste bezieht sich auf die Alpha-Version der STARTRACK-SoftwareV1.05a<BR><BR>und die Leistungsmerkmale k&ouml;nnen (und werden) sich sicherlich bis zur<BR><BR>Final-Version noch &auml;ndern !<BR><BR><BR><BR>Alle Fenster sind, wo dies sinnvoll ist, nonmodal und k&ouml;nnen ge&ouml;ffnetbleiben.<BR><BR><BR><BR></H4><H3><I><STRONG>- Edit-Fenster (immer offen, unmodal)</STRONG></I></H3><H4>Das ist die Schaltzentrale des Programms. Von hier aus werden s&auml;mtlicheBearbeitungsfunktionen ausgef&uuml;hrt.<BR><BR>Zentraler Bestandteil des Edit-Fensters ist die graphische Darstellung derSamples.<BR><BR>Direkt per Drag und Drop k&ouml;nnen Marker verschoben und gesetzt, Samplesim Speicher kopiert und verschoben<BR><BR>werden. Nat&uuml;rlich k&ouml;nnen nicht nur Samples im Speicher (destruktiv)bearbeitet werden.<BR><BR>Es gibt einen virtual-mode wo auf Festplatte gespeicherte Samples die nichtkomplett in den Speicher<BR><BR>passen, genauso bearbeitet werden k&ouml;nnen. Wenn man versucht ein Filezu<BR><BR>laden, da&szlig; nicht mehr in den Speicher pa&szlig;t, erscheint eine Dialogbox,in<BR><BR>der man w&auml;hlen kann, ob man die virtuelle Bearbeitung w&uuml;nscht,oder ob<BR><BR>man nur einen Block laden m&ouml;chte. Diesen Block kann man frei w&auml;hlenund<BR><BR>kann sich den ausgew&auml;hlten Teil vor dem laden anh&ouml;ren, um zu testenob man<BR><BR>den richtigen Teil erwischt hat. <BR><BR>Der Editor ist zur Kontrolle und zur direkten Ver&auml;nderung von<BR><BR>Sampledaten gedacht und arbeitet deswegen destruktiv direkt auf die Daten.<BR><BR>Die Marker f&uuml;r (S)tart, (E)nde, E(I)nleitung und (R)elease werden alssenkrechte Linien im Editor<BR><BR>dargestellt. Man kann sie direkt per Maus an eine andere Position draggen.<BR><BR>Das geht auch durch diekte Dateneingabe. Diese Marker k&ouml;nnen auch perDrag&amp;Drop auf das Clipboard-Symbol<BR><BR>(Sternenflottenabzeichen-Button unten rechts) kopiert werden, indem dieentsprechenden Buttons<BR><BR>in das Clipboard gezogen werden, um sie von dort wieder auf einen anderenPlatz zu kopieren (auf Marker-<BR><BR>Button S,E,I oder R draggen). Wenn man alle Marker eines Eintrags gleichzeitigkopieren m&ouml;chte, draggt man<BR><BR>stattdessen den Button mit der Markernummer. Es gibt 100 Markerpositionen.<BR><BR>Man kann jedem Eintrag einen Kommenmtar geben, um die Marker besser auseinanderhaltenzu k&ouml;nnen.<BR><BR>Zoom &amp; Scroll-Funktionen sind ebenso vorhanden wie die M&ouml;glichkeitmehrere Samples zusammenzuf&uuml;gen.<BR><BR>Samples k&ouml;nnen nachtr&auml;glich weich ein und ausgeblendet werden.Daf&uuml;r gibt es sogar einen Fade-Editor<BR><BR>in dem man die Fader-Kurve frei editieren kann.<BR><BR>Man kann Knackser in einer Aufnahme im Editor direkt mit der Maus entfernenbzw. die Werte den<BR><BR>Schwingungen anpassen. <BR><BR>Zoomkomandos werden automatisch aufgezeichnet und bei Zoom-R&uuml;ckw&auml;rtsschrittenlandet man genau an der<BR><BR>Stelle an der man vorher im Editor war. Die Marker kann man auch direktper Dateneingabe in Samples<BR><BR>oder Zeiteinheiten (sec) eingeben.<BR><BR>Die Aufnahme/Widergabe-Funktionen k&ouml;nnen hier direkt ausgef&uuml;hrtwerden. Dabei zeigt ein Marker die<BR><BR>momentane Widergabe/Aufnahmestelle an (bei Aufnahme/Widergabe aus dem Speicher).<BR><BR>Man kann auch gleichzeitig ein Sample abspielen lassen w&auml;hrend manein neues Sample aufnimmt.<BR><BR>Das ist praktisch um zeitsynchron weitere Spuren aufzunehmen, wie das z.B.in Tonstudios geschieht.<BR><BR>(Z.B. zuerst die Aufnahme des Schlagzeug, dann Bass, Leadguitar, Stimme)<BR><BR>Der Editor bietet eine Nullstellen-Suchfunktion die einfach per Drag undDrop funktioniert.<BR><BR>Man nimmt einen Marker und dr&uuml;ckt die linke oder rechte Shifttaste.L&auml;&szlig;t man den Marker nun los,<BR><BR>sucht der Marker die n&auml;chste Nullstelle links oder rechts vom Ausgangspunktwo man losgelassen hat.<BR><BR>So einfach ist das - sehr praktisch um Loop-Punkte zu finden.<BR><BR>Man kann im Editor Teile eines Samples loopen und auch per Midi-Keyboard<BR><BR>abspielen. Daf&uuml;r legt man das Sample einfach auf einen einstellbarenMidikanal und dessen Midinote.<BR><BR>Der Editor hat auch eine Auto-Backup-Funktion die es erlaubt, automatischnach einer eingestellten<BR><BR>Zeit eine Sicherungskopie auf Festplatte zu machen.<BR><BR>Das Programm erlaubt die Bearbeitung folgender Sampleformate: S16,WAV,AVR,SND,SD,AUund SMP.<BR><BR>Es gibt vielf&auml;ltige Einstellungsm&ouml;glichkeiten im Setup um dieDarstellung im Editor,Pfade etc. einzustellen.<BR><BR>Man kann auch einstellen, das s&auml;mtliche ge&ouml;ffneten Fenster beimn&auml;chsten Start des Programms an exakt der<BR><BR>gleichen Stelle erscheinen. Alle wichtigen Einstellungen k&ouml;nnen ebensoabgespeichert werden und werden beim<BR><BR>n&auml;chsten Start automatisch gesetzt.<BR><BR><BR><BR>Am oberen Rand des Editfensters sind allerlei Buttons f&uuml;r die gebr&auml;uchlichstenFunktionen<BR><BR>und zum Aufruf von weiteren Fenstern. Als da w&auml;ren:<BR><BR><BR><BR><BR></H4><H3><I><STRONG>- Connection-Fenster (unmodal)</STRONG></I></H3><H4>* Anzeige von Fehlercodes und Samplerate der digitalen Eing&auml;nge<BR><BR>* Anzeige der Aufnahmeart der digitalen Eing&auml;nge (SCMS,Emphasis,Audio/Data,Consumer/Professional)<BR><BR>* Einstellung der Samplerate und Eingangswahl<BR><BR><BR><BR><BR></H4><H3><I><STRONG>- Editor-Toolbar (unmodal)</STRONG></I></H3><H4>mit Funktionen f&uuml;r Cut,Insert,Space,Optimize,Resample,Stereo/Mono,Negate,Change<BR><BR>* Cut zum Schneiden von Samples (Cut in/out/del)<BR><BR>* Insert zum zusammenf&uuml;gen von mehreren Samples<BR><BR>* Space zum Einf&uuml;gen von Leerstellen<BR><BR>* Optimize zum korrigieren der Lautst&auml;rke<BR><BR>* Resample zum ver&auml;ndern der Samplerate bzw. der Geschwindigkeit<BR><BR>* Stereo/Mono zur Monoumwandlung von Stereoaufnahmen<BR><BR>* Negate zum negieren der Sampledaten (positive Schwingungen werden negativund umgekehrt)<BR><BR>* Change zum wechseln der Kan&auml;le von links nach rechts und umgekehrt<BR><BR><BR><BR><BR></H4><H3><I><STRONG>- Peakmeter (unmodal)</STRONG></I></H3><H4>Das ist das zentrale Fenster f&uuml;r die Aufnahme und Widergabe.<BR><BR>Man kann das zwar auch im Edit-Fenster machen, aber das Peakmeter ist<BR><BR>komfortabler. Man hat eine sehr genaue Aussteuerungsanzeige mit Lautst&auml;rkeregler,<BR><BR>eine Mute-Taste, einen Balance-Regler, eine Aufnahmezeit-Anzeige, Peak-und Errorz&auml;hler<BR><BR>zur Fehleranzeige. Damit kann man sehr schnell feststellen, ob man &uuml;bersteuertoder<BR><BR>der eigene Rechner zu wenig Rechenzeit bietet (Puffer&uuml;berlauf-Sampledatengehen verloren),<BR><BR>weil zu viele Programme laufen (MTOS,Magic) oder der Rechner einfach zulangsam ist (68000er).<BR><BR>So kann z.B. die Aufnahme im Peakmeter-Fenster geschehen und durch einenKlick auf das Edit-Fenster<BR><BR>wird das gerade aufgenommene Sample im Edit-Fenster dargestellt und kannbearbeitet werden<BR><BR>- au&thorn;erst praktisch.<BR><BR>Das Peakfenster bietet die &uuml;blichen Steuerfunktionen eines Cassettendecks(Aufnahme,Widergabe,Stop,Pause)<BR><BR>Au&szlig;erdem kann bei Aufnahme optional auf einen einstellbaren Lautst&auml;rkepegelgewartet werden, um die<BR><BR>Aufnahme bei einsetzen der Musik zu starten. Und nat&uuml;rlich kann manw&auml;hlen, ob die Aufnahme bzw.<BR><BR>Widergabe in den Speicher oder auf Festplatte erfolgen soll. Diese Steuerfunktionenhat man auch im<BR><BR>Edit-Fenster nur das man dort auf eine Aussteuerungsanzeige verzichten mu&szlig;.<BR><BR>Bei der direkten Aufnahme auf Festplatte wird vor dem Aufnahmestart einINF-File angelegt,<BR><BR>in dem die Samplerate, Datum der Aufnahme, Loop-Marker und ein Kommentarvermerkt werden.<BR><BR>Diesen Kommentar kann man in einem Edit-Feld eingeben. Das kann man z.B.f&uuml;r eine genauere<BR><BR>Titelbeschreibung mit Aufnahmequelle verwenden. Damit lassen sich Aufnahmensp&auml;ter leichter<BR><BR>identifizieren und ausw&auml;hlen. Dieses INF-File wird beim laden angezeigt,oder in der speziellen<BR><BR>Fileselect-Box (siehe Musicbox).<BR><BR>Bei der Aufnahme wird eine &quot;.PBF&quot;-Datei angelegt, in der einekomprimierte Version des Amplitudenverlaufs<BR><BR>gespeichert wird. Das beschleunigt den Bildschirmaufbau beim laden von sehrlangen Samples<BR><BR>enorm, da normalerweise alle Samplewerte zur Berechnung der Amplitudendarstellungherangezogen werden<BR><BR>was bei 50-100MB schon etwas dauern kann. Stattdessen wird daher w&auml;hrendder Aufnahme schon eine<BR><BR>Berechnung vorgenommen und abgespeichert. Diese werden dann stattdessenzur Berechnung herangezogen.<BR><BR>Also quasi ein Amplituden-Caching. ;-)<BR><BR>Aufnahmen von den digitalen Eing&auml;ngen k&ouml;nnen nat&uuml;rlich nichtausgesteuert werden (wozu auch).<BR><BR>Die Aussteuerung kann man auch noch nachtr&auml;glich bei der Widergabekontrollieren (also sehen).<BR><BR><BR><BR></H4><H3><I><STRONG>- Midi und Playlist-Fenster (unmodal)</STRONG></I></H3><H4>Hier kann man die auf Festplatte gesammelten Samples auf entsprechendeMidikan&auml;le und Midinoten verteilen,<BR><BR>und so die Samples auf einem Keyboard &quot;spielen&quot;<BR><BR>Es gibt hier eine sogenannte Playlist, in der die Samples aufgef&uuml;hrtwerden.<BR><BR>Man kann hier f&uuml;r jedes Sample einstellen, ob die Samples beim abspielengeloopt werden sollen und mit<BR><BR>welcher Samplerate sie abgespielt werden sollen.<BR><BR>Hier gibt es auch wieder Kopierfunktionen (Drag und Drop) und jede MengeEditierfunktionen um Sampleteile<BR><BR>auszuw&auml;hlen (Startposition,Endposition, Abh&ouml;r- und Aufnahmem&ouml;glichkeiten)<BR><BR>Um einen Eintrag zu kopieren, zieht man den entsprechenden Edit-Button aufdas Clipboard. Anschlie&szlig;end<BR><BR>kann man den Eintrag aus dem Clipboard auf das Edit-Button draggen, in dender Eintrag kopiert werden soll.<BR><BR>Au&szlig;erdem lassen sich diese Midi-Playlisten abspeichern und laden.<BR><BR>Die Playlist-Dateien tragen die Endung &quot;.ARR&quot;<BR><BR><BR><BR></H4><H3><I><STRONG>- Loopfenster (unmodal)</STRONG></I></H3><H4>Hier kann man einstellen, ob ein Sample vorw&auml;rts, r&uuml;ckw&auml;rtsoder cross (vorw&auml;rts, dann r&uuml;ckw&auml;rts)<BR><BR>gespielt werden soll.<BR><BR><BR><BR></H4><H3><I><STRONG>- Fader-Fenster (unmodal)</STRONG></I></H3><H4>Hier kann man den Fade-In und Fade-Out-Verlauf editieren.<BR><BR>Man kann neue Verl&auml;ufe per Maus zeichnen oder auf vorgefertigte<BR><BR>Verl&auml;ufe zur&uuml;ckgreifen (linear,square,exp,sqrt,log).<BR><BR>Diese Verl&auml;ufe kann man abspeichern und laden (Fileendung &quot;.FAD&quot;.<BR><BR><BR><BR></H4><H3><I><STRONG>- Monitor (funktion)</STRONG></I></H3><H4>Mit dieser Funktion kann man kontrollieren, ob die Samples vom Eingangbis zum Ausgang korrekt<BR><BR>verarbeitet werden.<BR><BR><BR><BR></H4><H3><I><STRONG>- Midi-Note (modal)</STRONG></I></H3><H4>Hier kann man die Midinote und dessen Kanal einstellen<BR><BR><BR><BR></H4><H3><I><STRONG>- Load und Save (modal)</STRONG></I></H3><H4>Hier kann man den Speicherinhalt bzw. das Sample abspeichern oder laden.<BR><BR>Beim laden kann man w&auml;hlen, ob nur dieses eine Sample in den Speicher<BR><BR>soll (dann wird vorher der Speicher gel&ouml;scht und dann das Sample anden<BR><BR>Anfang geladen) oder ob es an das Ende der schon im Speicher stehenden<BR><BR>Samples angeh&auml;ngt werden soll.<BR><BR>Beim speichern kann man w&auml;hlen, ob der gesamte Speicherinhalt abgespeichert<BR><BR>werden soll, oder nur ein Bereich, der durch Savemarker vorher bestimmtwurde.<BR><BR><BR><BR></H4><H3><I><STRONG>- DSP-Toolbar (unmodal)</STRONG></I></H3><H4>Hier kann man die Effekte in den DSP (sofern vorhanden) laden.<BR><BR>Zur Auswahl stehen momentan Echo,Lowpass,Flanger,Chorus,Pinknoise und Bypass.<BR><BR>Vorgesehen (sp&auml;ter) sind noch Hall, High und Bandpass, Equalizer<BR><BR>Da STARTRACK die DSP-Programme im LOD-Format verarbeitet und diese &uuml;berdie DSP-Toolbar<BR><BR>auch ladbar sind, steht eigenen DSP-Programmen nichts im Wege.<BR><BR><BR><BR></H4><H3><I><STRONG>- Musicbox-Fileselector (unmodal)</STRONG></I></H3><H4>Hier kann man eine Playlist definieren (per Fileselektor) um ganze Titel<BR><BR>in einer festgelegten Reihenfolge abzuspielen. Diese Playlist kann<BR><BR>abgespeichert und geladen werden (Fileendung &quot;.BOX&quot;).Man definiertzuerst<BR><BR>einen Suchpfad f&uuml;r Samples und addiert diesen Pfad zu einer Pfadliste<BR><BR>(Fileendung &quot;.SEL&quot;) mit &quot;ADD&quot;.<BR><BR>So kann man mehrere Suchpfade definieren in denen gesucht werden soll.<BR><BR>M&ouml;chte man eine neue Pfadliste definieren dr&uuml;ckt man auf den Button&quot;NEW&quot;.<BR><BR>Die gefundenen Samples werden aufgelistet und vorhandene Kommentare zu den<BR><BR>Aufnahmen werden angezeigt um die Suche in gro&szlig;en Datenbest&auml;ndenzu erleichtern.<BR><BR>Dann w&auml;hlt man die Samples aus, die man spielen m&ouml;chte und f&uuml;gtsie in<BR><BR>die Playlist ein. Wenn man dann den Musicbox-Button dr&uuml;ckt, bekommt<BR><BR>man statt der Liste aller Samples nun die ausgew&auml;hlten Samples pr&auml;sentiert.<BR><BR>Mit diesem Button kann man zwischen der Gesamtdarstellung und der Playlist<BR><BR>wechseln. Nun noch Play dr&uuml;cken - und ab geht die Musicbox.<BR><BR>Eine Anspielfunktion ist auch vorhanden, bei der jeder Titel 10 Sekundenangespielt wird.<BR><BR>Man kann dieses Fenster auch benutzen um Samples in den Editor zu laden.<BR><BR>Das ist komfortabler, da alle Suchpfade automatisch durchforstet werden,<BR><BR>und nur die Sample-Dateien mit Kommentaren angezeigt werden.<BR><BR><BR><BR></H4><H3><I><STRONG>- Multitrack-Fenster (unmodal)</STRONG></I></H3><H4>Das ist wohl eines der wichtigsten Fenster.<BR><BR>Die X-Achse definiert die Zeiteinheit und auf der Y-Achse sind die Spuren<BR><BR>angeordnet.<BR><BR>Hier kann man eine Playlist f&uuml;r bis zu 99 Stereokan&auml;le definieren.<BR><BR>Davon k&ouml;nnen bis zu 16 Kan&auml;le ausgew&auml;hlt und in Echtzeitgemischt und wiedergegeben<BR><BR>werden (wie bei einem 16Spur-Tonband). Daf&uuml;r ben&ouml;tigt man keinenDSP.<BR><BR>Ein schneller TOS-Computer (Medusa,Hades) ist schnell genug um ohne DSP<BR><BR>auskommen zu k&ouml;nnen. Der TT schafft 8 Spuren mit 48kHz, allerdingsnur<BR><BR>mit DSP-Erweiterungsplatine, da die Rechenleistung sonst nicht ausreicht.<BR><BR>In erster Linie h&auml;ngt die Spuranzahl von der Rechnergeschwindigkeitund<BR><BR>von der Geschwindigkeit der Festplatte ab.<BR><BR>In diesem Fenster kann man also die Samples die auf der Festplatte liegen,<BR><BR>zu einem &quot;Song&quot; arrangieren. Man l&auml;dt dazu die Samples undbestimmt grob<BR><BR>per Abh&ouml;ren (PLAY,STOP,Pause,Vorlauf,R&uuml;cklauf,Aufnahme) den Startund<BR><BR>das Ende eines Samples (nicht-destruktiv,Sampledaten werden nicht ver&auml;ndert)<BR><BR>Man kann dann mittels Buttons oder Werteeingabe den Start und das<BR><BR>Ende eines Samples feinjustieren oder man &uuml;bernimmt einfach die mitim<BR><BR>Sample abgespeicherten Loop-Marken f&uuml;r Start und Ende.<BR><BR>Das Sample kann man danach wenn n&ouml;tig per Drag und Drop an eine andereAbspielposition<BR><BR>verschieben, oder auch &uuml;ber Werteeingabe auf eine neue Position setzen.<BR><BR>Da man auch hier Zoom- und Scrollfunktionen benutzen kann, geht das geradeper Drag & Drop<BR><BR>sehr genau.<BR><BR>Man kann die Samples hier auch &uuml;ber das Clipboard per Drag&amp;Dropkopieren. Das geht auch<BR><BR>mit kompletten Spuren. Es gibt einen Fileselector der alle bisher benutztenSamples <BR><BR>nach ihrer Reihenfolge auflistet.<BR><BR>Hier kann man auch gezielt nach einem bestimmten Sample suchen lassen, dasdann in die<BR><BR>linke obere Ecke des Trakker-Fensters gescrollt wird. Hier k&ouml;nnen auchdie Kommentare<BR><BR>f&uuml;r die einzelnen Samples editiert werden. Dabei wird dann nachherin der linken<BR><BR>oberen Ecke jedes Sampleblocks entweder der Filename oder der Kommentareingeblendet.<BR><BR>Der Lautst&auml;rkeverlauf (Amplitude) der Samples wird im Fenster auf Wunschabgeschaltet<BR><BR>und es erscheint nur ein Block der die L&auml;nge des Samples definiert.Dadurch bekommt man<BR><BR>einen schnelleren Bildaufbau (wichtig f&uuml;r leistungsschwache Rechner).Es ist aber besser die<BR><BR>Darstellung der Amplituden einzuschalten, da man dann sehr genau die Samplesder verschiedenen<BR><BR>Spuren aufeinander trimmen kann um z.B. mit einem bestimmten Rhythmus synchronzu sein.<BR><BR>Man selektiert ein Sample mit der linken Maustaste, verschieben kann manes mit gedr&uuml;ckter<BR><BR>rechter Maustaste (unter MagicMac Apfel-Symbol + Maustaste). H&auml;lt manzus&auml;tzlich hierbei die<BR><BR>linke Shifttaste gedr&uuml;ckt, wird das selektierte Sample beim Loslassender Maustaste hinter das<BR><BR>davor liegende Sample gesetzt. H&auml;lt man stattdessen die rechte Shifttastezus&auml;tzlich gedr&uuml;ckt,<BR><BR>wandert das Sample direkt vor das dahinterliegende Sample. Das ist praktischum mehrere Samples<BR><BR>ohne Zwischenraum aneinanderzureihen um so, z.B. bei geeigneten Loopmarken,Wiederholungen zu erzeugen.<BR><BR>H&auml;lt man stattdessen zus&auml;tzlich die ALT-Taste gedr&uuml;ckt, kannman die Samplebl&ouml;cke direkt per Drag&amp;Drop<BR><BR>kopieren. H&auml;lt man die Tasten ALT &amp; Ctrl(Strg) stattdessen gedr&uuml;ckt,kann man das Sample per Drag&amp;Drop<BR><BR>in das Clipboard kopieren. Will man nun eine Kopie einf&uuml;gen, klicktman mit der linken Maustaste<BR><BR>auf das Clipboard und f&uuml;gt das Sample in die Playlist ein. Man kannden Start und das Ende eines Samples<BR><BR>auch per Marker direkt bestimmen. Dazu wird bei gedr&uuml;ckter Ctrl(Strg)-Tasteund gedr&uuml;ckter linker<BR><BR>Maustaste das Sample in den Editor geladen und man bestimmt dort per MarkerStart und Ende. Hat man<BR><BR>das gemacht, selektiert man den Quit-Button im Editor. Dabei wird dann ausnahmsweisenicht das Programm<BR><BR>beendet sondern die Marker in den Trakker &uuml;bernommen. Ganze Spurenkann man kopieren indem man den<BR><BR>Button mit der Spurnummer selektiert und in das Clipboard zieht. Anschlie&szlig;endzieht man das Clipboard<BR><BR>(bzw. das dann erscheinende, vorher kopierte Spurbutton) auf den Spurbutton,auf den kopiert werden soll.<BR><BR>Die Playlist kann man nat&uuml;rlich auch speichern und laden (Fileendung&quot;.TRK&quot;).<BR><BR>Die komplette Bearbeitung der Samples (wie auch im Midi-Playlistfenster)erfolgt<BR><BR>nichtdestruktiv, d.h. ohne die Sampledaten tats&auml;chlich zu ver&auml;ndern.<BR><BR>Eine SMPTE-Synchronisierung via MTC ist zwar vorgesehen aber noch nicht<BR><BR>implementiert.<BR><BR><BR><BR></H4><H3><I><STRONG>- Setup-Fenster (modal)</STRONG></I></H3><H4>* vertical lines: Darstellung der Samples als Peaks (Striche) bei Zoomgr&ouml;&szlig;er als 1:1<BR><BR>* link dots: Verbindung der Samples durch eine Ann&auml;herungskurve bei<BR><BR>Zoom gr&ouml;&szlig;er als 1:1<BR><BR>* fill spaces: F&uuml;llung der Zwischenr&auml;ume bei Zoom gr&ouml;&szlig;erals 1:1<BR><BR>* horizontal-lines: Horizontale Markierung bei 20/40/60/80 % Amplitude<BR><BR>zur besseren lesbarkeit.<BR><BR>* Y-autozoom: Zoomt die Amplitude automatisch bis zum h&ouml;chsten vorhandenen<BR><BR>Samplewert<BR><BR>* grid: farbige Markierung der geladenen Samples und graues Hintergrundmuster<BR><BR>* autorecord treshold: Ansprechschwelle in dB f&uuml;r die Aufnahmeamplitude<BR><BR>bei Auto-Record-Automatik<BR><BR>* malloc: Anzahl Bytes in Hex des f&uuml;r das Programm reservierten Speichers<BR><BR>* record-time: einstellbare default-Aufnahmezeit. Kann jederzeit vor der<BR><BR>Aufnahme ge&auml;ndert werden. Als Arbeitserleichterung um nicht<BR><BR>immer wieder die gleiche Aufnahmezeit einstellen zu m&uuml;ssen.<BR><BR>Eine Aufnahme ist aber trotzdem jederzeit durch STOP zu beenden.<BR><BR>* HDD-sektorlen: Gr&ouml;&szlig;e der Zugriffsbl&ouml;cke auf der Festplatte.Sollte<BR><BR>vorerst immer auf 16384 gesetzt bleiben.<BR><BR>* digital-in clock: Wenn gesetzt, wird alles vom digitalen Eingangstakt<BR><BR>synchronisiert bzw. getaktet. Die Taktratenauswahl<BR><BR>ist dann gesperrt und richtet sich nach dem Eingangstakt.<BR><BR>Betrifft vor allem die Aufnahme und Widergabe &uuml;ber die<BR><BR>A/D und D/A-Wandler.<BR><BR>* sampledata-defaultpath: Der Name sagt es schon: Pfad f&uuml;r die Sampleaufnahme-und<BR><BR>Wiedergabe. Alle anderen Files werden im Startpfad des Programms angelegt/gesucht.<BR><BR>* default format: Art des File-extenders f&uuml;r Samplefiles, also dasvoreingestellte Sampleformat.<BR><BR>Es kann aber jederzeit ein anderes benutzt werden. Es ist lediglich eine<BR><BR>Arbeitserleichterung bei der Arbeit.<BR><BR>* 3D: farbige Darstellung der Programmoberfl&auml;che im Multitos-Look (soweitm&ouml;glich)<BR><BR>wird erst nach Neustart ber&uuml;cksichtigt !<BR><BR>* flip: wenn gesetzt, springt die Function-Auswahl im Edit-Fenster nach<BR><BR>der Benutzung wieder auf MARK (weil meistbenutztes Feature)<BR><BR>wenn gel&ouml;scht, bleibt die zuletzt benutzte Funktion eingestellt.<BR><BR>* 0-XSNAP: Suche nach Null-Durchg&auml;ngen im Sample (zwecks Loop-Punkt)mittels<BR><BR>Shift erm&ouml;glichen.<BR><BR>* Menue: Men&uuml;erzeugung an der oberen Bildschirmkante<BR><BR>wird erst nach Neustart ber&uuml;cksichtigt !<BR><BR>* Time: Zeitanzeige im Edit-Info und Auto-Backup-M&ouml;glichkeit erlauben.<BR><BR>* Show: Anzeige der Zeitposition der Maus bzw. Marker im Edit-Info<BR><BR>* Turbo: f&uuml;r zeitoptimierte Aufnahme/Widergabe bei normalen STs wegengeringer Rechenleistung. <BR><BR>Relikt aus vergangener Zeit. Sollte vorerst eingeschaltet bleiben. Wirddemn&auml;chst anders<BR><BR>gel&ouml;st.<BR><BR>* Freeze:wenn gesetzt dann merkt sich das Programm die Fenster-Positionenbei SAVE im Setup<BR><BR>(und nur dann !) und setzt diese Fenster wieder auf die gleichen Positionenbeim<BR><BR>n&auml;chsten Start des Programms. <BR><BR>* View: Hier kann die Samplewert-Darstellung zwischen Zeit (in 1/100 sec)und Samples ausgew&auml;hlt werden.<BR><BR>* Save: Speichern der Setup-Datei &quot;SMP16.INF&quot;<BR><BR>* Load: Laden der Setup-Datei. Das passiert auch automatisch beim Startdes Programms.<BR><BR><BR><BR><STRONG>Das ist keine vollst&auml;ndige Erkl&auml;rung des Programms, dazuist hier auch nicht<BR><BR>genug Platz. Zum ausprobieren sollte es vorest ausreichend sein.<BR><BR>Ich habe einen Hypertext incl. Bildausschnitten der erkl&auml;rten Programmteilef&uuml;r das<BR><BR>Programm erstellt, da nur so wirklich sichtbar und verst&auml;ndlich wird,was gemeint ist.<BR><BR>Die Demo-Version enth&auml;lt einen solchen Hypertext der direkt im Programm&uuml;ber<BR><BR>die Help-Taste aufgerufen werden kann. Der Hypertext arbeitet mit 1stGuide.<BR><BR>Beim Kauf der Vollversion oder der Startrack-Karte ist zus&auml;tzlich auchein Handbuch<BR><BR>enthalten. Die Gr&ouml;&szlig;e der Fenster ist bewu&szlig;t auf max. 640x400beschr&auml;nkt worden,<BR><BR>um auch ohne Gro&szlig;bildschirm in ST-Aufl&ouml;sung arbeiten zu k&ouml;nnen.<BR><BR>Ab einer Aufl&ouml;sung von 1024x768 werden f&uuml;r Editor und Trackergr&ouml;&szlig;ere Fenster erzeugt.<BR><BR>Demn&auml;chst werden aber Fenster implementiert, die in ihrer Gr&ouml;&szlig;ever&auml;nderbar sind.<BR><BR>Aber auch so kriegt man den Bildschirm mit den vielen nonmodalen Fensternvoll. ;-)<BR><BR>Das Programm sollte eigentlich auf jeder Grafikkarte (vorzugsweise in Farbe)laufen.<BR><BR>Noch ein Tip: Man sollte sich ruhig die Arbeit machen, &uuml;berall maldraufzuklicken.<BR><BR>Manche Funktion ist im Editor gut versteckt, wenn man nicht wei&szlig; woman suchen soll.<BR><BR>Das Programm ist auch mit Sicherheit noch nicht fehlerfrei. Es ist<BR><BR>halt eine noch in heftiger Entwicklung befindliche Alpha-Version !<BR><BR>Also bitte nicht nachtragend sein. :-)<BR><BR>Das Programm kann alles au&thorn;er aufnehmen/wiedergeben (REC/PLAY).<BR><BR>Ich erkl&auml;re die Demo-Version hiermit ausdr&uuml;cklich als Freeware.<BR><BR>Wer noch Anregungen und W&uuml;nsche zu diesem Projekt hat - nur her damit!<BR><BR><BR>Meine Adresse: Stephan Wilhelm, Niehler Str. 312, 50735 K&ouml;ln<BR><BR><BR>Au&thorn;erdem bin ich im Mausnet unter email-Adresse &quot;Stephan Wilhelm@ K2&quot; oder im<BR><BR>Internet unter email-Adresse &quot;stepwil@aol.com&quot; zu erreichen.</STRONG></H4><P><CENTER><HR></CENTER><P><A HREF="dmain.html"><STRONG>zur&uuml;ck zur Hauptseite...<BR></STRONG></A></BODY></HTML>