<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Copyright</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="Copyright"></A>

<BASE TARGET="Right">

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="../index.htm" TARGET="_top"><img src="../images/buttlft.gif" width="70" height="25"</A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0002.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Copyright</H1></CENTER>

<PRE>
 
 Kein Teil der Software oder des Handbuchs darf ohne schriftliche Genehmigung
 der Fa. Stephan Wilhelm, Entwicklungsb&uuml;ro f&uuml;r Hard- und Software, K&ouml;ln in irgendeiner Form
 reproduziert und weitergegeben werden. Startrack ist urheberrechtlich gesch&uuml;tzt.

<H3> Gew&auml;hrleistungen</H3>
 Die Software und das Handbuch wurden mit gr&ouml;&szlig;ter Sorgfalt erstellt. Nur bei
 Programmfehlern, die ein Arbeiten mit der Startrack-Software unm&ouml;glich machen, leistet Fa.
 Stephan Wilhelm, Entwicklungsb&uuml;ro f&uuml;r Hard- und Software, K&ouml;ln nach R&uuml;cksendung der
 Systemdisketten kostenfreien Ersatz.

<H3> Haftungsausschlu&szlig;</H3>
 Die Fa. Stephan Wilhelm, Entwicklungsb&uuml;ro f&uuml;r Hard- und Software, K&ouml;ln kann
 keine Haftung f&uuml;r irgendwelche direkten oder indirekten Sch&auml;den - einschlie&szlig;lich aber nicht
 beschr&auml;nkt auf materielle oder finanzielle- &uuml;bernehmen , die auf Programmfehler, inkorrekte
 Angaben im Handbuch, unsachgem&auml;&szlig;e Benutzung der Hardware und/oder Software oder die
 Untauglichkeit derselben f&uuml;r einen bestimmten Zweck entstehen.

 Die Wiedergabe von Warenbezeichnungen, Handelsnamen oder sonstigen Kennzeichen in
 diesem Buch berechtigt nicht zu der Annahme, da&szlig; diese von jedermann
 frei genutzt werden d&uuml;rfen. Es kann sich auch dann um eingetragene
 Warenzeichen oder sonstige gesch&uuml;tzte Kennzeichen handeln, wenn sie nicht als solche
 gekennzeichnet sind. In diesem Handbuch genannte Produkte sind in der
 Regel durch Warenzeichen oder Patente ihrer Hersteller gesch&uuml;tzt.

 Dieses HTML-Handbuch wurde mit folgenden Atari-Programmen erstellt:
 PhotoLine 2.30, Papyrus Office 7, Papillon 3, CAB 2.7e und QED 4.52
 
 Als HTML-Referenzen dienten:
 SELFHTML 6 und 7 von Stefan M&uuml;nz
 HTML 3.2 Referenz-Handbuch, Sybex Verlag
 HTML 4 Kompendium, Markt und Technik Verlag
 
 Das Handbuch wurde auf folgenden Browsern getestet:
 CAB 2.7e (Atari), Netscape 4.xx - 4.6, Microsoft InterNet Explorer 4 und 5
 
 
 <B>Copyright &copy; 1997-1999 by SWE

 Stephan Wilhelm, Entwicklungsb&uuml;ro f&uuml;r Hard- und Software, Niehler Str. 312, 50735 K&ouml;ln,
 Telefon 0221-7127380, Fax: 0221-685184

 Email: <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A>
 Internet-Homepage: <A HREF="http://members.aol.com/swenet/">StarTrack Homepage</A>

 Mausnet: <A HREF="mailto:stephan_wilhelm@k2.maus.de">Stephan Wilhelm @ K2</A></B>

</PRE>

<A HREF="#Copyright">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>