<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.16.3"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0108.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0110.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.16.3 Das Fenster-Men&uuml;</H3>

 <I>Grundeinstellungen</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0061.htm">Grundeinstellungen</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-G.

 <I>Blockfunktionen</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0077.htm">Blockfunktionen</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-B.

 <I>Peakmeter</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0062.htm">Aussteuerung und Aufnahme</A> bzw. holt
 es in den Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-P.

 <I>Arranger</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r den <A HREF="page0082.htm">MIDI-Sampleplayer</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-A.

 <I>Tracker</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0087.htm">Mehrspurfunktionen</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-T.

 <I>Loops</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0063.htm">Loopfunktionen</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-O.

 <I>DSP</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0073.htm">DSP-Effekte</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-D.

 <I>Workmode</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r <A HREF="page0081.htm">Sync- und Datenpfadeinstellungen</A> bzw. holt
 es in den Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-W.

 <I>Cuelist</I>
 Hiermit &ouml;ffnet man das Fenster f&uuml;r die <A HREF="page0103.htm">Cuelist-Funktionen</A> bzw. holt es in den
 Vordergrund, falls es von einem anderen Fenster verdeckt wird.
 Das geht au&szlig;erdem auch mit der Tastenkombination CTRL-C.

</PRE>

<A HREF="#4.16.3">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>