<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Anhang</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="6."></A>
<A NAME="6.1"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0144.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0146.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Anhang</H1></CENTER>

<PRE>

<H3> 6. Erste Hilfe</H3>
<H3> 6.1 Fragen &amp; Antworten</H3>
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe St&ouml;rungen (Knistern) bzw. keine Wiedergabe bei meiner DSP-Port-Erweiterung (Analog8 oder 
Jam-Out)</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Das Kabel des DSP-Ports ist nicht beliebig verl&auml;ngerbar,die Maximall&auml;nge ist ungef&auml;hr 20cm, da es
ansonsten zu St&ouml;rungen (Knackser) bei den	DSP-Port-Erweiterungen kommt. Das ist verst&auml;ndlich wenn 
man bedenkt, welch hohe Frequenzen das Kabel bew&auml;ltigen mu&szlig; (&Uuml;ber 6 MHz). Dabei kommt es ab 
einer bestimmten L&auml;nge zwangsl&auml;ufig zu &Auml;nderungen in Timing und Flanken der Signale, die eine
sichere und st&ouml;rfreie &Uuml;bertragung unm&ouml;glich machen. Daher sollte dieses Kabel m&ouml;glichst kurz
sein bzw. n&ouml;tigenfalls gek&uuml;rzt werden.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe die Startrack-Karte eingebaut und mit der HIFI-Anlage verbunden.
Ich kann aber nichts h&ouml;ren.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Die Startrack-Karte mu&szlig; zuerst initialisiert werden. Starten sie hierf&uuml;r zuerst das STARTRAK.PRG 
und kontrollieren sie, ob im <A HREF="page0061.htm">Connections-Fenster</A> der korrekte Eingang ausgew&auml;hlt wurde.
Kontrollieren sie im <A HREF="page0062.htm">Peakmeter-Fenster</A>, ob die Lautst&auml;rke von Ein- und Ausgangs-Lautst&auml;rkeregler der 
Karte auf ca. 0dB eingestellt ist. Ist die richtige Anschlu&szlig;quelle am Verst&auml;rker eingestellt?</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP>Wo kann ich Hilfe bekommen, wenn ich technische Probleme habe ?</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Wenden sie sich zuerst an ihren H&auml;ndler bzw. denzust&auml;ndigen Vertrieb.
Wenn diese nicht weiterhelfen k&ouml;nnen, wenden sie sich direkt an den <A HREF="page0146.htm">Entwickler</A>: Firma Stephan
Wilhelm,Entwicklungsb&uuml;ro f&uuml;r Hard- und Software, Niehler Str. 312, 50735 K&ouml;ln, Tel: 0221-7127380, 
Fax: 0221-685184</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP>Wenn ich im Tracker-Fenster die Wiedergabe starten m&ouml;chte, st&uuml;rzt das Programm ab.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Dies ist ein bekannter Fehler der bald behoben wird. Sie haben dem Programm m&ouml;glicherweise zu
wenig Speicher reserviert. Sie m&uuml;ssen hierf&uuml;r im <A HREF="page0060.htm">Setup-Dialog</A> den malloc-Wert auf mindestens 
8192KB erh&ouml;hen. Dann sollte der Fehler nicht mehr auftauchen.
</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe &ouml;fter St&ouml;rungen oder Aussetzer in der Wiedergabe, der Rechner bleibt h&auml;ngen, die Maus wird 
hakelig oder bleibt stehen.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Ihr Rechner geh&ouml;rt anscheinend nicht zu den schnellsten und ist &uuml;berlastet.
Entfernen sie alle unn&ouml;tigen Accessories und Auto-Ordner-Programme.
Diese dr&uuml;cken oft das Tempo des Rechners zu weit herunter. HD-Recording stellt hohe Anforderungen 
an den Rechner. HD-Wiedergabe von mehreren Spuren ist auf dem TT nur mit der DSP-Erweiterung 
m&ouml;glich, da der Rechner daf&uuml;r sonst zu langsam ist. M&ouml;glicherweise ist auch ihr TT-Netzteil
&uuml;berlastet. 
Versuchen sie es einmal mit einem st&auml;rkeren PC-Netzteil(230W).</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Der Rechner st&uuml;rzt bei Wiedergabe oder Aufnahme auf HD &ouml;fters ab.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>M&ouml;glicherweise ist ihr Netzteil zu schwach oder sie haben ein Netzteil schlechter Qualit&auml;t, da&szlig;
St&ouml;rspitzen verursacht. Testen sie es mal mit einem anderen, etwas st&auml;rkeren Netzteil. Die
Stromversorgung zur Startrack-Karte ist vielleicht schlecht, das Stromkabel zu lang oder zu d&uuml;nn.
Es kann auch daran liegen, da&szlig; die Karte schlecht bel&uuml;ftet wird und dadurch zu hei&szlig; wird.
Versuchen sie einmal die Karte im Betrieb mit einem CPU-L&uuml;fter zu bel&uuml;ften. Vielleicht ist auch ihr 
VME-Kabel oder das DSP-Port-Kabel zu lang.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Das Startrack-Programm meldet &quot;Keine Startrack-Karte gefunden&quot;.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Die Karte ist nicht richtig eingesteckt oder der VME-Stecker der Karte ist besch&auml;digt. &Uuml;berpr&uuml;fen sie 
einmal die Kontakte, ob keiner der 96 Kontakte abgebrochen oder abgeknickt ist. Das kann leicht bei 
unsachgem&auml;&szlig;er Montage oder roher Gewalt beim Einbau passieren. Entfernen sie alle anderen eventuell 
eingesteckten VME-Karten vom VME-Bus. Vielleicht st&ouml;rt eine dieser Karten bzw. nutzt den gleichen 
VME-Adre&szlig;bereich. Sollte das der Fall sein, melden sie das bitte an den <A HREF="page0146.htm">Entwickler</A> oder den deutschen 
Vertrieb. Der Adre&szlig;bereich der Startrack-Karte kann ver&auml;ndert und durch	Umprogrammierung der
Karte in einen anderen Bereich gelegt werden. Wir passen in diesem Fall die Startrack-Karte ihren
Erfordernissen an. &Uuml;berpr&uuml;fen sie mal das VME-Kabel. Vielleicht ist es besch&auml;digt.
Haben sie eine VME-Sloterweiterung? Dann versuchen sie mal die Karte in	einen anderen Slot zu 
stecken.Schalten sie aber vorher den Rechner aus! Die Startrack-Karte nutzt Interrupts. Daher sollten 
die DaisyChain-Anschl&uuml;sse	INTIN und INTOUT des VME-Bus auf der VME-Backplane bis zum
erforderlichen Slot gejumpert sein. Haben sie die VME-Sloterweiterung von uns, so haben sie damit 
keine Probleme, da unsere Backplane dies automatisch macht (Schalter in den Kontakten).</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Meine Falcon-Programme (CubaseAudio, Logic-Audio, Audiotracker usw.) die den DSP oder die
Audiohardware des Falcon nutzen laufen nicht mit Startrack zusammen.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Das ist ein Problem an dem wir arbeiten. Der XBIOS-Treiber (SOUND.PRG) beinhaltet u.a.
alle Sound- und DSP-Betriebsystemaufrufe. Diese machen die Audiokarte weitgehend kompatibel zu 
Falcon-Programmen. Kleinere Anpassungen der Programme an die etwas anders funktionierende
Hardware der Startrack-Karte werden aber unvermeidlich sein, da die Programme nicht in allen F&auml;llen 
auf Betriebssystemfunktionen zugreifen und teilweise die Falcon-Soundhardware direkt	ansprechen.
Das kann prinzipbedingt nicht funktionieren. Fragen sie ihren Software-Hersteller nach einer
angepa&szlig;ten Startrack-Version. Erfolgreich getestet wurde bisher die komplette DSP-Suite von
SoundPool, bestehend aus Analyser, EQ, De-Noiser und Dynamite, die Programme VoXX
(Software-Vocoder), WinRec, Trackcom, Zero-X, Frak, Frakt-me, Gemjing, Aiffplayer,
Gem-MPEG, DSP JPEG-Plugin f&uuml;r CAB und Aniplayer.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Der Rechner st&uuml;rzt ab, wenn man Fenster aus dem Bildschirm-Bereich herausschiebt.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Das ist ein alter Fehler im TOS und &auml;lteren NVDI-Versionen. Benutzen sie eine m&ouml;glichst aktuelle 
NVDI-Version ab V5.0.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Die Textdarstellung in der <A HREF="page0087.htm">Timeline</A> und in der <A HREF="page0062.htm">Peakmeter-Zeitdarstellung</A> ist falsch bzw. zu gro&szlig; oder 
zu klein.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Benutzen sie eine neuere NVDI-Version ab V5.0. Es kann auch an einer	falschen Einstellung der
Parameter in der Datei ASSIGN.SYS (auf Lfw. C) liegen.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Es gibt gelegentliche Aussetzer bei Aufnahme oder Wiedergabe des Atari TT.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Der TT arbeitet an seiner Leistungsgrenze. Es gibt einige M&ouml;glichkeiten, da&szlig; Programm an die
geringere Leistungsf&auml;higkeit anzupassen. 1. Schalten sie im Setup die <A HREF="page0060.htm">Option &quot;calculation by
record&quot;</A> aus. Die Peakdarstellung wird durch diese Funktion w&auml;hrend der Aufnahme berechnet. Das kostet viel 
Rechenzeit. 2. Schalten sie im Setup die <A HREF="page0060.htm">Jitter-Option</A> ab. Durch diese Funktion wird der Bildaufbau mit 
dem Vsync-Signal des Monitors synchronisiert. 3. Setzen sie die Option <A HREF="page0060.htm">&quot;HDD-sektorlen&quot;</A> nach oben. 
Hiermit wird die Anzahl der Bl&ouml;cke bestimmt, die je Zugriff auf die Festplatte an einem St&uuml;ck
geschrieben oder gelesen werden. 4. Sorgen sie f&uuml;r gen&uuml;gend freien RAM-Speicher und ausreichend 
Sample-RAM (<A HREF="page0060.htm">Setup, Opt. &quot;malloc&quot;</A>). Au&szlig;erdem wird NVDI und/oder MagiC empfohlen.
</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Die Software bleibt &ouml;fters h&auml;ngen, die Hardware reagiert nicht auf Einstellungen in der Software,
es gibt gelegentliche Fehlfunktionen der Hardware in verschiedenen Bereichen.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Es gibt evtl. Probleme mit TT-Rechnern der ersten Revisionen bis Rev. D. Der VME-Bus dieser
Rechner ist teilweise sehr problematisch. Hier hilft nur der Austausch des TT-Boards gegen eine
aktuellere Revision, evtl. hilft auch der Austausch der VME-GAL-Chips. Genauere Aussagen k&ouml;nnen 
nicht gemacht werden, da dies bisher nur einmal der Fall war.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich besitze einen TT mit StarTrack Audiokarte und m&ouml;chte diese nun im Milan oder Hades
betreiben. Was ist zu beachten ?</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Es gibt f&uuml;r Tower-Rechner eine spezielle Einbauvariante. Hierbei wird die Audiokarte in einen freien 
Laufwerkslot eingebaut. Senden sie die Karte gut verpackt an den Hersteller <A HREF="page0146.htm">SWE</A>. Dieser wird ihnen 
die Karte entsprechend zum Einbau in den HDD-Slot wandeln.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe einen Atari-TT mit VME-Grafikkarte und m&ouml;chte diese weiterverwenden und zusammen mit 
der Audiokarte betreiben. Geht das?</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Im Prinzip ja. Es gibt 2 M&ouml;glichkeiten hierf&uuml;r. Man kann eine sogenannte Backplane mit 2 VME-Slots 
einbauen. Diese wird einfach in den vorhandenen VME-Slot des TT eingesteckt. Das &auml;u&szlig;ere
Abschirmblech des Slots mu&szlig; hierf&uuml;r entfernt werden. Die beiden VME-Karten stehen dann aber ein 
paar Zentimeter &uuml;ber den Geh&auml;userand. Die VME-Backplanes sind leider nicht	ganz billig und k&ouml;nnen 
&uuml;ber die Firma <A HREF="page0146.htm">SWE</A> bezogen werden. Der Betrieb ohne Backplane ist wegen der geringen
Treiberleistung im TT normalerweise nicht so ohne weiteres m&ouml;glich. Bei der zweiten M&ouml;glichkeit
verl&auml;ngert man den VME-Bus mit einem speziellen Flachbandkabel nach au&szlig;en. Dort schlie&szlig;t man 
dann ebenfalls eine Backplane an, da durch die zu geringe Treiberleistung und die fehlende
Terminierung am Kabelende, ein zuverl&auml;ssiger Betrieb der beiden Karten sonst nicht m&ouml;glich ist.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Das Programm st&uuml;rzt beim Start ab oder gibt eine Fehlermeldung aus.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Sie haben vermutlich zu wenig freies RAM. HD-Recording verlangt prinzipbedingt nach viel RAM.
Sie sollten mindestens 4, besser 8MB freies RAM haben. Es k&ouml;nnte auch sein, da&szlig; die Karte nicht
richtig eingesteckt	ist oder das Kabel nicht korrekt auf dem Stecker sitzt. Speziell beim Hades mu&szlig; man 
aufpassen, da&szlig; man den VME-Stecker nicht verpolt.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Beim Betrieb der Audiokarte mit Falcon-Software h&ouml;rt man nur Rauschen am Audioausgang bzw. vom 
Audioeingang. Was kann das sein?</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Sie ben&ouml;tigen wahrscheinlich ein Hardware-Update der Audiokarte. Alle Audiokarten mit Kaufdatum 
vor Mai 1998 haben noch die alte Chip-Programmierung. Schicken sie die Audiokarte gut verpackt
zum Hersteller <A HREF="page0146.htm">SWE</A>. Dieser Service ist kostenlos!</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Einige der aufgef&uuml;hrten, lauff&auml;higen Falcon-Programme laufen auf meinem Atari TT nicht.
Was kann die Ursache sein?</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Kopieren sie das Programm DSP ROUT.PRG in den Autoordner. Dieses spiegelt die DSP-Register in 
den Falcon-Adre&szlig;bereich. Einige unsauber programmierte Software greift direkt auf die Hardware zu.
Leider l&auml;uft dieses Patchprogramm momentan noch nicht unter MagiC. Leider gibt es auch Software,
die direkt auf Soundregister des Falcon zugreift. Diese Fehler k&ouml;nnen leider auf dem TT nicht
verhindert werden, da dieser Registerbereich beim TT teilweise bereits mit anderen Registern
(8Bit-Sound DMA) belegt ist. Der Hades ist diesbez&uuml;glich sehr fehlertolerant, da beim Zugriff auf diese 
Register keine andere Hardware im Weg ist und auch keine Busfehlermeldung ausgel&ouml;st wird. Fragen 
sie bei Bedarf nach einer neuen Version ihrer Falcon-Software, die keine direkten Hardware-Zugriffe
enth&auml;lt.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe Probleme beim Zugriff auf die Festplatte mit meinem Hades unter Verwendung von
Big-DOS. Der Zugriff ist sehr langsam, es gibt oft	Aussetzer.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Auf dem Hades gibt es erhebliche Probleme mit Big-DOS. Entfernen sie dieses Programm aus dem
Autoordner. Der Fehler liegt am verkorksten Hades-Acc, da&szlig; den Speicherbereich f&uuml;r die Romport-
Karte zu sp&auml;t (wenn GEM bereits aktiv und Big-DOS bereits installiert wurde) in ST und TT-Ram
splittet. Solange es kein neues Hades-Acc f&uuml;r den Autoordner gibt, kann man dieses Problem nur
teilweise l&ouml;sen. Durch &Auml;nderungen an den Fastload und	Speicherflags von Big-DOS kann man den 
Fehler vor&uuml;bergehend beheben. Es kann aber sein, da&szlig; nach einer gewissen Zeit der gleiche Fehler
wieder auftritt. Dann hilft nur wieder mit den Flags zu experimientieren.
Tip: MagiC verwenden oder auf Big-DOS verzichten.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe Aussetzer bei Wiedergabe von CD-ROM.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Haben sie ein CD-ROM der ersten Generation (2x-4x), dann ist es wahrscheinlich zu langsam f&uuml;r
direkte Wiedergabe. Besorgen sie sich ein CD-ROM ab 8x aufw&auml;rts oder kopieren sie die Dateien auf 
die Festplatte, um sie davon abzuspielen.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe gelegentliche Aussetzer bei Wiedergabe oder Aufnahme.</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Viele Autoordner-Programme und Accessorys zehren an der	Geschwindigkeit des Rechners.
Versuchen sie, auf einige davon zu verzichten. Evtl. ist ihre Festplatte auch zu langsam. Ersetzen sie 
diese gegen ein neues Modell. Optimieren sie ihre Festplatte mit einem Defragmentierprogramm
wie z.B. Optimize oder Diskus.</TD>
</TR>
</TABLE>

<BR>

<TABLE>
<TR>
<TD VALIGN=TOP>F:</TD>
<TD VALIGN=TOP WIDTH=610>Ich habe eine ATI-Grafikkarte mit Nova-VDI. Invertierungen im Programm sind kaum lesbar, was
mache ich falsch?</TD>
</TR>
</TABLE>
<TABLE>
<TR>
<TD VALIGN=TOP>A:</TD>
<TD VALIGN=TOP WIDTH=610>Dies ist ein Fehler im Nova-VDI, der derzeit leider nicht zu beheben ist. Daher versucht das
Programm, diesen Fehler durch geeignete Farben bestm&ouml;glich zu umgehen.</TD>
</TR>
</TABLE>

<PRE>
 !!! Wichtig !!!

 F&uuml;r alle Basteleien an der Hardware gilt: Wir &Uuml;bernehmen keine Garantie
 f&uuml;r fehlgeschlagene Experimente und sie verlieren durch unsachgem&auml;&szlig;e Behandlung
 der Platinen ihre Garantie! Also gehen sie vorsichtig mit den Startrack-Karten um
 und fragen sie bei Unsicherheiten zuerst ihren H&auml;ndler oder Vertrieb.

</PRE>

<A HREF="#6.">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>