<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Hardware</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="2.3.2"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0034.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0036.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Hardware</H1></CENTER>

<PRE>
<H3> 2.3.2 DSP-Karte</H3>
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>Motorola DSP56002-66MHz (Falcon=33MHz). Der DSP kann wahlweise in den Aufnahme- oder
Wiedergabezweig integriert werden (softwarem&auml;&szlig;ig steuerbar). Der DSP ist f&uuml;r das
Harddisk-Recording 
nicht notwendig, da die Karte den Transfer selbst puffert. Das funktioniert &auml;hnlich wie die DMA-Matrix 
im Falcon. Daher steht der DSP quasi komplett f&uuml;r Effekt-Berechnungen zur Verf&uuml;gung. Die
DSP-Erweiterung wird auf die StarTrack-Karte aufgesteckt.</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>128Kx24Bit Fast-RAM, 12ns (Falcon=32Kx24Bit).</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>4-Kanal-Modus: Hierbei werden die analogen und digitalen Anschl&uuml;sse parallel betrieben, d.h. hiermit ist 
Vierkanal-Aufnahme und Vierkanal-Wiedergabe m&ouml;glich.</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>Falcon 8-Kanal-Modus. In diesem Modus kann die Startrack-Karte bis zu 8 Kan&auml;le getrennt verarbeiten.
Das Datenformat ist dabei voll kompatibel zur Falcon DMA-Matrix.</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>DSP-Port (Falcon-kompatibel). Erm&ouml;glicht die Aufnahme und Wiedergabe &uuml;ber 8 getrennte analoge Ein- 
und Ausg&auml;nge mit Falcon-Zusatzhardware (Analog8, ADAT, FA8, Jam-In/Jam-Out).</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>Falcon-Clockdivider: Mit einem externen 25.175 MHz-Clockmodul f&uuml;r den DSP-Port kann man alle
Falcon-Sampleraten nutzen (z.B. 49200 Hz)</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>ONCE-Port: Dies ist ein standardisierter Debug-Port f&uuml;r die Motorola DSPs. Man kann hier&uuml;ber einen PC 
via RS232 ankoppeln und mit einem speziellen Debugger-Programm direkt w&auml;hrend der Laufzeit eines 
DSP-Programms in den Ablauf eingreifen. Dies ist eine sehr hilfreiche M&ouml;glichkeit zur Fehlersuche in 
DSP-Programmen. Der ONCE-Port ist voll kompatibel mit dem DSP-Entwicklungssystem EVM56002 
von Motorola. Die Debug-Software ist kostenlos erh&auml;ltlich und erlaubt u.a. Breakpoints, Trace, Auslesen 
und &Auml;ndern von Registern etc.</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=624>16Kanal-Modus (optional). Dieser Modus stellt 2 Matrix-Datenpfade f&uuml;r die Erweiterung auf 16 
Einzelausg&auml;nge bereit. Dabei wurde der DSP-Port f&uuml;r den Anschlu&szlig; von 2
Einzelausgangs-Erweiterungen 
vorbereitet (z.B. f&uuml;r 2 x Jam-Out)!</TD>
</TR>
</TABLE>
<BR>

<A HREF="#2.3.2">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>