<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.10.2"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0075.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0077.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.10.2 Plugin-Konfiguration</H3>
<IMG SRC="../images/p172.gif" WIDTH="592" HEIGHT="380">

 In diesem Dialog wird die CPU Plugin-Einbindung konfiguriert. Der Atari TT
 bzw. 030er CPUs sind f&uuml;r diese rechenintensiven Anwendungen leider zu
 schmalbr&uuml;stig. Es mu&szlig; mindestens ein Rechner mit 040er CPU sein.
 Doch auch mit diesem Prozessor reicht die Rechenleistung nur f&uuml;r
 ca. 1-2 Plugins. Erst mit einem 060er Prozessor hat man eine ausreichende
 Geschwindigkeit f&uuml;r ca. 4-5 Plugins. Die Plugins haben eine definierte
 Programmierschnittstelle, die es auch Fremdanbietern erm&ouml;glicht,
 spezielle Algorithmen f&uuml;r das StarTrack-System anbieten zu k&ouml;nnen.
 Es sind maximal 5 Plugins pro Effektweg m&ouml;glich.
 Aufgerufen wird der Konfigurations-Dialog durch Eingabe von SHIFT-ALT-C
 oder &uuml;ber das optionale Programm-Men&uuml; im <A HREF="page0111.htm">Dropdown Plugins/Konfigurieren</A>.


 1) Plugin-Liste

 Hier werden alle vorhandenen Plugins aufgelistet. Die Plugins werden in die
 Rec-List(2) oder Play-List(3) &uuml;bernommen, indem man einfach auf den Eintrag
 klickt.


 2) Record-List

 Das ist die Plugin-Liste f&uuml;r den Aufnahmezweig. Die Plugins werden in der
 angegebenen Reihenfolge von der CPU abgearbeitet. Dabei kann ein Plugin auch
 mehrfach in der Liste stehen bzw. verwendet werden. Die Plugins k&ouml;nnen auch
 gleichzeitig im Record- und Wiedergabezweig verwendet werden.


 3) Play-List

 Das ist die Plugin-Liste f&uuml;r den Wiedergabezweig. Die Plugins werden in der
 angegebenen Reihenfolge von der CPU abgearbeitet. Dabei kann ein Plugin auch
 mehrfach in der Liste stehen bzw. verwendet werden. Die Plugins k&ouml;nnen auch
 gleichzeitig im Record- und Wiedergabezweig verwendet werden.


 4) Rec-Select

 Wenn der Button Rec-Select ausgew&auml;hlt wurde, wird die Auswahl der Plugins
 aus der Plugin-Liste(1) in die Record-List f&uuml;r den Aufnahmezweig eingetragen.


 5) Play-Select

 Wenn der Button Play-Select ausgew&auml;hlt wurde, wird die Auswahl der Plugins
 aus der Plugin-Liste(1) in die Play-List f&uuml;r den Wiedergabezweig eingetragen.


 6) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 7) Load

 Hiermit kann man die <A HREF="page0138.htm">Plugin-Konfigurationsdatei</A> (Endung *.CFG) laden.


 8) Save

 Hiermit kann man die Konfiguration der Plugins in einer Datei (Endung *.CFG)
 abspeichern. Man kann sich so mehrere, f&uuml;r den gew&uuml;nschten Einsatzweck
 passende, Konfigurationen anlegen.


 9) Clear

 Hiermit wir die komplette Record-List bzw. Play-List gel&ouml;scht, je nachdem ob
 der Button Rec-Select oder Play-Select ausgew&auml;hlt wurde.


 10) Ok

 Hiermit wird der Dialog f&uuml;r die Plugin-Konfiguration geschlossen. Die
 Plugin-Listen sind sofort anwendbar.

</PRE>

<A HREF="#4.10.2">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>