<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.1.13"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0053.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0055.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.1.13 Informationsbereich</H3>
<IMG SRC="../images/p106.gif" WIDTH="304" HEIGHT="130">

 Hier&uuml;ber wird der Benutzer &uuml;ber verschiedene Einstellungen informiert.
 Die blau umrandeten Felder k&ouml;nnen angeklickt werden, d.h. hinter diesen
 Feldern verbergen sich weitere Informationen oder Funktionen.


 1) L&auml;nge des Samples/Sample-Memory in Kilobyte

 Hier wird die L&auml;nge des geladenen Samples angegeben. Wurde kein Sample
 geladen, entspricht dieser Wert der L&auml;nge des Sample-Memory in KB (Kilobyte).
 Klickt man auf das Anzeigefeld, wird die Gesamtl&auml;nge des Sample-Memory in
 KB (Kilobyte) angegeben.


 2) Spielzeit des Samples/Sample-Memory

 Hier wird die Spielzeit des geladenen Samples im Format HH:MM:SS XX
 (Stunden:Minuten:Sekunden Frames) angegeben. Wurde kein Sample geladen,
 entspricht dieser Wert der Spielzeit des Sample-Memory. Klickt man auf
 das Anzeigefeld, wird die Spielzeit des Sample-Memory angegeben.


 3) Name der Sample-Datei

 Hier erscheint der Name der zuletzt geladenen bzw. gespeicherten
 Sample-Datei. Klickt man auf dieses Anzeigefeld, erh&auml;lt man noch genauere
 Informationen &uuml;ber das Sample im dann erscheinenden <A HREF="page0056.htm">Sample-Information-
 Dialog</A>. Hier kann man jederzeit die zum Sample geh&ouml;renden Kommentarfelder
 eingeben bzw. editieren und die Markerliste aktualisieren (OK-Button).


 4) Uhrzeit

 Hier steht die momentane Uhrzeit der Systemuhr. Dahinter steckt aber auch
 der <A HREF="page0055.htm">Backup-Dialog</A>. Man gelangt in den <A HREF="page0055.htm">Backup-Dialog</A>, indem man auf das
 Uhrzeit-Feld klickt. Ist die Auto-Backup-Option eingeschaltet, wird das
 Feld selektiert dargestellt. Dann wird nach der eingestellten Zeit jeweils
 ein Backup der Arbeitsumgebung durchgef&uuml;hrt.


 5) Zeitposition des Mauszeigers bzw. Markers beim Draggen

 Der Wert zeigt die Markerposition beim Draggen an. Wenn man mit der Maus
 &uuml;ber das <A HREF="page0043.htm">Sample-Window</A> f&auml;hrt, wird hier die Position des Mauszeigers im
 Sample angezeigt. Es gibt zwei unterschiedliche Darstellungsarten.
 Die Darstellungsart kann im <A HREF="page0060.htm">Setup-Dialog</A> (View-Button) eingestellt werden.
 Man hat die Wahl zwischen der Zeitanzeige (auf Frames genau) und
 der Anzeige in Samplewerten (genauer).


 6) Darstellungsma&szlig;stab

 Hier wird der Darstellungsma&szlig;stab, also das Verh&auml;ltnis der dargestellten
 Samples zur Gesamtzahl der Samples angegeben. Bei einem Verh&auml;ltnis von z.B.
 1:2 entspricht 1 Pixel im <A HREF="page0043.htm">Sample-Window</A> 2 Samplewerten. Man kann mit der
 Zoomfunktion bis auf ein 1:1 Verh&auml;ltnis und dar&uuml;ber hinaus in das Sample
 zoomen. Ab einem Verh&auml;ltnis von 2:1 kann man im Editor die einzelnen
 Samplewerte mit der Maus korrigieren,oder eigene Samplewerte einzeichnen.


 7) Sample-Amplitudenwerte links/rechts

 Hier werden beim Draggen die Sample-Amplitudenwerte (in Hexadezimal-
 schreibweise) an der Markerstelle angezeigt.
 Wenn man mit der Maus &uuml;ber das <A HREF="page0043.htm">Sample-Window</A> f&auml;hrt, werden hier die 
 Sample-Amplitudenwerte an der Mauszeiger-Stelle angezeigt. Links steht der
 Wert f&uuml;r den linken und rechts der Wert f&uuml;r den rechten Kanal.


 8) Adjust-Samplerate-Wert

 Wenn man beim Resampling im <A HREF="page0080.htm">Resample-Dialog</A> die Option Adjust-Resampling-Rate
 ausw&auml;hlt, wird in diesem Feld die neue Samplerate angezeigt, um an
 die ge&auml;nderte Samplerate zu erinnern.


 9) Freier Speicherplatz im Setup- und Sample-Suchpfad

 Hier wird der freie Speicherplatz auf der Festplatte in KB (Kilobyte)
 angezeigt und zwar links f&uuml;r die Start-Partition (die Partition von der
 das Programm geladen wurde) und rechts f&uuml;r die im <A HREF="page0060.htm">Setup-Dialog</A> definierte
 Sample-Partition.

</PRE>

<A HREF="#4.1.13">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>