<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Hardware</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="2.1.2.4"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0017.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0019.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Hardware</H1></CENTER>

<PRE>

<H3> 2.1.2.4 Einbau in das Geh&auml;use</H3>
 Nun kommt der leider etwas aufwendigere Teil: Der VME-Einschub des TT und MegaSTE ist
 komplett in einem Metallk&auml;fig gekapselt. Da wir unsere beiden Kabel nach au&szlig;en
 f&uuml;hren m&ouml;chten, kommen wir nicht umhin, in den Blechdeckel mit einem Seitenschneider
 eine kleine Aussparung zu schneiden (siehe Zeichnung,<A HREF="page0026.htm"> Kapitel 2.1.6</A>). Bitte nicht auss&auml;gen,
 der feine Metallstaub der dabei entsteht, kann im Ger&auml;t zu Kurzschl&uuml;ssen f&uuml;hren!
 Im Blechdeckel ist bereit ein kleines Loch, etwa in der Mitte, rechts von der R&uuml;ckseite des
 Rechners aus gesehen. Von hier aus schneiden wir die kleine Aussparung jeweils von den
 beiden R&auml;ndern des Lochs bis zum rechten Au&szlig;enrand des Blechs. Ist dieser Teil getan,
 k&ouml;nnen sie die Startrack-Karte in den VME-Slot einschieben. F&uuml;hren sie zuallererst die
 Kabel in den VME-Schacht, und f&uuml;hren sie durch die geschnittene &Ouml;ffnung des Blechdeckels. 

 Schieben sie nun die Startrack-Karte nach, und ziehen dabei gleichzeitig das Kabel weiter
 durch die Blech&ouml;ffnung. Dr&uuml;cken sie anschlie&szlig;end den 96poligen VME-Stecker der
 Startrack-Karte in den entsprechenden 96poligen VME-Buchse des Rechners, bis er einrastet
 bzw. bis zum Anschlag.

 Nun m&uuml;ssen sie noch einen geeigneten Weg finden,die beiden Kabel aus dem Rechnergeh&auml;use
 zu f&uuml;hren. Daf&uuml;r gibt es mehrere M&ouml;glichkeiten:
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>1.</TD>
<TD VALIGN=TOP WIDTH=620>Am Romport vorbei herausf&uuml;hren.Die &Ouml;ffnung ist breit genug daf&uuml;r,
behindert allerdings etwas den Zugriff auf den Romport.</TD>
</TR>
<TR>
<TD VALIGN=TOP>2.</TD>
<TD VALIGN=TOP WIDTH=620>Eine kleine Aussparung aus dem Kunstoffgeh&auml;use schneiden und die Kabel hierdurch 
herausf&uuml;hren.</TD>
</TR>
<TR>
<TD VALIGN=TOP>3.</TD>
<TD VALIGN=TOP WIDTH=620>Den Geh&auml;usedeckel nehmen,und in die R&uuml;ckseite ein oder zwei Aussparungen f&uuml;r 
den Einbau der Sub-D-Steckverbinder der Kabel ausfeilen. Das geht bei Kunststoff recht problemlos. 
Weitere Vorschl&auml;ge werden dankbarangenommen.</TD>
</TR>
</TABLE>

<PRE> 
 
 Nun m&uuml;ssen sie als letztes noch den ONCE-Port mit dem PC verbinden,falls sie
 ihn ben&ouml;tigen.Wenn nicht sind sie jetzt fertig mit dem Einbau - Gl&uuml;ckwunsch !

 Sie m&uuml;ssen jetzt nur noch ihre Startrack-Karte mit einer HIFI-Anlage oder Mischpult
 verbinden, und k&ouml;nnen dann gleich loslegen. Wie das geht, wird ausf&uuml;hrlich im
 Kapitel <A HREF="page0025.htm">"Verbindung zu Audioger&auml;ten"</A> erkl&auml;rt.

<IMG SRC="../images/p028.gif" width="163" height="231">
<B> VME-Blechk&auml;fig nach der Bearbeitung</B>

</PRE>

<A HREF="#2.1.2.4">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>