<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.1"></A>
<A NAME="4.1.1"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0041.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0043.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>
<H3> 4.1 Editor</H3>
</PRE>
<PRE>
<H4> 4.1.1 Editor-Fenster</H4>
 Das ist das Hauptfenster, das immer ge&ouml;ffnet bleiben mu&szlig;.
 Man kann hier Samples aufnehmen und alle destruktiven Bearbeitungsschritte
 durchf&uuml;hren. Alle Bearbeitungsschritte im Editor ver&auml;ndern direkt die 
 Sampledaten.

<A HREF="p075.htm" TARGET="_new"><IMG SRC="../images/scaled/p075.gif" WIDTH="480" HEIGHT="336"></A>

 Ab einer Aufl&ouml;sung von 1024x768 verwendet das Programm eine andere
 Resourcedatei, um die Text- und Objektgr&ouml;&szlig;en auf ein f&uuml;r die Augen
 ertr&auml;gliches Ma&szlig; zu vergr&ouml;&szlig;ern. Das Fenster kann mit dem Sizer (unten
 rechts) in der Gr&ouml;&szlig;e ver&auml;ndert werden.

 Das Editor-Fenster besteht aus folgenden Funktionsgruppen:

 1) <A HREF="page0058.htm">Button-Toolbar</A>

 Hier&uuml;ber erreicht man die wichtigsten Hauptfunktionen und die
 anderen Fenster.


 2) <A HREF="page0043.htm">Sample-Window</A>

 Hier werden die Amplitudenverl&auml;ufe der Samples dargestellt.


 3) <A HREF="page0045.htm">Setbereich</A>

 In diesem Feld befindet sich die Zoom-Behandlung, die Markerpfeile zum
 Bewegen der Marker,und zum Ausf&uuml;hren der Funktionen des

 Function-Dropdown:

 &Uuml;ber dieses Dropdown-Men&uuml; kann man verschiedene Funktionen ausw&auml;hlen:
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>MARK</TD>
<TD VALIGN=TOP>- Marker bewegen</TD>
</TR>
<TR>
<TD VALIGN=TOP>ZOOM</TD>
<TD VALIGN=TOP>- Amplitudenfenster zoomen</TD>
</TR>
<TR>
<TD VALIGN=TOP>SCROLL</TD>
<TD VALIGN=TOP>- Amplitudendfenster scrollen bzw. Bildausschnitt w&auml;hlen</TD>
</TR>
<TR>
<TD VALIGN=TOP>COPY</TD>
<TD VALIGN=TOP>- Block kopieren</TD>
</TR>
<TR>
<TD VALIGN=TOP>MOVE</TD>
<TD VALIGN=TOP>- Block bewegen</TD>
</TR>
<TR>
<TD VALIGN=TOP>INSERT</TD>
<TD VALIGN=TOP>- Block einf&uuml;gen</TD>
</TR>
<TR>
<TD VALIGN=TOP>MERGE</TD>
<TD VALIGN=TOP>- Block mischen</TD>
</TR>
<TR>
<TD VALIGN=TOP>FADE</TD>
<TD VALIGN=TOP>- Block ein- oder ausblenden</TD>
</TR>
</TABLE>

<PRE>
 Die Funktion MARK kann auch per Drag&amp;Drop ausgef&uuml;hrt werden. Dazu fa&szlig;t
 man die senkrechte Markerlinie mit der Maus an (linke Maustaste gedr&uuml;ckt
 halten) und zieht (draggt) die Markerlinie an die neue Position.
 Die Funktionen COPY und MOVE k&ouml;nnen auch per Drag&amp;Drop ausgef&uuml;hrt
 werden. Dazu positioniert man die Maus innerhalb des definierten Blocks und
 h&auml;lt die linke Maustaste gedr&uuml;ckt. Nun kann man den Block zur gew&uuml;nschten
 Position ziehen (draggen) und l&auml;&szlig;t danach die Maus los. Der Blockinhalt wird 
 beim draggen angezeigt. Daher kann man den Block sehr genau positionieren
 bzw. mit einem anderen Sample kombinieren.


 4) <A HREF="page0047.htm">Markerbereich</A>

 Im Markerbereich werden die Markereintr&auml;ge (Nummer, Startzeit, Endzeit,
 Intro, Release, Name) aufgef&uuml;hrt und editiert. Hier k&ouml;nnen ebenfalls die
 Fenster-Darstellungsgrenzen eingestellt werden.


 5) <A HREF="page0052.htm">Steuerungsbereich</A>

 Hier&uuml;ber k&ouml;nnen die Samples aufgenommen und abgespielt werden.
 Es stehen s&auml;mtliche bekannten Laufwerksfunktionen zur Verf&uuml;gung.
 &Uuml;ber dem eigentlichen <A HREF="page0052.htm">Steuerungsbereich</A> befinden sich Dropdowns zum
 Einstellen der Samplerate und der Sample-Bittiefe.


 6) <A HREF="page0054.htm">Informationsbereich</A>

 Hier&uuml;ber wird der Benutzer &uuml;ber verschiedene Einstellungen informiert.
 Die blau umrandeten Felder k&ouml;nnen angeklickt werden. Hinter manchen
 dieser Felder verbergen sich weitere Information oder Funktionen.


 7) <A HREF="page0057.htm">Limits-Bereich</A>

 Hier&uuml;ber kann man bestimmte Einstellungen vornehmen, die die 
 Wiedergabe und Aufnahme betreffen.


 8) Clipboard

 &Uuml;ber das Clipboard kann man Markerfelder kopieren. Dabei fungiert das
 Clipboard als eine Art Zwischenspeicher.
 Man kann ein Marker-Feld kopieren, indem man den Marker-Button 
 anklickt und bei gedr&uuml;ckter linker Maustaste auf das Clipboard-Icon
 zieht (bzw. draggt).
 Dabei wird das Clipboard-Symbol selektiert. Nun l&auml;&szlig;t man die Maustaste los.
 Damit wurde das Feld zun&auml;chst ins Clipboard kopiert (eine Art Zwischenspeicher).
 Nun sucht man mit dem Slider den gew&uuml;nschten Eintrag, auf den das ganze kopiert
 werden soll. Hat man das gew&uuml;nschte Feld im Sichtfeld, klickt man auf das Clipboard.
 Man h&auml;lt dabei die linke Maustaste gedr&uuml;ckt. An der Maus h&auml;ngt nun das Marker-Symbol.
 Dieses zieht man jetzt &uuml;ber den Marker-Button des Feldes, in das kopiert werden soll.
 Dabei wird der Marker-Button des Feldes automatisch selektiert.
 Ist der Marker-Button selektiert, l&auml;&szlig;t man die Maus los - fertig.
 Man kann aber nicht nur die einzelnen Markereintr&auml;ge kopieren (mit den
 Markerbuttons),sondern auch den kompletten Eintrag (bestehend aus den
 4 Markerfeldern und dem Markertext). Dabei draggt man stattdessen das
 Eintragsnummer-Feld in das Clipboard. Dann w&auml;hlt man den Zieleintrag mit
 dem Slider aus und draggt den Clipboardinhalt auf das Eintragsnummer-Feld
 des Zieleintrags. Der Clipboard-Inhalt bleibt solange vorhanden,
 bis man ein anderes Feld oder einen kompletten Eintrag hineinkopiert.


 9) Trash

 Hiermit kann man das Sample-Memory komplett l&ouml;schen. Beim Wechsel in
 den Virtual-Mode (virtuelle Bearbeitung) wird der komplette Inhalt des
 Sample-Memory auf Festplatte gespeichert. Ist man im Virtual-Mode
 funktioniert der Trash-Button etwas anders: Das virtuelle Sample wird aus
 dem Speicher entfernt, und das vorher abgespeicherte Sample-Memory wird
 wieder geladen. Damit wird auch der Virtual-Mode beendet.


 10) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen 
 wie das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal
 genauer an.

 11) Quit

 Hiermit beendet man das Programm. Das geht aber auch &uuml;ber die
 Tastenkombination CTRL-Q, &uuml;ber das Fenster-Schlie&szlig;feld
 oder &uuml;ber das optionale <A HREF="page0108.htm">Dropdown-Men&uuml;</A> unter Datei/Ende.

</PRE>

<A HREF="#4.1">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>