<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.13"></A>
<A NAME="4.13.1"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0081.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0083.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.13 Midi-Sampleplayer</H3>

<H3> 4.13.1 Midi-Sampleplayer-Fenster</H3>
<A HREF="p192.htm" TARGET="_new"><IMG SRC="../images/scaled/p192.gif" WIDTH="371" HEIGHT="192"></A>

 &Uuml;ber dieses Fenster wird die Ansteuerung eines (oder mehrerer)
 MIDI-Keyboards realisiert. Dazu erstellt man hier eine Liste der verwendeten
 Samples. Man kann hier die Loopart, Start- und Endpunkt, Midikanal, Midinote
 usw. f&uuml;r jedes einzelne Sample bestimmen. Dabei werden die Samples soweit
 m&ouml;glich automatisch in den Speicher geladen, um den Zugriff zu beschleunigen.
 Je mehr RAM-Speicher man hat, desto besser.
 Die fertige Liste kann als <A HREF="page0141.htm">Arrangement-File</A> (Endung *.ARR) abgespeichert
 werden. Aufgerufen wird das Midi-Sampleplayer-Fenster durch den <A HREF="page0058.htm">Keyboard-
 Button</A> im Edit-Fenster, durch Eingabe von CTRL-A oder &uuml;ber das optionale
 Dropdown-Men&uuml; unter <A HREF="page0109.htm">Fenster/Midi-Player</A>.

 Das Sampleplayer-Fenster besteht aus folgenden Funktionsgruppen:

 1) <A HREF="page0086.htm">Button-Toolbar</A>
 
 Hier&uuml;ber erreicht man die wichtigsten Hauptfunktionen.


 2) <A HREF="page0083.htm">Parameter-Feld</A>

 Hier werden die einzelnen Samples mit den f&uuml;r das Abspielen &uuml;ber ein
 MIDI-Keyboard wichtigen Parametern eingestellt.


 3) Startpoint-Button

 Wenn man mit den Laufwerksfunktionen einen Sample-Startpunkt gefunden
 hat, kann man ihn hiermit als &quot;Startpoint&quot; in die Arrange-Parameterliste
 &uuml;bernehmen.


 4) Endpoint-Button

 Wenn man mit den Laufwerksfunktionen einen Sample-Endpunkt gefunden hat,
 kann man ihn hiermit als &quot;Endpoint&quot; in die Arrange-Parameterliste
 &uuml;bernehmen.


 5) Slider

 Hiermit kann man den sichtbaren Teil der Sampleplayer-Liste bestimmen.


 6) <A HREF="page0085.htm">Steuerungsfeld</A>

 Hier&uuml;ber k&ouml;nnen die Samples abgespielt bzw. nach Geh&ouml;r ein Start- und
 Endpunkt des Samples definiert werden. Es stehen s&auml;mtliche bekannten
 Laufwerksfunktionen zur Verf&uuml;gung. Au&szlig;erdem kann man die Blockmarken
 des Samples (aus dem <A HREF="page0140.htm">Information-File *.INF</A>) einfach ins MIDI-Arrangement
 &uuml;bernehmen.


 7) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 8) Clipboard

 &Uuml;ber das Clipboard kann man komplette Eintr&auml;ge kopieren. Dabei fungiert das
 Clipboard als eine Art Zwischenspeicher. Man kann einen Eintrag auch kopieren,
 indem man den <A HREF="page0083.htm">Edit-Button</A> anklickt und bei gedr&uuml;ckter linker Maustaste
 auf das Clipboard-Icon zieht (bzw. draggt). Dabei wird das Clipboard-Symbol
 selektiert. Nun l&auml;&szlig;t man die Maustaste los. Damit wurde der Eintrag
 zun&auml;chst ins Clipboard kopiert (eine Art Zwischenspeicher). Nun sucht man
 mit dem Slider den gew&uuml;nschten Eintrag, auf den das ganze kopiert werden soll.
 Hat man den leeren Eintrag im Sichtfeld, klickt man auf das Clipboard.
 Man h&auml;lt dabei die linke Maustaste gedr&uuml;ckt. An der Maus h&auml;ngt nun das
 Edit-Symbol. Dieses zieht man jetzt &uuml;ber den <A HREF="page0083.htm">Edit-Button</A> des Eintrags, in den
 kopiert werden soll. Dabei wird der <A HREF="page0083.htm">Edit-Button</A> des Eintrags automatisch
 selektiert. Ist der <A HREF="page0083.htm">Edit-Button</A> selektiert, l&auml;&szlig;t man die Maus los - fertig. 
 Der Clipboard-Inhalt bleibt solange vorhanden, bis man einen anderen Eintrag
 hineinkopiert.


 9) M&uuml;lleimer

 Wenn man den M&uuml;lleimer anklickt, wird das gesamte MIDI-Arrangement gel&ouml;scht.


 10) Exit

 Hiermit wird das Sampleplayer-Fenster geschlossen. Alle Einstellungen bleiben
 bis zum n&auml;chsten Aufruf unver&auml;ndert. Man kann jedoch mehrere Fenster
 gleichzeitig ge&ouml;ffnet lassen und hat so immer den direkten Zugriff auf die
 Funktionen.

</PRE>

<A HREF="#4.13">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>