<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Hardware</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="2.1.1.6"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0010.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0012.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Hardware</H1></CENTER>

<PRE>

<H3> 2.1.1.6 Anmerkungen</H3>
 Das Kabel des DSP-Ports ist nicht beliebig verl&auml;ngerbar,die Maximall&auml;nge ist ungef&auml;hr 20cm,
 da es ansonsten zu St&ouml;rungen (Knackser) bei den DSP-Port-Erweiterungen kommt. Das ist
 verst&auml;ndlich, wenn man bedenkt, welch hohe Frequenzen das Kabel bew&auml;ltigen mu&szlig; (&uuml;ber 6 MHz).
 Dabei kommt es ab einer bestimmten L&auml;nge zwangsl&auml;ufig zu &Auml;nderungen in Timing und Flanken
 der Signale, die eine sichere und st&ouml;rfreie &Uuml;bertragung unm&ouml;glich machen.
 Daher sollte dieses Kabel m&ouml;glichst kurz sein.

 Das Frontblech dieser Version ist etwas k&uuml;rzer als die von normalen VME-Bus-Karten, damit es
 von au&szlig;en in das Geh&auml;use eingeschoben werden kann. Die PC-Slotaussparungen sind f&uuml;r
 normale VME-Karten etwas zu kurz. Vorteil dieser Methode: Die Startrack-Karte ist von au&szlig;en
 zug&auml;nglich bzw. austauschbar ohne das man das Geh&auml;use daf&uuml;r vorher &ouml;ffnen mu&szlig;.
 Andere VME-Karten k&ouml;nnen nur fest eingebaut werden, da die Frontbleche l&auml;nger als die
 PC-Slotaussparungen des IPC-Geh&auml;uses sind.

 Nun m&uuml;ssen sie als letztes noch den ONCE-Port mit dem PC verbinden,falls sie ihn ben&ouml;tigen.
 Wenn nicht, sind sie jetzt fertig,und brauchen die Startrack-Karte nur noch mit einer
 HIFI-Anlage oder Mischpult verbinden, und k&ouml;nnen dann gleich loslegen. Lesen sie daf&uuml;r
 bitte das entsprechende Kapitel <A HREF="page0025.htm">"Verbindung zu Audio-Ger&auml;ten"</A> durch.

</PRE>

<A HREF="#2.1.1.6">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>