<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.14.14"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0099.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0101.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.14.14 Button-Toolbar</H3>
<A HREF="p234.htm" TARGET="_new"><IMG SRC="../images/scaled/p234.gif" WIDTH="396" HEIGHT="48"></A>

 Hier&uuml;ber erreicht man die wichtigsten Hauptfunktionen des <A HREF="page0087.htm">Tracker-Fensters</A>.



 Function-Bereich:

 In diesem Bereich der Toolbar haben sie Zugriff auf alle wichtigen Haupt-
 funktionen, Fenster und Dialoge. 

 1) <A HREF="page0101.htm">Trackfinder</A>

 Der Dialog gibt eine &Uuml;bersicht &uuml;ber die im <A HREF="page0087.htm">Tracker</A> verwendeten Samplebl&ouml;cke
 und erlaubt das Suchen eines solchen Sampleblocks. Bei vielen Samples kann
 die &Uuml;bersicht schnell verloren gehen und deshalb gibt es dieses
 komfortable Suchwerkzeug. Nach der Suche wird das Sample automatisch im <A HREF="page0087.htm">Tracker</A>
 selektiert und in die Ecke links oben gescrollt. Angezeigt werden im Fileselector
 die Namen der Sampledateien und die entsprechenden Kommentare, die in den
 <A HREF="page0140.htm">Info-Dateien</A> enthalten sind (Dateiendung *.INF). Den Kommentaren wird bei
 der Anzeige die Tracker-Spurnummer vorangestellt (T012 = Track 12), die
 anzeigt, auf welcher Spur das Sample zu finden ist. Die Samples werden nach
 Spur und SMPTE-Startzeit sortiert. Man w&auml;hlt das entsprechende Sample im
 Sampledatei-Name-Bereich aus, indem man das entsprechende Feld selektiert
 und klickt anschlie&szlig;end auf Search - und das Sample wird im <A HREF="page0087.htm">Tracker</A> gesucht.
 Man kann hier auch die Sample-Kommentare &auml;ndern. Daf&uuml;r klickt man auf das
 entsprechende Kommentartext-Feld und es erscheint der <A HREF="page0102.htm">Tracker-Kommentar-
 Dialog</A>, in dem man den Kommentar eingeben kann. Diese Kommentare werden
 im <A HREF="page0143.htm">Tracker-File</A> (Endung *.TRK) abgespeichert. Diese stehen also beim
 Laden eines solchen Tracker-Files wieder zur Verf&uuml;gung. 


 2) trash

 Hiermit l&ouml;scht man alle Spuren bzw. alle Spureintr&auml;ge im <A HREF="page0087.htm">Tracker</A>.


 3) Trackbouncing

 Hiermit kann man sich das aktuelle Multitrack-Arrangement zu einer
 einzigen Stereo Sample-Datei zusammenmischen lassen. Alle Tracks, die mit 
 Multitrack-Play (5) h&ouml;rbar sind, werden hierbei ber&uuml;cksichtigt, also alle,
 die als &quot;active&quot; gekennzeichnet wurden (siehe <A HREF="page0088.htm">Spurfeld</A>). Die neue &quot;gebouncte&quot;
 Datei wird anschlie&szlig;end automatisch in die selektierte Spur geladen.


 4) CD-Export

 Hiermit kann die Trackliste in das CD-Writer-Programm Extendos Gold
 exportiert werden. Die zu brennenden Audiodateien m&uuml;ssen sich jeweils auf
 einer eigenen Spur befinden und von Spur 1 an durchgehend untereinander
 stehen, also pro Spur nur eine Audiodatei. Durch CD-Export wird dann eine
 Liste f&uuml;r Extendos-Gold generiert, mit der man anschlie&szlig;end die Audiofiles
 in der gleichen Reihenfolge brennen kann.
 In Zukunft soll auch das Soundpool-Programm CD-Recorder mit seinen
 weitreichenden M&ouml;glichkeiten unterst&uuml;tzt werden.


 5) multitrack-play

 Hiermit startet man die Wiedergabe des <A HREF="page0087.htm">Trackers</A>. Die aktivierten Spuren
 werden zusammengemischt und abgespielt. Der Abspielbereich kann durch die
 <A HREF="page0092.htm">Playmarker</A> eingegrenzt werden. In Zukunft wird sich hier ein Mischpult-
 Fenster &ouml;ffnen, das die komfortable Echtzeitkontrolle wichtiger Parameter
 wie Volume, Balance und Effekte erm&ouml;glichen soll.


 6) delete sample

 Das aktuelle Sample (roter bzw. gestrichelter Rand) wird aus der Spurliste
 gel&ouml;scht. Das Sample bleibt nat&uuml;rlich auf der Festplatte vorhanden.


 7) Clipboard

 &Uuml;ber das Clipboard kann man ganze Spuren kopieren. Wenn man eine ganze
 Spur kopieren m&ouml;che, selektiert man die <A HREF="page0088.htm">Spurnummer</A> und zieht (draggt) sie
 mit gedr&uuml;ckter Maustaste in das Clipboard. Dabei wird das Clipboard-Symbol
 selektiert. Nun l&auml;&szlig;t man die Maustaste los. Damit wurde die gesamte Spur
 mit allen Sampleeintr&auml;gen zun&auml;chst ins Clipboard kopiert (eine Art Zwischen-
 speicher). Nun sucht man mit dem Slider die gew&uuml;nschte Spur, auf die das
 ganze kopiert werden soll. Hat man die Zielspur im Sichtfeld, klickt man auf
 das Clipboard. Man h&auml;lt dabei die linke Maustaste gedr&uuml;ckt. An der Maus
 h&auml;ngt nun das Spurnummer-Symbol. Dieses zieht man jetzt &uuml;ber den
 Spurnummer-Button des Spurfeldes, in das kopiert werden soll. Dabei wird der
 Spurnummer-Button der Zielspur automatisch selektiert. Ist der Spurnummer-
 Button selektiert, l&auml;&szlig;t man die Maus los - fertig.
 Der Clipboard-Inhalt bleibt solange vorhanden, bis man einen anderen Track oder
 <A HREF="page0088.htm">Sampleblock</A> hineinkopiert. Man kann aber nicht nur ganze Spuren, sondern 
 auch einzelne Samplebl&ouml;cke kopieren. Das Vorgehen dabei ist sehr &auml;hnlich.
 Man zieht (draggt) den zu kopierenden <A HREF="page0088.htm">Sampleblock</A> (mit Maus auf Block zeigen
 und rechte Maustaste zusammen mit den Tasten CTRL+ALT dr&uuml;cken) auf das
 Clipboard. Eventuell sucht man nun mit dem Slider die gew&uuml;nschte Spur, auf
 die der <A HREF="page0088.htm">Sampleblock</A> kopiert werden soll. Hat man die Zielspur im Sichtfeld,
 klickt man auf das Clipboard. Man h&auml;lt dabei die linke Maustaste gedr&uuml;ckt.
 An der Maus h&auml;ngt nun der <A HREF="page0088.htm">Sampleblock</A>. Diesen zieht man jetzt auf die
 gew&uuml;nschte Spur und l&auml;&szlig;t die Maus los - fertig.



 Mode-Bereich:

 In diesem Bereich der Toolbar haben sie Zugriff auf alle wichtigen
 Editier- und Zeichenfunktionen.


 8) select sample

 Hiermit w&auml;hlt man den Selektiermodus. In diesem Modus kann man die
 Samples aktivieren. Diese k&ouml;nnen anschlie&szlig;end vielf&auml;ltig bearbeitet werden.


 9) move sample

 Hiermit w&auml;hlt man den Movemodus. In diesem Modus kann man die Samples
 mit der Maus auf der Timeline verschieben oder auf eine andere Spur wechseln.
 Der Movemodus wird automatisch gew&auml;hlt, wenn man die rechte Maustaste
 dr&uuml;ckt und das Sample verschiebt (siehe auch <A HREF="page0088.htm">Tracker-Spurfeld: Drag&amp;Drop</A>).


 10) copy sample

 Hiermit w&auml;hlt man den Kopiermodus. In diesem Modus k&ouml;nnen die Samples
 kopiert werden. Man zieht dabei mit der Maus einfach eine Kopie aus dem
 Sample und legt die Kopie im Spurfeld ab.
 Der Copymodus wird automatisch gew&auml;hlt, wenn man die ALT-Taste zus&auml;tzlich
 zur Maustaste dr&uuml;ckt (siehe auch <A HREF="page0088.htm">Tracker-Spurfeld: Drag&amp;Drop</A>).


 11) clip sample

 Hiermit w&auml;hlt man den Clip-Modus. In diesem Modus k&ouml;nnen die Samples
 auf das Klemmbrett gezogen werden. Anschlie&szlig;end k&ouml;nnen aus dem
 Klemmbrett beliebig viele Kopien gezogen und im Spurfeld abgelegt werden.
 Der Clipmodus wird automatisch gew&auml;hlt, wenn man die CTRL+ALT-Tasten
 zus&auml;tzlich zur Maustaste dr&uuml;ckt (siehe auch <A HREF="page0088.htm">Tracker-Spurfeld: Drag&amp;Drop</A>).


 12) edit sample

 Hiermit w&auml;hlt man den Editiermodus. In diesem Modus kann man die Marker
 sehr exakt ver&auml;ndern bzw. setzen.
 Man klickt einfach das zu editierende Sample an. Es wird anschlie&szlig;end 
 automatisch in den <A HREF="page0042.htm">Editor</A> geladen. Dort k&ouml;nnen die Marker editiert werden.
 Anschlie&szlig;end dr&uuml;ckt man im <A HREF="page0042.htm">Editor</A> auf Quit. Danach wird nicht etwa das
 Programm beendet, sondern die Marker werden in den <A HREF="page0087.htm">Tracker</A> &uuml;bernommen.
 Der Editmodus wird automatisch gew&auml;hlt, wenn man die CTRL-Taste zus&auml;tzlich
 zur Maustaste dr&uuml;ckt (siehe auch <A HREF="page0088.htm">Tracker-Spurfeld: Drag&amp;Drop</A>).


 13) snap sample

 Hiermit w&auml;hlt man den Snapmodus. In diesem Modus kann man sehr einfach
 mehrere Samples ohne L&uuml;cke aneinanderreihen. Dr&uuml;ckt man die linke
 Shifttaste und mit der Maus auf das Sample, springt es b&uuml;ndig an das links in
 n&auml;chster N&auml;he stehende Sample. Bei Druck auf die rechte Shifttaste springt es
 entsprechend b&uuml;ndig an das rechts in n&auml;chster N&auml;he stehende Sample.


 14) size sample

 Hiermit w&auml;hlt man den Sizemodus. Sobald angew&auml;hlt, werden in jeder Ecke
 des Sampleblocks kleine Quadrate sichtbar. An diesen kann man den Anfang
 bzw. Ende des Sampleblocks in seiner L&auml;nge verschieben und somit sehr
 einfach Start- und Endpunkt in einem Sample definieren. 
 Diese Funktion ist in der V2.00 noch nicht enthalten, wird aber
 voraussichtlich in der n&auml;chsten Version enthalten sein.


 15) draw effect-sends

 Hiermit w&auml;hlt man den Drawmode. In diesem Modus kann man beliebig viele
 Effekt-Sends (f&uuml;r kontinuierliche Lautst&auml;rkeanpassung und DSP-Effekte) in
 die Spurfelder einzeichnen. Hierf&uuml;r werden zuerst mit der rechten Maustaste
 St&uuml;tzpunkte definiert, die dann mit der linken Maustaste verschoben werden
 k&ouml;nnen. Diese werden automatisch durch Bezierkurven verbunden und bilden
 so die Ein- und Ausblendkurven f&uuml;r die Effekt-Sends.
 Diese Funktion ist in der V2.00 noch nicht enthalten, wird aber
 voraussichtlich in der n&auml;chsten Version enthalten sein.



 File-Bereich:

 In diesem Bereich der Toolbar haben sie Zugriff auf alle wichtigen
 Filefunktionen des <A HREF="page0087.htm">Trackers</A>.


 16) load sample

 Hiermit l&auml;dt man ein Sample in den <A HREF="page0087.htm">Tracker</A>. Es erscheint dabei immer als
 letztes Sample der aktuellen Spur (selektierte <A HREF="page0088.htm">Spurnummer</A>) und wird als
 aktuelles Sample (roter bzw. gestrichelter Rand) gekennzeichnet.


 17) load <A HREF="page0143.htm">Tracker-File</A>

 Hiermit kann man die <A HREF="page0143.htm">Tracker-Datei</A> (Dateiendung *.TRK) laden.


 18) save <A HREF="page0143.htm">Tracker-File</A>

 Hiermit kann man die <A HREF="page0143.htm">Tracker-Datei</A> (Dateiendung *.TRK) abspeichern.
 In ihr werden s&auml;mtliche verwendeten Spuren, Samplebl&ouml;cke und
 Abspielparameter gespeichert.

</PRE>

<A HREF="#4.14.14">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>