<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.11.3"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0078.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0080.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.11.3 Optimize</H3>

 In diesem Dialog kann man die Einstellungen f&uuml;r die Optimize-Funktion
 t&auml;tigen. Die Optimize-Funktion ist im <A HREF="page0077.htm">Blockfunktionen-Fenster</A> unter dem
 Optimize-Button erreichbar. Man kann hiermit die Lautst&auml;rke eines Samples
 nachtr&auml;glich &auml;ndern. Daf&uuml;r wird ein H&ouml;chstwert in Dezibel (dB) angegeben
 und anschlie&szlig;end das Sample auf die ge&auml;nderte Lautst&auml;rke umgerechnet.
 Nach dem &Ouml;ffnen des Optimize-Dialogs wird zuerst der H&ouml;chstwert des
 Samples gesucht. Das kann bei l&auml;ngeren Samples etwas Zeit beanspruchen.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=620>Falls man die Lautst&auml;rke manuell anpassen will, sollte man den Adjust-Button im Optimize-Dialog
anw&auml;hlen.</TD>
</TR>
<TR>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=620>Falls man die Lautst&auml;rke auf den maximal m&ouml;glichen Wert (0dB Vollaussteuerung) anheben will, sollte 
man den AUTO-Button im Optimize-Dialog anw&auml;hlen. Die manuelle H&ouml;chstwerteingabe f&auml;llt dann weg.
</TD>
</TR>
</TABLE> 

<PRE>

<IMG SRC="../images/p179.gif" WIDTH="208" HEIGHT="400">

<H3> ADJUST im Optimize-Dialog</H3>

 Durch die Adjust-Option wird das Sample auf eine einstellbare Lautst&auml;rke
 umgerechnet.


 1) Auto

 Hiermit wird zum Auto-Dialog gewechselt. Die Samplewerte werden
 auf maximale Lautst&auml;rke angehoben. Es wird dabei nicht &uuml;bersteuert und
 die Dynamikverh&auml;ltnisse der Samplewerte zueinander bleiben erhalten.


 2) Adjust

 Hiermit wird die einstellbare Aussteuerung gew&auml;hlt. Man kann dann einen
 Lautst&auml;rke-H&ouml;chstwert angeben, auf den dann alle Samplewerte umgerechnet
 werden. Man kann damit auch zu laute Samples auf eine kleinere 
 Lautst&auml;rke umrechnen.


 3) Peak dB

 Hier erscheint der h&ouml;chste im Sample momentan enthaltene Wert in Dezibel(dB).
 Dieser wird aus dem Sample ermittelt. Deshalb kann die Ermittlung des
 H&ouml;chstwertes bei langen Samples etwas dauern.


 4) new dB

 Hier erscheint der neue H&ouml;chstwert in Dezibel (dB). Diesen kann man mit den
 Pfeiltasten einstellen.


 5) Pfeiltasten

 Mit den Pfeiltasten kann man den H&ouml;chstwert einstellen und zwar mit
 3 verschiedenen Schrittweiten:
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>einfach-Pfeiltaste</TD>
<TD VALIGN=TOP>=</TD>
<TD VALIGN=TOP WIDTH=100>0.02 dB</TD>
</TR>
<TR>
<TD VALIGN=TOP>zweifach-Pfeiltaste</TD>
<TD VALIGN=TOP>=</TD>
<TD VALIGN=TOP WIDTH=100>0.2 dB</TD>
</TR>
<TR>
<TD VALIGN=TOP>dreifach-Pfeiltaste</TD>
<TD VALIGN=TOP>=</TD>
<TD VALIGN=TOP WIDTH=100>2 dB</TD>
</TR>
</TABLE>

<PRE>

 6) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 7) Exit

 Hiermit wird der Optimize-Dialog geschlossen. Die Optimize-Funktion wird
 nicht ausgef&uuml;hrt.


 8) OK

 Hiermit wird der Optimize-Dialog geschlossen und die Funktion ausgef&uuml;hrt.


<H3> AUTO-Button im Optimize-Dialog</H3>
<IMG SRC="../images/p181.gif" WIDTH="208" HEIGHT="400">

 Durch die Auto-Option wird das Sample auf maximale Lautst&auml;rke angehoben.

 1) Auto

 Hiermit wird die automatische Vollaussteuerung ausgew&auml;hlt. Die Samplewerte
 werden auf maximale Lautst&auml;rke angehoben. Es wird dabei nicht &uuml;bersteuert
 und die Dynamikverh&auml;ltnisse der Samplewerte zueinander bleiben erhalten.


 2) Adjust

 Hiermit wird zum Adjust-Dialog gewechselt. Man kann dann einen
 Lautst&auml;rke-H&ouml;chstwert angeben, auf den dann alle Samplewerte umgerechnet
 werden. Man kann damit auch zu laute Samples auf eine kleinere Lautst&auml;rke
 umrechnen.


 3) Peak dB

 Hier erscheint der h&ouml;chste im Sample momentan enthaltene Wert in Dezibel(dB).
 Dieser wird aus dem Sample ermittelt. Deshalb kann die Ermittlung des
 H&ouml;chstwertes bei langen Samples etwas dauern.


 4) new dB

 Hier erscheint der neue H&ouml;chstwert in Dezibel (dB). Bei automatischer
 Vollaussteuerung ist das 0dB.


 5) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 6) Exit

 Hiermit wird der Optimize-Dialog geschlossen. Die Optimize-Funktion wird
 nicht ausgef&uuml;hrt.


 7) OK

 Hiermit wird der Optimize-Dialog geschlossen und die Funktion ausgef&uuml;hrt.

</PRE>

<A HREF="#4.11.3">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>