<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.1.2"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0042.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0044.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.1.2 Sample-Window</H3>
<A HREF="p078.htm" TARGET="_new"><IMG SRC="../images/scaled/p078.gif" WIDTH="422" HEIGHT="188"></A>

 Hier werden die Amplitudenverl&auml;ufe der Samples dargestellt.

 1) Start-Markerline

 Das ist die Markerlinie f&uuml;r den Startmarker (Marker-S). Am oberen Ende steht
 der Kennbuchstabe (S, E, I oder R), der den Marker als Start, End, Init oder
 Release-Marker kennzeichnet. Man kann die Marker mit der Maus anfassen und
 an die gew&uuml;nschte Stelle schieben. Daf&uuml;r mu&szlig; man aber mit der Maus sehr
 genau auf die Markerlinien zielen,da der Fangbereich etwa bei plus/minus
 2 Pixel liegt.


 2) End-Markerline

 Das ist die Markerlinie f&uuml;r den Endmarker (Marker-S). Am oberen Ende steht
 der Kennbuchstabe (S, E, I oder R), der den Marker als Start, End, Init oder
 Release-Marker kennzeichnet. Man kann die Marker mit der Maus anfassen und
 an die gew&uuml;nschte Stelle schieben. Daf&uuml;r mu&szlig; man aber mit der Maus sehr
 genau auf die Markerlinien zielen, da der Fangbereich etwa bei plus/minus
 2 Pixel liegt.

 Es gibt au&szlig;erdem noch Marker-I und Marker-R, die hier nicht dargestellt
 sind, aber genauso funktionieren und aussehen.


 3) Vertikale Pegelbeschriftung

 Hier wird der Pegel in Prozent angegeben. Bei der Y-Autozoom-Option
 (einstellbar im <A HREF="page0060.htm">Setup-Dialog</A>) wird die Pegelbeschriftung dem Maximalpegel
 des Samples angepa&szlig;t.

 4) horizontal-lines

 Die unterbrochenen Linien dienen dem besseren Absch&auml;tzen bzw. Lesbarkeit
 der Pegelverh&auml;ltnisse. Die Darstellung der horizontal-lines kann im
 <A HREF="page0060.htm">Setup-Dialog</A> ein- und ausgeschaltet werden.


 5) Scroll-Slider

 Hiermit kann man den Darstellungsausschnitt des <A HREF="page0043.htm">Sample-Window</A> w&auml;hlen.
 Der Darstellungsbereich wird im <A HREF="page0047.htm">Markerbereich</A> des Editor-Fensters in den
 min/max-Feldern dargestellt. 
 Durch Doppelklick auf den Scrollslider kann man direkt zu einer neuen
 Scrollposition springen.
 Es &ouml;ffnet sich ein <A HREF="page0044.htm">Scrolljump-Dialog</A>. Dort kann man die neue Scroll- bzw.
 Timeline-Position direkt eingeben. N&auml;heres hierzu erfahren sie im Kapitel
 <A HREF="page0044.htm">"Scrolljump"</A>.

 
 Weitere Editierm&ouml;glichkeiten im <A HREF="page0043.htm">Sample-Window</A>:

 Es gibt noch eine zus&auml;tzliche M&ouml;glichkeit, in das Sample zu zoomem: Man
 wechselt in den Zoom-Volume-Mode. Dazu selektiert man in der <A HREF="page0058.htm">Button-Toolbar</A> im
 Modebereich den Zoom-Button(Toolbar,18) und kann nun im <A HREF="page0043.htm">Sample-Window</A> ein
 Gummiband aufziehen, um den zu zoomenden Bereich auszuw&auml;hlen.
 Dabei wird nicht nur der Darstellungsbereich ausgew&auml;hlt, sondern auch der 
 Amplituden-Darstellungsbereich. Wenn man z.B. auf der Y-Achse das Sample
 mit dem Gummiband bis zur 40-Prozent-Marke umfa&szlig;t, wird die Amplitude
 bis zur 40-Prozent-Marke gezoomt. Man kann wieder aus der Amplitude
 herauszoomen indem man mit gedr&uuml;ckter ALT-Taste ein Gummiband aufzieht
 und die Maus dann losl&auml;&szlig;t.Der Darstellungsbereich bleibt dabei unver&auml;ndert.
 Man kann mit der Zoomfunktion bis auf ein 1:1 Verh&auml;ltnis und dar&uuml;ber hinaus
 in das Sample zoomen. Ab einem Verh&auml;ltnis von 2:1 kann man im Editor die
 einzelnen Samplewerte mit der Maus korrigieren, oder eigene Samplewerte 
 einzeichnen. Au&szlig;erdem kann man Samplebl&ouml;cke per Drag&amp;Drop im
 <A HREF="page0043.htm">Sample-Window</A> kopieren <A HREF="page0045.htm">(COPY)</A> und verschieben <A HREF="page0045.htm">(MOVE)</A>.

 N&auml;here Erl&auml;uterungen hierzu finden sie im Text zum Thema
 <A HREF="page0045.htm">Editor-Fenster/Function-Dropdown</A>.

</PRE>

<A HREF="#4.1.2">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>