<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.14.6"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0091.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0093.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.14.6 Markerfeld</H3>
<IMG SRC="../images/p069_2.gif" WIDTH="464" HEIGHT="120">

 Im Markerfeld werden die Parameter des aktuellen Samples (Startzeit,
 Endzeit, L&auml;nge, Position usw.) und des Playblocks aufgef&uuml;hrt. Hier k&ouml;nnen
 die Markerwerte auch ge&auml;ndert werden.

 1) Start-Marker

 Hier wird der Startzeitpunkt des aktuellen Sampleblocks angegeben. Man kann
 den Startpunkt mit den Pfeiltasten (9) rechts neben dem Startmarkerfeld
 verschieben. Hat man mit den <A HREF="page0096.htm">Laufwerksfunktionen</A> einen brauchbaren
 Startpunkt gefunden, reicht ein Klick auf das Startmarkerfeld, um die
 Position vom Zeitz&auml;hlwerk zu &uuml;bernehmen. Man kann den Startmarker auch
 direkt eingeben. Klickt man mit gedr&uuml;ckter Ctrl, Alt oder Shift-Taste auf
 das Startmarkerfeld, erscheint ein <A HREF="page0098.htm">Dialog</A> zur Eingabe des Markerwertes.
 Man kann auch einen Markereintrag des Samples aus dem <A HREF="page0140.htm">Information-File</A>
 (*.INF) mit dem Blockmarker-Button (siehe unter <A HREF="page0097.htm">Funktionsfeld</A>) &uuml;bernehmen.


 2) End-Marker

 Hier wird der Endzeitpunkt des aktuellen Sampleblocks angegeben. Man kann
 den Endpunkt mit den Pfeiltasten (9) rechts neben dem Endmarkerfeld
 verschieben. Hat man mit den <A HREF="page0096.htm">Laufwerksfunktionen</A> einen brauchbaren
 Endpunkt gefunden, reicht ein Klick auf das Endmarkerfeld, um die Position 
 vom Zeitz&auml;hlwerk zu &uuml;bernehmen. Klickt man mit gedr&uuml;ckter Ctrl, Alt oder
 Shift-Taste auf das Endmarkerfeld, erscheint ein <A HREF="page0098.htm">Dialog</A> zur Eingabe des
 Markerwertes. Man kann auch einen Markereintrag des Samples aus dem
 <A HREF="page0140.htm">Information-File</A> (*.INF) mit dem Blockmarker-Button (siehe unter
 <A HREF="page0097.htm">Funktionsfeld</A>) &uuml;bernehmen.


 3) Duration

 Hier wird die Blockl&auml;nge des Samples angegeben, also die Abspielzeit
 zwischen Start- und Endmarker.


 4) Len

 Hier wird die Gesamtl&auml;nge des Samples angegeben.


 5) SMPTE

 Hier wird der Start-Zeitpunkt des Samples auf der Spur angegeben.
 Man kann den Start-Zeitpunkt mit den Pfeiltasten (9) rechts neben dem
 SMPTE-Feld verschieben. Der Wert l&auml;&szlig;t sich auch direkt &auml;ndern, indem man
 auf das SMPTE-Feld klickt. Es erscheint dann ein Dialog zur Zeiteingabe.


 6) Size

 Hier wird die bisher erreichte Gesamtl&auml;nge des Multitrack-Arrangements
 angezeigt. Diese wird automatisch bei &Auml;nderungen aktualisert.


 7) Playstart-Marker

 Die beiden Playmarker definieren den Teil der Trackerliste, der
 zusammengemischt und wiedergegeben werden soll. Das ist praktisch,
 da man beim Arrangieren oft kontrollieren mu&szlig;, ob der zeitliche
 Ablauf stimmt oder das Sample an der eingef&uuml;gten Stelle auch richtig
 zu den anderen Spuren pa&szlig;t. Man w&auml;hlt dann einfach den zu
 kontrollierenden Teil mit den Playmarkern aus. Ist kein Playmarker
 definiert, wird alles vom Anfang bis zum Ende der Liste abgespielt.
 Der Playstart-Marker kann gesetzt werden, indem man das Playstart-Feld
 (oberes Playfeld) anklickt. Es erscheint dann ein <A HREF="page0093.htm">Dialog zur Zeiteingabe</A>.
 Man kann den Playstart-Zeitpunkt auch mit den beiden Pfeiltasten (9)
 rechts neben dem Playstart-Feld verschieben.
 Der Playstart-Marker erscheint im Tracker als senkrechte Linie mit dem
 Kennbuchstaben S. Diese Linie l&auml;&szlig;t sich mit der Maus anfassen und
 an eine andere Position bewegen. Ist nur ein Playstart-Marker, aber kein
 Playend-Marker definiert, wird vom Playstart-Marker bis zum Ende des
 Tracker-Arrangements abgespielt. 


 8) Playend-Marker

 Die beiden Playmarker definieren den Teil der Trackerliste, der
 zusammengemischt und wiedergegeben werden soll. Das ist praktisch,
 da man beim Arrangieren oft kontrollieren mu&szlig;, ob der zeitliche
 Ablauf stimmt oder das Sample an der eingef&uuml;gten Stelle auch richtig
 zu den anderen Spuren pa&szlig;t. Man w&auml;hlt dann einfach den zu
 kontrollierenden Teil mit den Playmarkern aus. Ist kein Playmarker
 definiert, wird alles vom Anfang bis zum Ende der Liste abgespielt.
 Der Playend-Marker kann gesetzt werden, indem man das Playend-Feld
 (unteres Playfeld) anklickt. Es erscheint dann ein <A HREF="page0094.htm">Dialog zur Zeiteingabe</A>.
 Man kann den Playend-Zeitpunkt auch mit den beiden Pfeiltasten (9)
 rechts neben dem Playend-Feld verschieben.
 Der Playend-Marker erscheint im Tracker als senkrechte Linie mit dem 
 Kennbuchstaben E. Diese Linie l&auml;&szlig;t sich mit der Maus anfassen und an
 eine andere Position bewegen. Ist nur ein Playend-Marker, aber kein
 Playstart-Marker definiert, wird vom Anfang des Tracker-Arrangements
 bis zum Playend-Marker abgespielt. 


 9) Pfeiltasten

 Mit den Pfeiltasten k&ouml;nnen die Marker bzw. Start- und Endpunkte verschoben
 werden. Man kann die Tasten dabei gedr&uuml;ckt lassen, um die Marker weiter zu
 verschieben (Repeat-Funktion).

</PRE>

<A HREF="#4.14.6">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>