<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Installation</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="1.2"></A>

<TABLE WIDTH="99%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0002.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0004.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Installation</H1></CENTER>

<PRE>

<H3> 1.2 Installation der Audio-Suite</H3> 
 Bevor sie die Software installieren, stellen sie sicher, da&szlig; sie einen alternativen
 Fileselector ihrer Wahl wie z.B. Selectric oder Boxkite installiert haben, da der
 TOS-eigene Fileselector seinen Hintergrund nicht selbst rettet, und dadurch die Fenster
 und Dialoge des Installers zerst&ouml;rt. 

 Die Installation ist ganz einfach. Starten sie das Installationsprogramm INSTALL.PRG,
 und entpacken sie damit die Dateien auf der angegebenen Partition. Auf der Partition
 sollten ca. 15 MB f&uuml;r das Komplettpaket (inkl. Hilfesystem) frei sein.
 Notfalls geht es auch zu Fu&szlig;. Zum Entpacken nehmen sie das LZH-Dekomprimierprogramm
 LHARC (ab V3.1),und entpacken hiermit den Ordner STARTRAK.LZH von Disk1.
 Die Software ben&ouml;tigt ca. 6 MB freien Platz auf der Festplatte.
 Anschlie&szlig;end entpacken sie den Hypertext von Disk2 (STARHELP.LZH) in das Hauptverzeichnis
 des StarTrack-Ordners. Der Hypertext ben&ouml;tigt ca. 5 MB freien Platz auf der Festplatte.
 Nach der Installation der Software sollte der StarTrack-Ordner in etwa so aussehen:
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>/STARTRAK</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Hauptordner</TD>
</TR>
<TR>
<TD VALIGN=TOP>/STARHELP</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Hypertext-System f&uuml;r 1stGuide</TD>
</TR>
<TR>
<TD VALIGN=TOP>/1STGUIDE</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Hypertext-Software 1stGuide</TD>
</TR>
<TR>
<TD VALIGN=TOP>/CPU_PLUG</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Ordner mit CPU Effekt-Plugins</TD>
</TR>
<TR>
<TD VALIGN=TOP>/DOC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Ordner mit der StarTrack-Dokumentation und Hilfshinweisen</TD>
</TR>
<TR>
<TD VALIGN=TOP>/DEUTSCH</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Deutschsprachige StarTrack-Doku</TD>
</TR>
<TR>
<TD VALIGN=TOP>HARDWARE.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Hardware-Features</TD>
</TR>
<TR>
<TD VALIGN=TOP>SHORTCUT.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Liste der Tastatur-Shortcuts</TD>
</TR>
<TR>
<TD VALIGN=TOP>SOFT.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Software-Beschreibung in Kurzform</TD>
</TR>
<TR>
<TD VALIGN=TOP>SOFTFEAT.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Software-Features in tabellarischer Kurzform</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARTRAK.UPL</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Upload-Text f&uuml;r Mailboxen (nur Demoversion !)</TD>
</TR>
<TR>
<TD VALIGN=TOP>UPDATE.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Update-History</TD>
</TR>
<TR>
<TD VALIGN=TOP>/ENGLISH</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Englischsprachige StarTrack-Doku</TD>
</TR>
<TR>
<TD VALIGN=TOP>HARDWARE.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Hardware-Features</TD>
</TR>
<TR>
<TD VALIGN=TOP>SNDCHECK.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Soundcheck</TD>
</TR>
<TR>
<TD VALIGN=TOP>SOFT.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Software-Features</TD>
</TR>
<TR>
<TD VALIGN=TOP>SOFTFEAT.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Short list of Software-Features</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARTRAK.UPL</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Uploadtext for the publication in mailboxes</TD>
</TR>
<TR>
<TD VALIGN=TOP>/DSP_PLUG</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Ordner mit den DSP Effekt-Plugins</TD>
</TR>
<TR>
<TD VALIGN=TOP>/UTILITYS</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Ordner mit Zusatzprogrammen und Accessories</TD>
</TR>
<TR>
<TD VALIGN=TOP>/STARMODE</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Accessorie f&uuml;r Moduswahl der Matrix & Audiohardware</TD>
</TR>
<TR>
<TD VALIGN=TOP>/STARTUP</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Autostart Musicplayer,kann Startsample abspielen</TD>
</TR>
<TR>
<TD VALIGN=TOP>/STAR_CSB</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Accessorie zum Auslesen des digitalen Channel-Statusblocks</TD>
</TR>
<TR>
<TD VALIGN=TOP>/TT_MMU</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Autoordner-Programm f&uuml;r den Atari TT zur DSP-Registerumlenkung</TD>
</TR>
<TR>
<TD VALIGN=TOP>/WINPATCH</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Winrec-Startprogramm bzw. Patch</TD>
</TR>
<TR>
<TD VALIGN=TOP>PAUSE.PRG</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Wartet auf Tastendruck,f&uuml;r den Autoordner</TD>
</TR>
<TR>
<TD VALIGN=TOP>BEEP.INF</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Infofile f&uuml;r BEEP.S16</TD>
</TR>
<TR>
<TD VALIGN=TOP>BEEP.S16</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>4 sek. Sample-Pieper f&uuml;r Aufnahmestart-Sync</TD>
</TR>
<TR>
<TD VALIGN=TOP>LANGUAGE.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>aktuelles Sprachfile</TD>
</TR>
<TR>
<TD VALIGN=TOP>LANG_D.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>deutsches Sprachfile</TD>
</TR>
<TR>
<TD VALIGN=TOP>LANG_E.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>englisches Sprachfile</TD>
</TR>
<TR>
<TD VALIGN=TOP>LANG_F.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>franz&ouml;sisches Sprachfile</TD>
</TR>
<TR>
<TD VALIGN=TOP>LIESMICH.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Installationshinweise und letzte &Auml;nderungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>MAKE.SET</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Setup-File f&uuml;r den StarTrack-Installer</TD>
</TR>
<TR>
<TD VALIGN=TOP>NONSTOP.INF</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Infofile f&uuml;r NONSTOP.S16</TD>
</TR>
<TR>
<TD VALIGN=TOP>NONSTOP.PBF</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Cachefile f&uuml;r NONSTOP.S16</TD>
</TR>
<TR>
<TD VALIGN=TOP>NONSTOP.S16</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Infofenster-Sample</TD>
</TR>
<TR>
<TD VALIGN=TOP>README.TXT</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Installation-reference and last modifications</TD>
</TR>
<TR>
<TD VALIGN=TOP>SOUND.PRG</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Audio Hardware- und XBIOS-Treiber</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARALL.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r alle Aufl&ouml;sungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARCOLOR.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r Farbaufl&ouml;sungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARHIC.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r hohe Farbaufl&ouml;sungen ab 1024x768</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARHIM.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r gro&szlig;e Monochromaufl&ouml;sungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARLOC.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r niedrige Farbaufl&ouml;sungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARLOM.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r niedrige Monochromaufl&ouml;sungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARMONO.RSC</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Resourcefile f&uuml;r monochrome Aufl&ouml;sungen</TD>
</TR>
<TR>
<TD VALIGN=TOP>STARTRAK.PRG</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=480>Programm Audio-Suite (Editor,Tracker,und mehr)</TD>
</TR>
</TABLE>

<PRE>

<B> Erkl&auml;rung zu den einzelnen Programmteilen</B>

 Im Ordner "STARMODE" befindet sich ein Accessorie f&uuml;r die Modusauswahl der Audiohardware.
 Dieses l&auml;uft auch als Programm (Endung von ACC in PRG umbenennen). Das Modewatch-Accessory
 ist n&uuml;tzlich,um Falcon-Fremdsoftware auch in Verbindung mit der StarTrack-Audiohardware
 nutzen zu k&ouml;nnen. Man kann hier durch diverse Einstellungen auch etwas "unsaubere"
 Programme zur Zusammenarbeit &uuml;berreden. Details hierzu erfahren sie in den entsprechenden
 Textfiles (im Ordner "STARMODE").

 Im Ordner "STAR_CSB" befindet sich ein weiteres Accessorie zum detaillierten Auslesen des
 digitalen Channel Status Block. Dieses l&auml;uft auch als Programm
 (Endung von ACC in PRG umbenennen).
 Der CSB (Abk&uuml;rzung f&uuml;r Channel Status Block) ist im digitalen SP/DIF und AES/EBU-Signal
 f&uuml;r zus&auml;tzliche Informationen zum reinen Audiosignal definiert. Dort findet man
 detaillierte Infos zur Aufnahmequelle, Samplerate, Fehlerkorrektur etc. die vom Accessorie
 ausgewertet und in verst&auml;ndlicher Form dargestellt werden.

 Im Ordner "STARTUP" befindet sich ein Programm, das automatisch beim Start ein beliebiges
 Audiofile abspielen kann. Das Audiofile sollte nicht gr&ouml;&szlig;er als der freie Ramspeicher sein!
 Das Startup-Programm wird gemeinsam mit dem STARTUP.INF (enth&auml;lt den Pfad des Audiofile) in
 den Autoordner oder den MagiC-Startordner kopiert. Der Abspielvorgang kann durch
 Tastendruck abgebrochen werden.

 Im Ordner "TT_MMU" befindet sich ein Programm f&uuml;r den Atari TT. Dieses geh&ouml;rt in den
 Autoordner, direkt hinter den Audiotreiber SOUND.PRG (Reihenfolge beachten). Dieses
 Programm benutzt die MMU des TT um die Register des DSPs in den Falcon-kompatiblen Bereich
 ab $FFFFA200 einzublenden. Dadurch wird die Audiokarte auch kompatibel zu unsauberen
 Falcon-Programmen die den DSP direkt &uuml;ber die Register programmieren. Allerdings ist zu
 beachten, da&szlig; es nur mit dem Original Single-TOS funktioniert und verwendet werden sollte.
 Multitasking-Betriebssysteme wie MagiC, NAES, MultiTOS etc. nutzen bzw. programmieren die
 MMU f&uuml;r eigene Zwecke.

 F&uuml;r solche Betriebssysteme mu&szlig; das Autoordner-Programm DSP ROUT.PRG wieder entfernt werden!
 Zuk&uuml;nftige Versionen des MMU-Patchs werden die DSP-Umlenkung auch f&uuml;r Multitasking-Systeme
 erm&ouml;glichen,so das dann auch dort der DSP in den Falcon-Adressbereich eingeblendet wird.

 Im Ordner "WINPATCH" befinden sich 2 Programme, um Winrec mit der Audiokarte nutzen zu
 k&ouml;nnen. WINRECON.PRG sollte man vor dem Start des Winrec-Programms starten.
 Es setzt den Maschinencookie auf Falcon, da Winrec diesen beim Start abfragt.
 Nach der Benutzung von Winrec sollte man auf jeden Fall WINRECOFF.PRG starten,
 da der Cookie unbedingt wieder zur&uuml;ckgesetzt werden mu&szlig;!
 Es kann sonst erheblich Probleme mit anderen Programmen (z.B. CD-Recorder von Soundpool)
 oder Festplattentreibern kommen, da diese dann ebenfalls von einer
 Falcon-Maschine ausgehen.

 Wichtig: Die Accessories ben&ouml;tigen den Audiotreiber "SOUND.PRG", da die Accessories
 darauf zur&uuml;ckgreifen.

 Die Programmoberfl&auml;che und die Fehlermeldungen k&ouml;nnen mit den Sprachfiles auf die
 entsprechenden Sprachgegebenheiten lokalisiert werden. Hierf&uuml;r gibt es Sprachfiles f&uuml;r
 deutsch (LANG_D.TXT), englisch (LANG_E.TXT) und franz&ouml;sisch (LANG_F.TXT). Die Sprache kann
 <A HREF="page0060.htm">im Setup</A> ausgew&auml;hlt werden. Andere Sprachen k&ouml;nnen ebenfalls eingebunden werden. Hierf&uuml;r
 benennt man das Sprachfile in LANGUAGE.TXT und setzt im STARTRK.INF den Parameter
 language=external. Diese Datei wird von der Audiosoftware nachgeladen.

 NONSTOP.S16 ist ein Sample, das quasi als Erkennungsmelodie oder Demo abgespielt wird,
 wenn das Info-Fenster ge&ouml;ffnet wird.

 BEEP.S16 ist ein Sample das einen Piepston 4x im Abstand von ca. 1 sec. von sich gibt,
 wenn man im Programm die Aufnahme im Beepmode <A HREF="page0060.htm">(siehe Setup-Dialog)</A> startet. Das Sample
 wird dann von der Audiosoftware automatisch abgespielt. PAUSE.PRG kann man bei Bedarf
 in den Autoordner kopieren und sollte sich direkt hinter dem Audiotreiber
 SOUND.PRG befinden. Es macht nichts anderes als auf einen Tastendruck zu warten.
 Dadurch hat man die M&ouml;glichkeit, die Statusmeldungen des Audiotreibers in aller
 Ruhe zu verfolgen.

 Die Fastload- und Fastmemflags des Audiotreibers (SOUND.PRG) sollten gesetzt sein.
 Die Flags des Hauptprogramms (STARTRAK.PRG) d&uuml;rfen auf keinen Fall ge&auml;ndert werden, 
 sind normalerweise aber ebenfalls gesetzt !

<B> Einrichtung der StarTrack Mastering-Software</B>

 Das Programm l&auml;uft ab einer Aufl&ouml;sung von 640x400 monochrom und 4MB RAM, die volle
 Leistung entfaltet sich aber erst ab einer Aufl&ouml;sung von 1024x768/256 Color,da dann die
 Resource-Dateien f&uuml;r gro&szlig;e Aufl&ouml;sungen geladen werden, die im Editor,
 Audio-Fileselector und Tracker gr&ouml;&szlig;ere Fenster zur Verf&uuml;gung stellen.
 Das Programm l&auml;uft auf allen TOS-Rechnern mit VME-Bus (MegaSTE, TT, Medusa & Milan
 mit VME-Karte, Hades) unter TOS, MultiTOS und MagiC.
 Das Programm wurde gr&ouml;&szlig;tenteils auf einem Hades060 programmiert.

 Die Software l&auml;uft ohne Audiohardware automatisch im Demo-Modus und ebenfalls auf den
 genannten Rechnern und allen 68000er Ataris ab 4MB, dem TT und Falcon, und auf
 Apple-Rechnern unter MagiCMac.

 Das Programm sollte auf allen bekannten TOS-kompatiblen Systemen laufen.

 Es sollte immer genug freies RAM vorhanden sein. Eine zu knappe Best&uuml;ckung reicht zwar f&uuml;r
 einen kurzen Test aus, aber f&uuml;r sinnvolles Arbeiten sind 8MB freies SampleRAM empfohlen.
 Mehr Speicher sollte man h&ouml;chstens in speziellen F&auml;llen (im Tracker bei 16 Spuren und
 langsamer Festplatte) einstellen <A HREF="page0060.htm">(im Setup)</A>, da das Programm durch zuviel SampleRAM
 langsamer wird. Die Amplitudenwerte m&uuml;ssen n&auml;mlich immer f&uuml;r das SampleRAM
 berechnet werden. Das kann bei viel SampleRAM (z.B. mehr als 20MB) das Programm ausbremsen.

 Die Accessorys sind speziell f&uuml;r die StarTrack Audiokarte programmiert worden, und daher
 f&uuml;r den Betrieb auf dem Falcon oder unter MagiCMac &uuml;berfl&uuml;ssig.

 Im Demomodus ist sogar die Audioausgabe unter MagiCMac und Audio Ein- und Ausgabe auf
 dem Falcon m&ouml;glich. Allerdings bisher nur f&uuml;r Samples im RAM. HD-Recording und
 DSP-Funktionen werden auf dem Falcon noch nicht unterst&uuml;tzt. Dieser Teil der Software ist
 im Entstehungsstadium. Am Ende wird eine Software-Version f&uuml;r den Falcon stehen, die dann
 aber kostenpflichtig sein wird. Achtung! Das Programm l&auml;uft auf allen TOS-kompatiblen
 Rechnern ab 4MB RAM und braucht mindestens ca. 3.5 MB freien Speicher!!!
 Dabei wird allerdings ein Sparmodus (wenn weniger als 6MB freier Speicher vorhanden)
 gefahren, d.h. dann ist nur Monochrom-Darstellung (Fenstergr&ouml;&szlig;e max. 640x400)
 m&ouml;glich und es wird weniger Speicher f&uuml;r Cache-Zwecke verwendet.
 Erst ab ca. 6MB freiem RAM l&auml;uft die Software im Farbmodus und mit gr&ouml;&szlig;eren Fenstern.
 Empfohlen sind 8MB freies RAM um schnelles und zuverl&auml;ssiges Arbeiten mit allen Funktionen
 zu gew&auml;hrleisten. Wichtig f&uuml;r TT-Benutzer: Die Rede ist hier immer von
 zusammenh&auml;ngendem RAM, empfohlen sind hier also 6-8 MB Fast-RAM. Wer mehr Speicher hat,
 kann das <A HREF="page0060.htm">im Setup</A> anpassen und gegebenenfalls mehr Speicher zuteilen. Die Software l&auml;uft
 problemlos im Fast-RAM,und auch auf 68040er und 68060er CPUs (Hades, Medusa, Milan).

 StarTrack kommt (noch) nicht mit dem Ver&auml;ndern der Fenstergr&ouml;&szlig;e in Echtzeit unter
 MagiC zurecht. Beim Ver&auml;ndern der Fenstergr&ouml;&szlig;e unter MagiC sollte man daher zus&auml;tzlich
 die Control-Taste dr&uuml;cken. Dann wird nur der Rahmen des Fensters gezeichnet.

 Wichtig f&uuml;r Anwender des NOVA-VDI: Die Farbdarstellung von Invertierungen ist nicht
 korrekt, und daher sind z.B. selektierte Buttons schlecht lesbar. Dies ist ein Fehler des
 NOVA-VDI, und leider durch die Software nicht zu umgehen.
 Auf Grafikkarten mit NVDI-Treiber ist die Darstellung korrekt.

 NVDI ab V5.0 wird f&uuml;r alle Rechner mit StarTrack-Audiokarte dringend empfohlen.

 Ansonsten braucht nichts installiert werden, ein Doppelklick auf STARTRAK.PRG gen&uuml;gt,
 um das Programm zu starten. Der Audio-Hardwaretreiber "SOUND.PRG" wird automatisch von
 STARTRAK.PRG nachgeladen. Der Treiber sollte sich im gleichen Ordner wie das Programm
 befinden. Der Audiotreiber "SOUND.PRG" ist auch aus dem Autoordner ladbar und gibt dann
 einige Statusmeldungen zur installierten Audiohardware aus. Wenn der Audiotreiber aus
 dem Autoordner geladen wird, sollte er sich m&ouml;glichst weit hinten in der
 Startreihenfolge der Autoordner-Programme befinden. Die Startreihenfolge
 l&auml;&szlig;t sich z.B. mit XBOOT einstellen.

 Nach dem ersten Start zeigt das Programm nicht sofort alle seine M&ouml;glichkeiten.
 Nach dem ersten Start sollte man zuerst den <A HREF="page0060.htm">SETUP-Dialog</A> aufrufen:
 Dieser verbirgt sich hinter dem Bleistift-Symbol in der oberen Buttonreihe des
 Edit-Fensters. Hier k&ouml;nnen sie einige Einstellungen vornehmen,um das Programm den
 eigenen Erfordernissen anzupassen. Begrenzen sie wenn n&ouml;tig den vom Programm
 angeforderten Speicher im <A HREF="page0060.htm">Setup</A>. Wichtig ist hierbei,da&szlig; der Tracker zum
 einwandfreien Arbeiten nach mindestens 8 MB freiem RAM verlangt (f&uuml;r 8MB :
 malloc=8192 und max-Feld angekreuzt). Speichern sie nun das <A HREF="page0060.htm">Setup</A> ab
 (auf SAVE-Button klicken). Wichtig: Das Programm speichert auch die Fensterpositionen
 mit ab, und restauriert die Fenster beim n&auml;chsten Start.

 Es gibt (wie bereits erw&auml;hnt) eine ausf&uuml;hrlich bebilderte Programmbeschreibung als
 Hypertext (Ordner /STARHELP). Dieser arbeitet mit 1stGuide zusammen,und kann im Programm
 &uuml;ber die HELP-Taste aufgerufen werden. Bei korrekter Installation bekommt man dann
 alle Funktionen des entsprechenden Fensters erkl&auml;rt.

 Viele Falcon-Programme laufen bereits mit der Startrack Audiokarte zusammen.
 Daf&uuml;r mu&szlig; jedoch der XBIOS-Treiber SOUND.PRG installiert sein (z.B. im Autoordner).
 Diesen k&ouml;nnen sie aber nat&uuml;rlich auch manuell starten.

 <B>Anforderungen f&uuml;r Harddisk-Recording</B>

 Harddiskrecording ist eine sehr anspruchsvolle Aufgabe f&uuml;r ein Computersystem und
 stellt entsprechend hohe Anforderungen an das System. Je schneller der Rechner,
 desto besser. Auch der Speicherausbau sollte nicht zu knapp bemessen sein.
 Nat&uuml;rlich hat auch die Festplatte einen ma&szlig;geblichen Einflu&szlig; auf
 die Leistungsf&auml;higkeit. Auch hier gilt: Je schneller und gr&ouml;&szlig;er,
 desto besser. Mit dem Hades060 sind momentan 16 Spuren Audiowiedergabe m&ouml;glich.
 Durch weitere Optimierungen am Treiber wird hier in Zukunft vielleicht sogar
 24 Spuren Audiowiedergabe m&ouml;glich sein. Die nach heutigen Ma&szlig;st&auml;ben
 leider relativ langsame SCSI-Anbindung der TOS-Rechner begrenzt hier deutlich die
 M&ouml;glichkeiten. Mit einer PCI Ultra-SCSI-Karte f&uuml;r den Hades oder Milan
 w&auml;re nat&uuml;rlich deutlich mehr m&ouml;glich (sch&auml;tzungsweise 32Spuren oder mehr).
 Die Verwendung der Audiokarte am MegaSTE ist technisch kein Problem, HD-Recording
 ist hier aber wegen der geringen Rechenleistung nur unter besten Bedingungen m&ouml;glich,
 RAM-Sampling ist aber auch hier kein Problem.

 Bei Supportfragen wenden sie sich bitte an den Hersteller :

 <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A>, Entwicklungsb&uuml;ro, Niehler Str. 312, 50735 K&ouml;ln,
 Tel: 0221-7127380, Fax: 0221-685184

</PRE>

<A HREF="#1.2">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>