<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Hardware</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="2.1.5"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0024.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0026.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Hardware</H1></CENTER>

<PRE>

<H3> 2.1.5 Verbindung zu Audioger&auml;ten</H3>
 Die digitalen Ein- und Ausg&auml;nge k&ouml;nnen mit einem Digital-Audio-Ger&auml;t
 verbunden werden wie z.B. CD, DAT, DCC, MD. Hierf&uuml;r gibt es passende
 Lichtleiterkabel f&uuml;r den optischen Anschluss und passende Cinch-Kabel f&uuml;r den
 koaxialen Digitalanschluss. Dieses sollte m&ouml;glichst ein f&uuml;r Digital-Audio
 genormtes 75 Ohm Kabel sein,und nicht ein einfaches Audio-Cinchkabel.
 Die Digitalfrequenzen sind wesentlich h&ouml;her als die Audiofrequenzen!
 F&uuml;r die Analogverbindung zur HIFI-Anlage oder Mischpult sollte man
 m&ouml;glichst hochwertige Kabel verwenden. Die Billig-Cinchkabel sind meist
 schlecht abgeschirmt und neigen zu Brummst&ouml;rungen, gerade bei l&auml;ngeren
 Kabeln. Haben sie Brummst&ouml;rungen, so kann das mehrere Ursachen haben.
 So kann das Fernseh- oder Rundfunkkabel f&uuml;r diese St&ouml;rung verantwortlich
 sein. Abhilfe schafft ein Mantelstromfilter das man im guten HIFI-Handel
 bekommt. Eine doppelte Erdung ist auch oft Ursache von Brummst&ouml;rungen.
 Es wurde au&szlig;erdem bei der Startrack-Karte darauf geachtet, das sie nur einmal
 mit Masse in Verbindung kommt, und zwar &uuml;ber den VME-Stecker. Deshalb
 ist bei der 5 1/4-Zoll-Einschubversion der Einschub auch aus Kunststoff
 und nicht aus Metall. Da das Frontblech mit den Anschlu&szlig;bezeichnungen
 beschriftet ist, er&uuml;brigt sich deren Erkl&auml;rung eigentlich:

 Der Analogausgang wird mit einem freien Eingang (Tape, CD, LINE... aber nicht
 PHONO!) des Verst&auml;rkers verbunden.
 Der Analogeingang wird mit einem Aufnahmeausgang des Verst&auml;rkers
 (TAPE-REC oder &auml;hnlich) verbunden.
 Die Digitaleing&auml;nge k&ouml;nnen beide gleichzeitig angeschlossen werden, also z.B:
 der optische Eingang mit einem CD-Player und der digitale Cinch-Eingang mit
 einem DAT-Recorder.

 Die Ein-und Ausg&auml;nge kann man leicht unterscheiden, da sie r&auml;umlich getrennt
 sind: Die Eing&auml;nge sind auf der linken H&auml;lfte und die Ausg&auml;nge auf der rechten
 H&auml;lfte des Frontblechs zu finden.

 Apropos Frontblech: Es besteht aus nichtrostendem Edelstahl!

</PRE>

<A HREF="#2.1.5">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>