<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.14.10"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0095.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0097.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.14.10 Steuerungsfeld</H3>
<IMG SRC="../images/p069_3.gif" WIDTH="464" HEIGHT="120">

 Hier&uuml;ber k&ouml;nnen die Samples abgespielt bzw. nach Geh&ouml;r ein Start- und
 Endpunkt des Samples definiert werden. Es stehen s&auml;mtliche bekannten
 Laufwerksfunktionen zur Verf&uuml;gung. Das zu bearbeitende Sample w&auml;hlt man
 mit der linken Maustaste aus (mit der Maus <A HREF="page0088.htm">auf den Block klicken</A>).
 Beim Laden eines Samples wird dieses automatisch zum aktuellen Sample.
 Das aktuelle Sample wird mit einem roten (bei Farbe) bzw. gestrichelten
 (bei monochrome) Rahmen dargestellt.

 1) Trackerdatei-Name

 Hier wird der Suchpfad und Name der geladenen oder gespeicherten
 <A HREF="page0143.htm">Tracker-Datei</A> (Dateiendung *.TRK) dargestellt.


 2) Sample-Dateiname

 Hier steht der Name des ausgew&auml;hlten Samples, da&szlig; nun bearbeitet werden kann.
 Alle Laufwerksfunktionen dienen letztendlich nur dem Zweck, geeignete Start-
 und Endpunkte zu finden.


 3) Zeit-Z&auml;hlwerk

 Dies ist das Z&auml;hlwerk. Es zeigt immer die aktuelle Abspielposition im Sample
 an. Dieser Wert kann mit dem <A HREF="page0092.htm">Startpoint- oder Endpoint-Button</A> &uuml;bernommen
 werden.


 4) auto-record

 Automatische Aufnahme. Hierbei wird vor dem Aufnahmebeginn zuerst auf ein
 Eingangssignal gewartet. Wird ein bestimmter Schwellwert &uuml;berschritten,
 beginnt automatisch die Aufnahme. Diesen Schwellwert kann man im <A HREF="page0060.htm">Setup</A>
 (autorecord-treshold) in Dezibel (dB) einstellen.
 Nach der Aufnahme wird das Sample automatisch in die aktivierte Spur
 geladen und dargestellt.


 5) record

 Hiermit wird die Aufnahme gestartet. Es handelt sich dabei immer um ein
 Harddisk-Projekt. Es erscheint zuerst ein Fileselector, in dem man den Namen
 der Aufnahmedatei eingibt. Danach geht das System in Aufnahmebereitschaft
 (Pause). Anschlie&szlig;end kann die Aufnahme gestartet werden, indem man den
 Pause-Button bet&auml;tigt.
 Nach der Aufnahme wird das Sample automatisch in die aktivierte Spur geladen
 und dargestellt.


 6) begin

 Hiermit gelangt man zum Anfang des Samples.


 7) rewind

 Damit wird das Sample quasi im R&uuml;ckw&auml;rts-Schnelldurchlauf abgeh&ouml;rt.


 8) backplay

 Hiermit wird das Sample r&uuml;ckw&auml;rts abgespielt.


 9) play

 Hiermit startet man die Wiedergabe des Samples.


 10) forward

 Damit wird das Sample quasi im Vorw&auml;rts-Schnelldurchlauf abgeh&ouml;rt.


 11) end

 Hiermit gelangt man zum Ende des Samples.


 12) stop

 Hiermit wird die Aufnahme bzw. Wiedergabe gestoppt.


 13) pause

 Damit kann man die Aufnahme bzw. die Wiedergabe eines Samples 
 vor&uuml;bergehend stoppen. Bei einem weiteren Druck auf die Pausetaste wird die
 Aufnahme bzw. die Wiedergabe fortgef&uuml;hrt.


 14) play and record

 Hiermit kann man das Tracker-Arrangement abh&ouml;ren und parallel dazu ein
 neues Sample aufnehmen. Es erscheint zuerst ein Fileselector, in dem man den
 Namen der Aufnahmedatei eingibt. Danach geht das System in Aufnahmebereitschaft
 (Pause). Anschlie&szlig;end kann die Aufnahme gestartet werden, indem man den
 Pause-Button bet&auml;tigt. Nach der Aufnahme wird das Sample automatisch in
 die aktivierte Spur geladen und dargestellt.

</PRE>

<A HREF="#4.14.10">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>