<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.4"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0060.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0062.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.4 Connection-Fenster</H3>
<IMG SRC="../images/p059_1.gif" WIDTH="560" HEIGHT="420">

 Dieses Fenster ist prim&auml;r f&uuml;r die Auswahl und Kontrolle der digitalen
 und analogen Ein- und Ausg&auml;nge und der DSP-Einbindung zust&auml;ndig.
 Aufgerufen wird das Connection-Fenster durch den <A HREF="page0058.htm">Connection-Button</A> <A HREF="page0052.htm">im
 Editor-Fenster</A>, durch Eingabe von CTRL-G oder &uuml;ber das optionale
 Programm-Men&uuml; im <A HREF="page0109.htm">Dropdown Fenster/Grundeinstellungen</A>.


 1) Digital IN

 Dieser Bereich zeigt einige Codes der digitalen Eing&auml;nge an. &Uuml;ber die
 digitalen Eing&auml;nge werden n&auml;mlich nicht nur die reinen Sounddaten
 &uuml;bertragen, sondern auch zus&auml;tzliche Steuer- und Fehlercodes. Angezeigt
 werden die Daten des Eingangs, der &uuml;ber den Digital-Input-Selector (6)
 ausgew&auml;hlt wurde:
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>SCMS</TD>
<TD VALIGN=TOP>gesetzt</TD>
<TD VALIGN=TOP WIDTH=450>SCMS-Kopierschutz ist aktiviert</TD>
</TR>
<TR>
<TD VALIGN=TOP>Emphasis</TD>
<TD VALIGN=TOP>gesetzt</TD>
<TD VALIGN=TOP WIDTH=450>Die H&ouml;hen wurden bei der Aufnahme stark angehoben und sollten bei der 
Wiedergabe um den gleichen Wert ged&auml;mpft werden.</TD>
</TR>
<TR>
<TD VALIGN=TOP>Audio</TD>
<TD VALIGN=TOP>gel&ouml;scht</TD>
<TD VALIGN=TOP WIDTH=450>CD-ROM oder andere Daten</TD>
</TR>
<TR>
<TD VALIGN=TOP></TD>
<TD VALIGN=TOP>gesetzt</TD>
<TD VALIGN=TOP WIDTH=450>Musikdaten</TD>
</TR>
<TR>
<TD VALIGN=TOP>Professional</TD>
<TD VALIGN=TOP>gel&ouml;scht</TD>
<TD VALIGN=TOP WIDTH=450>Consumer-Format (das &uuml;bliche Standartformat von CDs)</TD>
</TR>
<TR>
<TD VALIGN=TOP></TD>
<TD VALIGN=TOP>gesetzt</TD>
<TD VALIGN=TOP WIDTH=450>Profi-Format (Studioformat)</TD>
</TR>
</TABLE>

<PRE>
 
 2) Samplerate

 Die Samplerate der am digitalen Eingang anliegenden Daten. Angezeigt wird
 dabei der Eingang, der &uuml;ber den Digital-Input-Selector (6) ausgew&auml;hlt wurde.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>32</TD>
<TD VALIGN=TOP WIDTH=250>32 kHz (z.B. bei DSR-Digitalradio)</TD>
</TR>
<TR>
<TD VALIGN=TOP>44.1</TD>
<TD VALIGN=TOP WIDTH=250>44.1 kHz (z.B. bei CD)</TD>
</TR>
<TR>
<TD VALIGN=TOP>48</TD>
<TD VALIGN=TOP WIDTH=250>48 kHz (z.B. bei DAT-Rekordern)</TD>
</TR>
</TABLE>

<PRE>
 
 3) Error

 Die digitalen Daten k&ouml;nnen (z.B. durch Dropouts) fehlerbehaftet sein oder
 die Daten&uuml;bertragung ist durch ein fehlerhaftes Kabel gest&ouml;rt. Um solche
 Fehler fr&uuml;hzeitig zu erkennen, sind die Errorcodes recht n&uuml;tzlich.
 Angezeigt wird dabei der Eingang,der &uuml;ber den Digital-Input-Selector (6)
 ausgew&auml;hlt wurde.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>No
validity</TD>
<TD VALIGN=TOP WIDTH=550>- Daten ung&uuml;ltig (z.B. bei CD-Player-Stop)</TD>
</TR>
<TR>
<TD VALIGN=TOP>Transmission</TD>
<TD VALIGN=TOP WIDTH=550>- &Uuml;bertragungsfehler (z.B. Wackelkontakt im Kabel)</TD>
</TR>
<TR>
<TD VALIGN=TOP>Parity</TD>
<TD VALIGN=TOP WIDTH=550>- Pr&uuml;fsummen-Fehler (unsaubere Daten&uuml;bertragung)</TD>
</TR>
<TR>
<TD VALIGN=TOP>Bi-Phase</TD>
<TD VALIGN=TOP WIDTH=550>- Tr&auml;germodulation instabil (z.B. Wackelkontakt im Kabel)</TD>
</TR>
<TR>
<TD VALIGN=TOP>PLL-unlock</TD>
<TD VALIGN=TOP WIDTH=550>- Phasenmodulation gest&ouml;rt (Verbindungskabel fehlt oder unterbrochen)</TD>
</TR>
</TABLE>

<PRE>
 
 4) Input

 Der Eingang kann hier &uuml;ber einen Rollbalken ausgew&auml;hlt werden.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>Digital</TD>
<TD VALIGN=TOP WIDTH=580>Wahl des digitalen Eingangs. Hierbei werden bei Aufnahme die digitalen Sounddaten direkt &uuml;ber 
die Digitalschnittstellen(Coax, SP/DIF, AES/EBU) &uuml;berspielt. Eine Aussteuerung ist bei
Aufnahme nicht n&ouml;tig, da die Daten unver&auml;ndert &uuml;bernommen werden. Der Volume- und Balance-Regler
des Peakmeters ist dabei ohne Funktion.</TD>
</TR>
<TR>
<TD VALIGN=TOP>Analog</TD>
<TD VALIGN=TOP WIDTH=580>Wahl des analogen Eingangs. Hierbei kommen die Daten in Form von analogen Schwingungen 
&uuml;ber den Eingangsverst&auml;rker zum A/D-Wandler, der die Schwingungen in digitale Datensignale 
umwandelt.</TD>
</TR>
</TABLE>

<PRE>
 
 5) Samplerate

 Hier wird die Samplerate des analogen Eingangs &uuml;ber einen Rollbalken
 ausgew&auml;hlt. Bei Wiedergabe von Soundfiles wird mit der hier ausgew&auml;hlten
 Samplerate abgespielt, sofern das Samplefile keinen anderen Wert vorgibt.
 Diese Samplerate l&auml;&szlig;t sich zus&auml;tzlich auch im Editor-Fenster einstellen.
 Der Digitalausgang wird hiermit auch beeinflu&szlig;t, so da&szlig; man die Aufnahmen
 z.B. zur&uuml;ck auf DAT-Band &uuml;berspielen kann.Dabei mu&szlig; man allerdings darauf
 achten, da&szlig; der DAT-Rekorder nur etwas mit den Sampleraten 32.0, 44.1 und
 48.0 kHz anfangen kann. Ist im <A HREF="page0060.htm">Setup-Dialog</A> digital-in clock:Synchronize
 ausgew&auml;hlt, so wird der analoge Eingang mit dem digitalen synchronisiert,
 d.h. die Samplerate des digitalen Eingangs wirkt auf den analogen Eingang
 und es wird mit der Samplerate des digitalen Eingangs aufgenommen. Das ist
 sinnvoll um exakt gleiche Sampleraten zu gew&auml;hrleisten. &Uuml;ber den externen
 Takteingang (<A HREF="page0033.htm">ICLK auf der Platine</A> und EXTCLK am DSP-Port) kann ein externer
 Takt eingespeist werden, der dann auf eine brauchbare Samplerate herunter-
 geteilt wird. Damit sind dann auch andere Sampleraten m&ouml;glich. Die Aufnahme
 wird mit der hier eingestellten Samplerate durchgef&uuml;hrt, wenn der Analogeingang
 gew&auml;hlt wurde und die Synchronize-Option im <A HREF="page0060.htm">Setup-Dialog</A> abgeschaltet ist.
 Ansonsten wird die Samplerate des digitalen Eingangs benutzt.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>DSR
32.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>32.0 kHz (z.B. bei DSR-Digitalradio)</TD>
</TR>
<TR>
<TD VALIGN=TOP>CD 44.1</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>44.1 kHz (z.B. bei CD)</TD>
</TR>
<TR>
<TD VALIGN=TOP>DAT 48.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>48.0 kHz (z.B. bei DAT-Rekordern)</TD>
</TR>
<TR>
<TD VALIGN=TOP>HI 64.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>64.0 kHz (z.B. bei DAT mit Highsampling)</TD>
</TR>
<TR>
<TD VALIGN=TOP>HI 88.2</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>88.2 kHz (z.B. bei DAT mit Highsampling)</TD>
</TR>
<TR>
<TD VALIGN=TOP>HI 96.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>96.0 kHz (z.B. bei DVD, DAT mit Highsampling)</TD>
</TR>
<TR>
<TD VALIGN=TOP>8.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>8.0 kHz (12.288 MHz/4/384)</TD>
</TR>
<TR>
<TD VALIGN=TOP>11.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>11.025 kHz (16.934 MHz/4/384)</TD>
</TR>
<TR>
<TD VALIGN=TOP>12.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>12 kHz (12.288 MHz/4/256)</TD>
</TR>
<TR>
<TD VALIGN=TOP>16.0</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>16.0 kHz (12.288 MHz/2/384)</TD>
</TR>
<TR>
<TD VALIGN=TOP>16.5</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>16.537 kHz (16.934 MHz/4/256)</TD>
</TR>
<TR>
<TD VALIGN=TOP>22.1</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>22.05 kHz (16.934 MHz/2/384)</TD>
</TR>
<TR>
<TD VALIGN=TOP>24</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>24 kHz (12.288 MHz/2/256)</TD>
</TR>
<TR>
<TD VALIGN=TOP>33.1</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>33.075 kHz (16.934 MHz/2/256)</TD>
</TR>
<TR>
<TD VALIGN=TOP>EXT/768</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>Externer Takt geteilt durch 768</TD>
</TR>
<TR>
<TD VALIGN=TOP>EXT/512</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>Externer Takt geteilt durch 512</TD>
</TR>
<TR>
<TD VALIGN=TOP>EXT/384</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>Externer Takt geteilt durch 384</TD>
</TR>
<TR>
<TD VALIGN=TOP>EXT/256</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>Externer Takt geteilt durch 256</TD>
</TR>
<TR>
<TD VALIGN=TOP>DIV xxx</TD>
<TD VALIGN=TOP>-</TD>
<TD VALIGN=TOP WIDTH=360>Externer Takt geteilt durch Frequenzteiler (Faktor 1-15)</TD>
</TR>
</TABLE>

<PRE>
 
 6) Digital

 Hier wird der digitale Eingang &uuml;ber einen Rollbalken ausgew&auml;hlt. Es stehen
 3 digitale Quellen zur Verf&uuml;gung, wobei der AES/EBU-Eingang in der
 Standardversion der Audiokarte nicht verf&uuml;gbar ist. Dieser kann aber mit
 einer Zusatzkarte nachger&uuml;stet werden. Auf dieser XLR-Karte sind au&szlig;erdem
 ein digitaler AES/EBU-Ausgang und analoge XLR-Anschl&uuml;sse (Ein- und
 Ausgang) vorhanden.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>Optical</TD>
<TD VALIGN=TOP WIDTH=340>Optischer TOSLINK SP/DIF-Eingang</TD>
</TR>
<TR>
<TD VALIGN=TOP>Coaxial</TD>
<TD VALIGN=TOP WIDTH=340>Digitaler SP/DIF-Cinch-Eingang</TD>
</TR>
<TR>
<TD VALIGN=TOP>AES/EBU</TD>
<TD VALIGN=TOP WIDTH=340>Professioneller XLR-Eingang nach AES/EBU-Norm</TD>
</TR>
</TABLE>

<PRE>
 
 7) Mode

 Hier kann &uuml;ber einen Rollbalken die digitale &Uuml;bertragungsnorm 
 gew&auml;hlt werden.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>Consumer</TD>
<TD VALIGN=TOP WIDTH=570>Standardnorm f&uuml;r CD-Player, DSR-Tuner und DAT-Rekorder f&uuml;r den Massenmarkt</TD>
</TR>
<TR>
<TD VALIGN=TOP>Profi</TD>
<TD VALIGN=TOP WIDTH=570>Studionorm f&uuml;r professionelle DAT-Rekorder (z.B. Tascam) und andere Digitalquellen</TD>
</TR>
</TABLE>

<PRE>
 
 8) SCMS-Copy

 Bei Digitalquellen f&uuml;r den Massenmarkt wurde eine Kopiersperre eingef&uuml;hrt,
 damit keine unbegrenzten Kopien von digitalem Musikmaterial m&ouml;glich sind.
 Dieses System wurde von der Musikindustrie zur Bedingung bei der Einf&uuml;hrung
 des DAT-Rekorders gemacht, da man Angst vor Raubkopien hatte.
 Aus heutiger Sicht eigentlich Bl&ouml;dsinn, da es mittlerweile auch Profi-DAT-
 Rekorder gibt, die diese Kopiersperre (SCMS=Serial-Copy-Management-System)
 nicht aufweisen. Diese Kopiersperre l&auml;&szlig;t sich mit der Soundkarte umgehen.
 Die Einstellung der Kopiersperre &uuml;ber diesen Rollbalken wirkt aber nicht
 nur bei der Aufnahme, sondern auch bei der Wiedergabe, d.h beim Zur&uuml;ckspielen
 auf DAT. Dabei kann die Kopiersperre auch wieder gesetzt werden, um Eigenaufnahmen 
 vor ungewollten Kopieraktionen nach der &Uuml;berspielung sch&uuml;tzen zu k&ouml;nnen.
 Dieser integrierte Kopierschutz-Decoder/Encoder sollte theoretisch auch bei der
 Profi-Norm AES/EBU funktionieren, mangels solcher Ger&auml;te konnte ich das allerdings
 bisher noch nicht testen. Die Soundkarten-Hardware ist allerdings rekonfigurierbar,
 so da&szlig; man ohne Schaltungs&auml;nderung eine fehlerhafte Funktion beheben kann.
 Man kann die Soundkarte auch als reinen Kopierschutzdekoder verwenden, da die
 digitalen Eingangsdaten direkt zum Digitalausgang geleitet werden, wenn kein
 Soundfile wiedergegeben wird. Daf&uuml;r mu&szlig; allerdings bei Input (4) der
 Digitaleingang gew&auml;hlt sein und der Bypass (10) ausgeschaltet sein.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>No Copy</TD>
<TD VALIGN=TOP>Kein Kopieren m&ouml;glich</TD>
</TR>
<TR>
<TD VALIGN=TOP>One Copy</TD>
<TD VALIGN=TOP>Eine Kopie erlaubt</TD>
</TR>
<TR>
<TD VALIGN=TOP>Free Copy</TD>
<TD VALIGN=TOP>Unbegrenztes Kopieren erlaubt</TD>
</TR>
</TABLE>

<PRE>
 
 9) Deemphasis

 Einige, vor allem &auml;ltere CD-Aufnahmen und viele Klassik-Aufnahmen, wurden
 und werden mit Emphasis aufgenommen, um den Rauschpegel bzw.
 Fremdspannungsabstand zu erh&ouml;hen und damit eine h&ouml;here Aussteuerung zu
 erm&ouml;glichen. Dabei werden bei der Aufnahme die H&ouml;hen stark angehoben. Bei der
 Wiedergabe werden dann die H&ouml;hen mit einer Deemphasis-Schaltung um den
 gleichen Betrag wieder abgesenkt. Um solche CDs korrekt abspielen zu k&ouml;nnen,
 haben CD-Player eine solche Schaltung integriert. Damit man auch diese CDs
 korrekt &uuml;ber die Audiokarte wiedergeben kann, ist eine solche Schaltung
 auch auf der Soundkarte vorhanden. Denn bei der Aufnahme &uuml;ber den digitalen
 Eingang werden die Sounddaten direkt &uuml;bertragen, d.h. die angehobenen H&ouml;hen
 werden unver&auml;ndert &uuml;bernommen. Die Aufnahme wird lediglich im SP/DIF
 bzw. AES/EBU-Code gekennzeichnet (siehe Emphasis, 1). Damit man solche
 Sampledaten korrekt per Digital- oder Analogausgang &uuml;berspielen kann,
 gibt es die M&ouml;glichkeit, die Deemphasis-Schaltung &uuml;ber den Rollbalken ein-
 bzw. auszuschalten. Dabei wirkt beim Analogausgang eine Deemphasis-Schaltung
 und beim Digitalausgang werden die Daten entsprechend gekennzeichnet
 (Emphasis-Bit im Code).
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>Off</TD>
<TD VALIGN=TOP>keine Deemphasis-Entzerrung</TD>
</TR>
<TR>
<TD VALIGN=TOP>On</TD>
<TD VALIGN=TOP>Deemphasis-Entzerrung eingeschaltet</TD>
</TR>
</TABLE>

<PRE>
 
 10) Bypass Digital In-&gt;Out

 Mit diesem Schalter kann man s&auml;mtliche Ver&auml;nderungen am digitalen
 Datensignal unwirksam machen, d.h. die digitalen Daten wandern unver&auml;ndert
 vom Digitaleingang zum Digitalausgang und s&auml;mtliche Einstellungen
 (Deemphasis, SCMS, Mode) bleiben unwirksam.


 11) Get Startmarkers/24Bit

 Im 24Bit-Modus k&ouml;nnen bei Aufnahmen die Startmarken von DAT-Rekordern
 als Marker &uuml;bernommen werden. Die Hardware ist in der Lage, das Digitalsignal
 dementsprechend auszuwerten. Dadurch k&ouml;nnen also auch Startmarken erkannt werden,
 zwischen denen keine Pause besteht (z.B. bei Megamix-CDs).


 12) Switch DSP

 Mit diesem Rollbalken kann man den Wirkungsbereich des DSP (Digitaler
 Signalprozessor) beeinflussen. Die Einstellung hat nat&uuml;rlich nur bei vorhandener
 DSP-Karte einen Sinn und sollte ansonsten auf Off stehen.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>Off</TD>
<TD VALIGN=TOP WIDTH=580>DSP aus. Der DSP liefert keine Daten.</TD>
</TR>
<TR>
<TD VALIGN=TOP>Input</TD>
<TD VALIGN=TOP WIDTH=580>Der DSP wird in den Aufnahme-Signalkreis integriert. Dabei wirkt der DSP schon
bei der Aufnahme und hat bei der Wiedergabe keine Wirkung.</TD>
</TR>
<TR>
<TD VALIGN=TOP>Output</TD>
<TD VALIGN=TOP WIDTH=580>Der DSP wird in den Wiedergabe-Signalkreis integriert. Dabei wirkt der DSP erst bei
der Wiedergabe und nicht schon bei der Aufnahme.</TD>
</TR>
</TABLE>

<PRE>
 
 13) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 14) Exit

 Hiermit wird das Connection-Fenster geschlossen. Alle Einstellungen bleiben
 bis zum n&auml;chsten Aufruf unver&auml;ndert. Man kann jedoch mehrere Fenster
 gleichzeitig ge&ouml;ffnet lassen und hat so immer den direkten Zugriff auf
 die Funktionen.

</PRE>

<A HREF="#4.4">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>