<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Hardware</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="2.1.1.7"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0011.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0013.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Hardware</H1></CENTER>

<PRE>

<H3> 2.1.1.7 Einbau der Jam-Out-Erweiterung im IPC-Geh&auml;use</H3>
 Im von uns gelieferten IPC-Geh&auml;use ist schon alles f&uuml;r den Einbau einer Jam-Out-Erweiterung
 vorbereitet. &Uuml;ber den Slots ist horizontal ein Blech mit 8 Bohrungen f&uuml;r die 6.3mm
 Klinkenbuchsen des Jam-Out. Dieses ist mit zwei Schrauben an den Enden des Bleches befestigt.
 Schrauben sie dieses Blech heraus. Verschrauben sie nun alle 8 Klinkenbuchsen mit den beim
 Jam-Out vorgesehenen Befestigungsschrauben der Klinkenbuchsen. Setzen sie nun das Blech
 wieder ein, und zwar so, da&szlig; die Platinenunterseite des Jam-Out nach oben zeigt
 (also auf den Kopf stellen). Schrauben sie das Blech wieder fest. Nun m&uuml;ssen sie nur noch
 das DSP-Port-Kabel des Jam-Out mit dem DSP-Port der Startrack-Karte verbinden. Und das geht
 folgenderma&szlig;en: Das Jam-Out beinhaltet ein kleines P&auml;ckchen mit DSP-Stecker und
 durchgeschleifter DSP-Port-Buchse f&uuml;r den Anschlu&szlig; weiterer DSP-Port-Erweiterungen,
 ich nenne es der Einfachheit halber Port-Adapter. Zuerst wird die DSP-Port-Buchse der
 Startrack-Karte vom Slotblech abgeschraubt, und mit dem einen Ende des Port-Adapter verbunden.
 Das andere Ende(Sub-D-Buchse) wird wieder mit dem Slotblech verschraubt. Die Abzweigung des 
 Port-Adapters ist f&uuml;r den Anschlu&szlig; des Jam-Out vorgesehen und wird damit verbunden.
 Dieses Kabel mu&szlig; soweit m&ouml;glich gek&uuml;rzt werden! Die Gesamtl&auml;nge des DSP-Kabels ist sonst
 zu gro&szlig;, und f&uuml;hrt zu St&ouml;rungen. Insgesamt jedoch wurden mit dem Jam-Out beste Erfahrungen
 gemacht. Es hat eine gute Klangqualit&auml;t,und kommt auch mit etwas l&auml;ngeren Kabeln zurecht.
 Das Analog8 von Soundpool ist da etwas empfindlicher, funktioniert mit einem kurzen Kabel
 aber ebenfalls problemlos. Die Kanalbelegung von der R&uuml;ckseite aus gesehen:

<img src="../images/jam8.jpg" width="448" height="64">
 
</PRE>

<A HREF="#2.1.1.7">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>