<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.1.17">

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0057.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0059.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.1.17 Button-Toolbar</H3>
<A HREF="p114.htm" TARGET="_new"><IMG SRC="../images/scaled/p114.gif" WIDTH="302" HEIGHT="24"></A>

 Hier&uuml;ber erreicht man die wichtigsten Hauptfunktionen und die anderen
 Fenster. Ist eines der anderen Fenster ge&ouml;ffnet, kann man es durch
 Anklicken des entsprechenden Buttons in der Button-Toolbar (oder indem
 man im optionalen Programm-Men&uuml; im <A HREF="page0109.htm">Fenster-Dropdown</A> den entsprechenden
 Men&uuml;punkt anw&auml;hlt) in den Vordergrund holen, falls es durch andere
 Fenster verdeckt war. 


 Function-Bereich:
 In diesem Bereich der Toolbar haben sie Zugriff auf alle wichtigen
 Fenster und Dialoge. 


 1) <A HREF="page0059.htm">Info-Fenster</A>

 Dieses Fenster zeigt das Programmlogo,die Copyright-Vermerke und
 die Versionsnummer der Software.


 2) <A HREF="page0061.htm">Connection-Fenster</A>

 Dieses Fenster ist prim&auml;r f&uuml;r die Eingangsauswahl und die Kontrolle
 der digitalen Eing&auml;nge und des DSP-Wirkungsbereichs zust&auml;ndig.


 3) <A HREF="page0077.htm">Blockfunktionen-Fenster</A>

 Dieses Fenster ist f&uuml;r die Blockfunktionen des Editors zust&auml;ndig.


 4) <A HREF="page0062.htm">Peakmeter-Fenster</A>

 Dieses Fenster ist f&uuml;r die Aussteuerung und Aufnahme eines Samples
 zust&auml;ndig. Man kann aber auch Samples von Festplatte abspielen und
 dabei die Aussteuerung &uuml;berpr&uuml;fen.


 5) <A HREF="page0082.htm">Midi-Sampleplayer-Fenster</A>

 &Uuml;ber dieses Fenster wird die Ansteuerung eines (oder mehrerer)
 MIDI-Keyboards realisiert. Dazu erstellt man hier eine Liste der
 verwendeten Samples. Man kann hier wichtige Dinge wie die Loopart,
 Start- und Endpunkt, Midikanal, Midinote usw. f&uuml;r jedes einzelne
 Sample bestimmen. Dabei werden die Samples soweit m&ouml;glich automatisch
 in den Speicher geladen, um den Zugriff zu beschleunigen.
 Je mehr RAM-Speicher man hat, desto besser. Die fertige Liste kann als
 Sampleplayer <A HREF="page0141.htm">Arrangement-File</A> (Endung *.ARR) abgespeichert werden.


 6) <A HREF="page0087.htm">Tracker-Fenster</A>

 &Uuml;ber dieses Fenster wird die Mehrspurwiedergabe realisiert.
 Momentan sind 16 Spuren mit 32kHz Samplerate bzw. 12 Spuren mit 48 kHz
 machbar (auf einem Hades060). Die Verarbeitungsgeschwindigkeit ist aber
 noch nicht optimiert, so das man sicherlich noch mehr herausholen kann.
 Man l&auml;dt die einzelnen Samples zun&auml;chst in den Tracker und verteilt diese
 auf die gew&uuml;nschten Spuren. Man kann die Samples aber auch ganze Spuren,
 per Drag&amp;Drop kopieren oder verschieben, Start- und Endmarker definieren
 oder aus der <A HREF="page0140.htm">Information-Datei</A> (*.INF) &uuml;bernehmen, probeh&ouml;ren etc.
 Die Samples werden dabei nichtdestruktiv bearbeitet, d.h. die Sampledateien
 werden nicht ver&auml;ndert. In diesem Fenster kann man also die Samples die
 auf der Festplatte liegen, zu einem &quot;Song&quot; arrangieren.


 7) <A HREF="page0063.htm">Loop-Fenster</A>

 Dieses Fenster ist f&uuml;r die Loopfunktionen des Edit-Fensters zust&auml;ndig.
 Man kann hier bestimmen, in welcher Richtung das Sample abgespielt werden
 soll. Das Abspielen startet aber erst durch Druck auf die Taste PLAY im
 Edit-Fenster. Ist der Blockbutton im <A HREF="page0057.htm">Limit-Bereich</A> aktiviert und Marker-S
 und Marker-E definiert, so wird nur der markierte Bereich abgespielt.
 Ist der Loop-Button im <A HREF="page0057.htm">Limit-Bereich</A> aktiviert, wird das Sample solange
 wiederholt, bis die STOP-Taste gedr&uuml;ckt wird. Im HD-Modus k&ouml;nnen die Samples
 nur vorw&auml;rts abgespielt werden, lediglich im Memory-Modus kann r&uuml;ckw&auml;rts
 abgespielt werden. 


 8) <A HREF="page0073.htm">DSP Plugin-Fenster</A>

 Dieses Fenster ist f&uuml;r die DSP-Effektauswahl zust&auml;ndig.
 Dabei sind einige Effekte schon im Programm enthalten und k&ouml;nnen hier&uuml;ber
 in den DSP geladen werden, unter anderem stehen alle von Winrec bekannten
 Effekte zur Auswahl. Andere Effekte bzw. DSP-Programme k&ouml;nnen in den DSP
 via Load-Funktion geladen werden, da das Programm die DSP-LOD-Files direkt
 verarbeiten kann. Durch die integrierte Plugin-Schnittstelle ist es m&ouml;glich,
 Effekte anderer Hersteller anzupassen bzw. in das Programm zu integrieren.
 Diese Effektmodule werden automatisch nachgeladen und in das Programm
 eingebunden.
 F&uuml;r die Nutzung dieser Effekprogramme ist die DSP-Karte mit einem Motorola
 DSP-56K notwendig. Karten mit anderen, noch leistungsf&auml;higeren, aber zum
 Falcon inkompatiblen DSPs sind bereits in Planung. Diese M&ouml;glichkeit der
 Aufr&uuml;stung macht die Soundkarte sehr flexibel und garantiert auch in Zukunft
 f&uuml;r ein h&ouml;chst leistungsf&auml;higes System.


 9) <A HREF="page0072.htm">Fade-Editor-Dialog</A>

 In diesem Fenster kann der Faderverlauf editiert werden. Dabei stehen
 schon verschiedene fertige Faderkurven zur Auswahl, man kann diese aber
 auch per Hand zeichnen. Diese Kurven k&ouml;nnen auch abgespeichert und
 nachgeladen werden. Die Verl&auml;ufe k&ouml;nnen dann beim Ein- und
 Ausblenden von Samples (Fade im <A HREF="page0045.htm">Function-Dropdown</A>) benutzt werden.


 10) <A HREF="page0103.htm">Cuelist-Fenster</A>

 Die Cuelist stellt ein h&ouml;chst leistungsf&auml;higes Tool zur Verf&uuml;gung,
 um nondestruktive Schnitt- und <A HREF="page0139.htm">Abspiellisten</A> zu erzeugen. Damit kann
 sehr schnell z.B. eine Maxiversion oder ein Remix erstellt werden.
 Die M&ouml;glichkeit, aus der Schnittliste ein neues File zu erzeugen, mit Links
 zu arbeiten oder die Cuelist direkt in ein CD-Writerprogramm zu exportieren,
 runden den Funktionsumfang ab.


 11) <A HREF="page0081.htm">Workmode-Fenster</A>

 In diesem Fenster wird der Aufnahme- und Wiedergabemodus eingestellt: die
 Anzahl der Aufnahmekan&auml;le, die Art der Zusammenmischung mehrerer Spuren
 im Tracker, die Midi-Synchronisation, das Aufnehmen und Wiedergeben im 16
 oder 24Bit-Modus, den Modus des DSP-SRAM etc.


 12) <A HREF="page0064.htm">Midi-Dialog</A>

 Dieser Dialog ist f&uuml;r die Auswahl von Midi-Note &amp; Midi-Kanal zust&auml;ndig und
 wird benutzt, um dem Sample eine bestimmte Midinote und einen Midikanal,
 zum Abspielen &uuml;ber ein Midi-Keyboard zuzuordnen.


 13) <A HREF="page0060.htm">Setup-Dialog</A>

 Dieser Dialog ist prim&auml;r f&uuml;r verschiedene Programmeinstellungen zust&auml;ndig.
 Diese Einstellungen k&ouml;nnen in einer <A HREF="page0135.htm">Setup-Datei</A> (STARTRK.SET) abgespeichert
 werden. Ist eine solche Datei vorhanden, wird sie beim Start des Programms
 automatisch geladen und die darin enthaltenen Einstellungen werden gesetzt.
 

 
 Mode-Bereich:
 In diesem Bereich der Toolbar haben sie Zugriff auf alle wichtigen
 Marker- und Editfunktionen.


 14) Move Marker

 In diesem Modus kann man die Marker an eine andere Position mit der Maus
 oder den Pfeiltasten bewegen (draggen).


 15) Pull Marker

 In diesem Modus kann man mit der Maus einen Markerblock aufziehen.
 Dabei werden die Marker-S und -E dementsprechend auf die
 Blockgrenzen gesetzt.


 16) Scrub Marker

 In diesem Modus kann man die Marker mit der Maus bewegen und h&ouml;rt
 zus&auml;tzlich das Sample an der momentanen Markerposition. Diese Funktion
 erleichtert enorm die Suche nach geeigneten Loops.


 17) Snap Marker

 In diesem Modus wird automatisch nach Nullstellen im Sample gesucht.
 Man greift die Markerline mit der Maus und dr&uuml;ckt zus&auml;tzlich die linke oder
 rechte Shifttaste und l&auml;&szlig;t nun den Marker los. Der Marker springt dann zur
 n&auml;chstgelegenen linken bzw. rechten Markerposition mit Nullstelle, falls eine
 entsprechende Stelle gefunden wurde. Umgekehrt springt der Marker zu einer
 Nichtnullstelle bei gedr&uuml;ckter CTRL (links) bzw. ALT-Taste (rechts).


 18) Zoom Volume

 In diesem Modus kann ein Rechteck mit der Maus aufgezogen werden, da&szlig; den
 gezeigten Bereich in der Lautst&auml;rkedarstellung heranzoomt. Mit gedr&uuml;ckter
 ALT-Taste vergr&ouml;&szlig;ert sich der Amplitudenbereich entsprechend wieder.


 19) Declick Sample

 In diesem Modus k&ouml;nnen Einzelwerte eines Samples grafisch editiert werden.
 Sogenannte Clicks oder St&ouml;rger&auml;usche werden hiermit einfach weggezeichnet.
 Dazu packt man das Sample an der Amplitudenspitze und bewegt es vertikal 
 an die neue Lautst&auml;rkeposition. Die Funktion wirkt erst ab einem
 Zoomverh&auml;ltnis 4:1 und gr&ouml;&szlig;er.


 20) Draw Sample 

 In diesem Modus k&ouml;nnen mehrere Einzelwerte in einem Rutsch ver&auml;ndert
 werden. Man kann direkt Samplekurven in das <A HREF="page0043.htm">Sample-Window</A> einzeichnen
 und dadurch z.B. kleine unsaubere Samplebereiche grafisch korrigieren.
 Die Funktion wirkt erst ab einem Zoomverh&auml;ltnis 4:1 und gr&ouml;&szlig;er.



 File-Bereich:
 In diesem Bereich der Toolbar haben sie Zugriff auf alle wichtigen
 Filefunktionen des Editors.


 21) <A HREF="page0071.htm">Partition-Dialog</A>

 In diesem Dialog kann man die f&uuml;r die Aufnahme freizugebenden Laufwerke
 bestimmen und den Partitionmode aktivieren. Im Partitionmode ist es m&ouml;glich,
 Aufnahmen &uuml;ber mehrere Partitionen zu verteilen, um so das Problem der
 Aufnahmel&auml;ngenbegrenzung durch zu kleine max. Partitonsgr&ouml;&szlig;en auszuhebeln.


 22) <A HREF="page0069.htm">Audio-Fileselector-Dialog</A>

 Dieser Dialog ist als Fileselector-Ersatz gedacht, hat aber noch sehr viel
 mehr M&ouml;glichkeiten, die die Arbeit mit Samples sehr komfortabel machen.
 Um mehr &Uuml;bersichtlichkeit zu bekommen, funktioniert dieser Fileselektor
 etwas anders. Zuerst erstellt man eine Liste der Suchpfade. Diese Liste
 wird unter dem Namen <A HREF="page0137.htm">STARTRK.SEL</A> auf der Festplatte angelegt.
 Angezeigt werden au&szlig;erdem nur die Sampledateien und die entsprechenden
 Kommentare, die in den <A HREF="page0140.htm">Info-Dateien</A> enthalten sind (Dateiendung *.INF).
 Man w&auml;hlt das entsprechende Sample im Bereich Sampledatei-Name aus, indem
 man das entsprechende Feld selektiert und klickt anschlie&szlig;end auf Load.
 Das Sample wird nun in den Sample-Editor geladen. Man kann hier aber auch
 gleich die Samples anh&ouml;ren. Um ein bestimmtes Sample zu finden, wenn die 
 Dateibeschreibung oder der Kommentar alleine nicht weiterhilft, ist das ganz
 n&uuml;tzlich. Daf&uuml;r stehen einem hier die Grundfunktionen eines CD-Players zur
 Verf&uuml;gung, also Play, Stop, Forward, Rewind, Pause. Au&szlig;erdem gibt es eine
 Anspielautomatik bei der die ersten 10 Sekunden eines Titels angespielt
 werden. Au&szlig;erdem kann man <A HREF="page0139.htm">Abspiellisten</A> erzeugen, die aus dem Computer
 eine digitale Musicbox machen.


 23) <A HREF="page0068.htm">Disk-Funktionen-Dialog</A>

 Mit diesem Dialog sind verschiedene Dateioperationen m&ouml;glich, die man im
 t&auml;glichen Computerleben oft braucht. Der Vorteil hierbei ist, da&szlig; man f&uuml;r
 solche Sachen wie l&ouml;schen und umbenennen von Dateien, nicht erst das Programm
 verlassen mu&szlig;. Bei Aufruf des Dialogs erscheint zuerst eine Fileselector-Box,
 mit der das Soundsample das umbenannt, gel&ouml;scht oder kopiert werden soll,
 ausgew&auml;hlt wird. Dann erscheint die Dialogbox.
 Alle Funktionen beziehen sich nicht nur auf das Audiofile, sondern ebenfalls
 auf die dazugeh&ouml;renden Info- und Cachefiles.


 24) <A HREF="page0065.htm">Load-Dialog</A>

 Im nun erscheinenden Dialog kann man w&auml;hlen, ob man das Sample ganz oder als
 Block laden m&ouml;chte. Anschlie&szlig;end wird das Sample in den Editor geladen.
 Falls es dort nicht hineinpa&szlig;t, erscheint der <A HREF="page0066.htm">Virtual-Dialog</A>.
 In diesem kann man w&auml;hlen, ob man einen Block laden m&ouml;chte, der noch in
 das Sample-Memory pa&szlig;t, oder ob man in den Virtual-Mode (HD-Projekt mit
 virtueller Speicherverwaltung) wechseln m&ouml;chte.


 25) <A HREF="page0067.htm">Save-Dialog</A>

 Im nun erscheinenden Dialog kann man w&auml;hlen, ob man den kompletten Sample-
 speicher oder nur den markierten Block speichern m&ouml;chte. Hat man eine Wahl
 getroffen, erscheint zuerst ein Fileselector, in dem man den Namen der
 Sampledatei eingibt. Die Dateiendung entscheidet dabei &uuml;ber das Dateiformat
 (siehe auch <A HREF="page0060.htm">Setup-Dialog</A>). Danach erscheint der <A HREF="page0056.htm">Information-Dialog</A>, in dem man
 dem Sample eine Beschreibung (Kommentar) zur besseren Identifikation geben kann.
 Dann wird das Sample abgespeichert.

</PRE>

<A HREF="#4.1.17">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>