<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Installation</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="1.1"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0001.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0003.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Installation</H1></CENTER>

<PRE>
<H3> 1.1 Installation von 1stGuide</H3>
</PRE>
<TABLE>
<TR>
<TD VALIGN=TOP>1.</TD>
<TD VALIGN=TOP WIDTH=620>Normalerweise wird 1stGuide automatisch bei der Installation des Online-Hilfesystems (Disk2) auf die 
Bootpartition kopiert. Bei manueller Installation kopieren Sie die Datei 1STGUIDE.ACC in Ihr Boot-Verzeichnis.
1stGuide finden sie im STARHELP-Ordner im Unterordner 1STGUIDE.
<P>
<P>1stGuide ist au&szlig;erdem in vielen Mailboxen und im Internet erh&auml;ltlich.
<P>
<P>Falls Sie &uuml;ber 1st Guide drucken m&ouml;chten, mu&szlig; ein GDOS(z.B.NVDI) installiert 
sein.</TD>
</TR>
</TABLE>
<BR>
<TABLE>
<TR>
<TD VALIGN=TOP>2.</TD>
<TD VALIGN=TOP WIDTH=620>Wenn Sie eine Festplatte bzw. bei gro&szlig;em Arbeitsspeicher eine gen&uuml;gend gro&szlig;e 
RAM-Disk besitzen, legen Sie dort einen neuen Ordner an (z.B. &quot;1STGUIDE&quot;), und kopieren Sie den 
gesamten Disketteninhalt dort hinein (falls nicht schon beim Auspacken geschehen).</TD>
</TR>
</TABLE>
<BR>
<TABLE>
<TR>
<TD VALIGN=TOP>3.</TD>
<TD VALIGN=TOP WIDTH=610>Starten Sie Ihren Computer neu, klicken im Desk-Men&uuml; des Desktops den Punkt &quot;1st Guide&quot; an 
und w&auml;hlen in der darauf erscheinenden Datei-Auswahlbox die Datei &quot;1STGUIDE.HLP&quot; im
entsprechenden Datentr&auml;ger/Ordner aus. Dort erhalten Sie weitere Benutzungsinformationen.</TD>
</TR>
</TABLE>

<PRE>
 
 Um 1stGuide mit dem STARTRACK-Programm nutzen zu k&ouml;nnen, mu&szlig; der Suchpfad f&uuml;r
 STARTRAK.IDX in 1stGuide definiert sein. Sie gelangen in den Setup-Dialog von 1stGuide,
 indem sie das Accessory mit gedr&uuml;ckter rechter Maustaste und Doppelklick mit der linken
 Maustaste auf den Accessoryeintrag, aufrufen. Dort tragen sie unter Indexdatei
 den Suchpfad ein. Anschlie&szlig;end dr&uuml;cken sie auf Sichern - fertig.

<H3> Besonderheiten bei der Arbeit mit STARTRACK</H3>
 Da 1stGuide von STARTRACK nicht nur aus einem Fenster, sondern auch aus einer Dialogbox
 heraus aufgerufen werden kann (normalerweise nicht m&ouml;glich) wird in diesem Fall die
 Dialogbox kurz entfernt, um 1stGuide aufrufen zu k&ouml;nnen. Hat 1stGuide alle
 ben&ouml;tigten Fenster ge&ouml;ffnet, erscheint wieder der Dialog und man kann seine
 Eingaben darin t&auml;tigen. Man mu&szlig; dann zuerst die Dialogbox schlie&szlig;en,
 um Zugriff auf 1stGuide zu bekommen, da systembedingt (AES) beim Aufruf einer Dialogbox
 alle anderen Fenster gesperrt sind. Bei einem 1stGuide-Aufruf aus einem Fenster heraus,
 braucht die Software diesen "Trick" nicht anzuwenden.

</PRE>

<A HREF="#1.1">Zum Seitenanfang</A>
<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>