<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.7.5"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0068.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0070.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.7.5 Audio-Fileselector</H3>
<A HREF="p064_2.htm" TARGET="_new"><IMG SRC="../images/scaled/p064_2.gif" WIDTH="331" HEIGHT="150"></A>

 Dieser Dialog ist als Fileselector-Ersatz gedacht, hat aber noch viel mehr
 M&ouml;glichkeiten, die die Arbeit hiermit sehr komfortabel machen.
 Um mehr &Uuml;bersichtlichkeit zu bekommen, funktioniert dieser Fileselektor etwas
 anders. Zuerst erstellt man eine Liste der Suchpfade mittels der Buttons 1-3.
 Diese Liste wird unter dem Namen <A HREF="page0137.htm">STARTRK.SEL</A> auf dem Speichermedium (Festplatte
 o.&auml;.) angelegt. Angezeigt werden au&szlig;erdem nur die Sampledateien und die
 entsprechenden Kommentare, die in den <A HREF="page0140.htm">Info-Dateien</A> enthalten sind
 (Dateiendung *.INF). Man w&auml;hlt das entsprechende Sample im Sampledatei-
 Name-Bereich aus (6), indem man das entsprechende Feld selektiert und klickt
 anschlie&szlig;end auf Load - und das Sample wird in den <A HREF="page0042.htm">Sample-Editor</A> geladen.
 Man kann hier aber auch gleich die Samples anh&ouml;ren. Um ein bestimmtes
 Sample zu finden, wenn die Dateibeschreibung oder der Kommentar alleine
 nicht weiterhilft, ist das ganz n&uuml;tzlich. Daf&uuml;r stehen einem hier die
 Grundfunktionen eines CD-Players zur Verf&uuml;gung, also Play, Stop, Forward,
 Rewind und Pause (siehe 13-17). Au&szlig;erdem gibt es eine Anspielautomatik,
 bei der die ersten 10 Sekunden eines Titels angespielt werden.
 Den Audio-Fileselector erreicht man &uuml;ber das Fileselector-Symbol in der
 <A HREF="page0058.htm">Buttonleiste</A> des Edit-Fensters, durch Eingabe von ALT-S oder &uuml;ber das
 optionale Programm-Men&uuml; im <A HREF="page0110.htm">Dropdown Funktion/Audioselector</A>. 


 1) Path

 Hier w&auml;hlt man einen (zus&auml;tzlichen) Suchpfad f&uuml;r Sampledateien aus.


 2) Add

 Mit diesem Button f&uuml;gt man den eben ausgew&auml;hlten Suchpfad (siehe 1) der
 Suchpfadliste hinzu. Diese Suchpfadliste wird als Datei unter dem Namen
 &quot;STARTRK.SEL&quot; abgespeichert und kann auch mit einem ASCII-Editor
 editiert werden.


 3) New

 Hiermit l&ouml;scht man die Suchpfadliste.


 4) Filename

 Hier wird der Name und Suchpfad der aktuellen Suchpfadliste angezeigt.


 5) Slider

 Hiermit w&auml;hlt man den sichtbaren Listenbereich aus.


 6) Sampledatei-Name

 Hier werden die Original-Dateinamen der Samples aufgelistet.
 Diese Felder k&ouml;nnen angeklickt werden, um sie auszuw&auml;hlen.
 Anw&auml;hlbare Felder erscheinen mit einem blauen Rahmen, um sie als selektierbar
 zu kennzeichnen. Das gilt f&uuml;r das ganze Programm. Wo immer ein solches blau
 umrandetes Textfeld auftaucht, ist dieses auch selektierbar (l&ouml;st meistens
 eine bestimmte Funktion aus).


 7) Sampledatei-Kommentar

 Hier erscheint der Kommentar zum Sample, der in der Info-Datei des
 Samples (Endung *.INF) enthalten ist. Dieser kann nach der Aufnahme eines
 Samples im Editor eingegeben werden (auf Samplename-Feld klicken).


 8) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 9) Time

 Hier wird die Abspielposition eines Samples angezeigt und zwar im Format
 Stunden:Minuten:Sekunden Frames.


 10) Insert

 Hiermit wird das selektierte Sample in die Musicbox-Liste (siehe 11)
 aufgenommen.


 11) Musicbox

 Hiermit schaltet man zwischen Fileselektor und Musicbox um. Die Musicbox ist
 ein weiteres Feature dieses Fileselektors. Man w&auml;hlt verschiedene Samples
 aus, die dann &auml;hnlich einem Wurlitzer-Musikautomaten automatisch abgespielt
 werden. Diese Musicbox-Listen k&ouml;nnen auch gespeichert werden, so da&szlig; man
 sich nicht jedesmal wieder die gleiche Arbeit machen mu&szlig;. Eine genauere
 Erkl&auml;rung folgt unter dem <A HREF="page0070.htm">Stichwort MUSICBOX</A>.


 12) Trash

 Hiermit kann man einzelne Samples incl. der zugeh&ouml;rigen Cache-Datei (*.PBF)
 und Info-Datei (*.INF) l&ouml;schen.


 13) Break

 Beendet die Wiedergabe (gleiche Funktion wie Stop-Button).


 14) Pause

 Die Wiedergabe des Samples (6) wird unterbrochen bis zur n&auml;chsten Bet&auml;tigung
 der Pausentaste.


 15) Stop

 Abbruch der Wiedergabe. Ein Fortsetzen an der gleichen Stelle ist mit Play
 m&ouml;glich.


 16) Play

 Wiedergabe des selektierten Samples (6) starten.


 17) Anspielen

 Anspielen der ersten 10 Sekunden des selektierten Samples (6).


 18) Exit

 Hiermit wird der Fileselector-Dialog geschlossen.


 19) Load

 Hiermit wird der Fileselector-Dialog geschlossen und das selektierte Sample
 in den <A HREF="page0042.htm">Sample-Editor</A> geladen.

</PRE>

<A HREF="#4.7.5">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>