<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.13.4"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0084.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0086.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.13.4 Steuerungsfeld</H3>
<IMG SRC="../images/p199.gif" WIDTH="432" HEIGHT="180">

 Hier&uuml;ber k&ouml;nnen die Samples abgespielt bzw. nach Geh&ouml;r ein Start- und
 Endpunkt des Samples definiert werden. Es stehen s&auml;mtliche bekannten
 Laufwerksfunktionen zur Verf&uuml;gung. Au&szlig;erdem kann man die <A HREF="page0047.htm">Blockmarken</A>
 des Samples (aus dem <A HREF="page0140.htm">Information-File *.INF</A>) einfach ins <A HREF="page0083.htm">MIDI-Arrangement</A>
 &uuml;bernehmen. Das zu bearbeitende Sample w&auml;hlt man normalerweise mit dem
 <A HREF="page0083.htm">Edit-Button</A> aus. Beim Laden eines Samples wird dieses automatisch zum
 aktuellen Sample. 


 1) Sample-Dateiname

 Hier steht der Name des ausgew&auml;hlten Samples, da&szlig; nun bearbeitet werden
 kann. Alle Laufwerksfunktionen dienen letztendlich nur dem Zweck,
 geeignete Start- und Endpunkte zu finden.


 2) Realtime

 Hier w&auml;hlt man die Anzeigeart des Len-Feldes.
</PRE>

<TABLE>
<TR>
<TD VALIGN=TOP>realtime selektiert</TD>
<TD VALIGN=TOP WIDTH=270>= L&auml;nge des Sampleblocks anzeigen.</TD>
</TR>
<TR>
<TD VALIGN=TOP>realtime deselektiert</TD>
<TD VALIGN=TOP WIDTH=270>= Gesamtl&auml;nge des Samples anzeigen.</TD>
</TR>
</TABLE>

<PRE>

 3) Block

 Da die Auswahl des Start- und Endpunkts eines Samples &uuml;ber das Geh&ouml;r mit
 den Laufwerksfunktionen manchmal etwas ungenau ist (besonders wenn man
 Loop-Punkte sucht), hat man noch eine andere M&ouml;glichkeit. Klickt man auf
 den Block-Button, erscheint eine Dialogbox mit den bereits <A HREF="page0047.htm">definierten
 Blockmarkern</A> des Samples (werden im Editor definiert und mit dem Sample in
 der <A HREF="page0140.htm">Information-Datei</A> (*.INF) abgespeichert). Man kann hier nun den
 Markereintrag mit dem Slider ausw&auml;hlen. Diese Marker werden dann in den
 Sample-Eintrag als Start-(Marker-S) und Endpoint(Marker-E) &uuml;bernommen.


 4) Zeit-Z&auml;hlwerk

 Dies ist das Z&auml;hlwerk. Es zeigt immer die aktuelle Abspielposition im Sample
 an. Dieser Wert kann mit dem <A HREF="page0082.htm">Startpoint- oder Endpoint-Button</A> in den Eintrag
 &uuml;bernommen werden.


 5) auto-record

 Automatische Aufnahme. Hierbei wird vor dem Aufnahmebeginn zuerst auf ein
 Eingangssignal gewartet. Wird ein bestimmter Schwellwert &uuml;berschritten,
 beginnt automatisch die Aufnahme. Diesen Schwellwert kann man im
 <A HREF="page0060.htm">Setup-Dialog</A> (autorecord-treshold) in Dezibel (dB) einstellen.


 6) record

 Hiermit wird die Aufnahme gestartet. Es handelt sich dabei immer um ein 
 Harddisk-Projekt. Es erscheint zuerst ein Fileselector, in dem man den Namen
 der Aufnahmedatei eingibt. Dann geht das System in Aufnahmebereitschaft
 bzw. Pause-Bereitschaft. Anschlie&szlig;end kann die Aufnahme gestartet werden,
 indem der Pause-Button gedr&uuml;ckt wird.


 7) begin

 Hiermit gelangt man zum Anfang des Samples.


 8) rewind

 Damit wird das Sample quasi im R&uuml;ckw&auml;rts-Schnelldurchlauf abgeh&ouml;rt.


 9) backplay

 Hiermit wird das Sample r&uuml;ckw&auml;rts abgespielt.


 10) play

 Hiermit startet man die Wiedergabe des Samples.


 11) forward

 Damit wird das Sample im Vorw&auml;rts-Schnelldurchlauf abgeh&ouml;rt.


 12) end

 Hiermit gelangt man zum Ende des Samples.


 13) stop

 Hiermit wird die Aufnahme bzw. Wiedergabe gestoppt.


 14) pause

 Damit kann man die Aufnahme bzw. die Wiedergabe eines Samples vor&uuml;bergehend
 stoppen. Bei einem weiteren Druck auf die Pause-Taste wird die Aufnahme bzw.
 die Wiedergabe fortgef&uuml;hrt.


 15) play and record

 Hiermit kann man ein Sample abh&ouml;ren und parallel dazu ein neues Sample
 aufnehmen.

</PRE>

<A HREF="#4.13.4">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>