<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.14.12"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0097.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0099.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.14.12 Marker-Dialog</H3>
<IMG SRC="../images/p230.gif" WIDTH="400" HEIGHT="300">

 Dieser Dialog ist f&uuml;r die Marker-Auswahl im <A HREF="page0087.htm">Tracker-Fenster</A> und im <A HREF="page0082.htm">Midi-Sampleplayer-
 Fenster</A> zust&auml;ndig. Man erreicht diesen Dialog &uuml;ber das <A HREF="page0097.htm">Block-Symbol</A> im entsprechenden
 Funktionsfeld. Im Marker-Dialog kann man den Blockbereich des Sample ausw&auml;hlen.
 Das ist n&uuml;tzlich, wenn man vorher m&uuml;hsam im Sample-Editor erstellte <A HREF="page0047.htm">Markerdefinitionen</A>,
 z.B. f&uuml;r Loops, im <A HREF="page0082.htm">Midi-Sampleplayer</A> oder <A HREF="page0087.htm">Tracker</A> weiterverwenden m&ouml;chte.
 Man kann im <A HREF="page0087.htm">Tracker</A> hiermit z.B. mehrere gleiche Bl&ouml;cke hintereinandersetzen,
 um so Wiederholungen zu produzieren, ohne da&szlig; man den &Uuml;bergang h&ouml;rt
 (z.B. f&uuml;r einen wiederkehrenden Groove-Rhythmus). Im <A HREF="page0082.htm">Midi-Sampleplayer</A> ist es 
 n&uuml;tzlich, um einen vorher im Editor definierten Bereich, der sich gut zum Spielen
 &uuml;ber ein MIDI-Keyboard eignet, nicht neu von Hand suchen zu m&uuml;ssen. Die hier
 dargestellten Markereintr&auml;ge werden zuerst in der <A HREF="page0140.htm">Sample-Info-Datei</A> (Dateiendung *.INF)
 gesucht. Falls diese nicht vorhanden ist, bleiben die Eintr&auml;ge leer.

 1) Marker-Nummer

 Von den Markereintr&auml;gen ist immer nur einer sichtbar. Mit dem Slider(8) kann
 man den Markereintrag ausw&auml;hlen. Hier erscheint dann die Nummer des
 Markereintrags.


 2) Marker-S

 Hier erscheint der Wert des Start-Markers im Format Stunden:Minuten:Sekunden Frames.
 Der Start-Marker definiert den Anfang eines Sampleblocks im <A HREF="page0087.htm">Tracker</A> oder
 <A HREF="page0082.htm">Midi-Sampleplayer</A>. 


 3) Marker-E

 Hier erscheint der Wert des End-Markers im Format Stunden:Minuten:Sekunden Frames.
 Der End-Marker definiert das Ende eines Sampleblocks im <A HREF="page0087.htm">Tracker</A> oder
 <A HREF="page0082.htm">Midi-Sampleplayer</A>. 


 4) Marker-I

 Hier erscheint der Wert des Init-Markers im Format Stunden:Minuten:Sekunden Frames.
 Der Init-Marker definiert den Anfang des Samples f&uuml;r die Wiedergabe.
 Die Marker I und R spielen vor allem beim Spielen der Samples &uuml;ber ein
 MIDI-Keyboard eine Rolle. Beim Druck auf die Keyboardtaste beginnt die
 Wiedergabe. H&auml;lt man die Keyboardtaste gedr&uuml;ckt, wird das Sample im
 Loopbereich (definiert durch Marker-S und Marker-E) so lange wiederholt,
 bis die Keyboardtaste losgelassen wird. Nach dem Loslassen wird noch der
 Ausklingbereich (Bereich zwischen Marker-E und Marker-R) abgespielt.
 Diese Funktion ist aber noch nicht im <A HREF="page0082.htm">Midi-Sampleplayer</A> implementiert,
 im <A HREF="page0087.htm">Tracker</A> ist Marker I ohne Bedeutung.


 5) Marker-R

 Hier erscheint der Wert des Release-Markers im Format Stunden:Minuten:Sekunden Frames.
 Der Release-Marker definiert den Ausklingbereich des Samples f&uuml;r die
 Wiedergabe. Die Marker I und R spielen vor allem beim Spielen der Samples
 &uuml;ber ein MIDI-Keyboard eine Rolle. Beim Druck auf die Keyboardtaste beginnt
 die Wiedergabe. H&auml;lt man die Keyboardtaste gedr&uuml;ckt, wird das Sample im
 Loopbereich (definiert durch Marker-S und Marker-E) so lange wiederholt,
 bis die Keyboardtaste losgelassen wird. Nach dem Loslassen wird noch der
 Ausklingbereich (Bereich zwischen Marker-E und Marker-R) abgespielt.
 Diese Funktion ist aber noch nicht im <A HREF="page0082.htm">Midi-Sampleplayer</A> implementiert,
 im <A HREF="page0087.htm">Tracker</A> ist Marker R ohne Bedeutung.


 6) Markerwert

 Dies ist der Bereich in dem die Markerwerte stehen. Welche Art der Angabe
 man bevorzugt, kann man im <A HREF="page0060.htm">Setup-Dialog</A> mit dem View-Button einstellen.
 Es wird dann entweder der Wert in Samples oder in Timecode angegeben.


 7) Marker-Kommentar

 Dies ist der Marker-Kommentar. Man kann f&uuml;r jeden Markereintrag einen
 Kommentar definieren. Das ist n&uuml;tzlich, um die Funktion oder
 Bedeutung eines Markereintrages schneller identifizieren zu k&ouml;nnen.
 Hier werden die im Editor <A HREF="page0056.htm">eingegebenen Kommentare</A> angezeigt, die auch im
 <A HREF="page0140.htm">Info-File</A> (Endung *INF) gespeichert wurden.


 8) Slider

 Hiermit kann der Markereintrag ausgew&auml;hlt werden.


 9) Help

 Das Hilfesystem bzw. der Hypertext wird aufgerufen. Wenn sie nicht wissen wie
 das funktioniert, schauen sie sich die Anleitung zu 1stGuide einmal genauer an.


 10) Exit

 Hiermit wird der Marker-Dialog geschlossen. Der ausgew&auml;hlte Blockbereich
 wird nicht beachtet und ist ung&uuml;ltig. Der alte Blockbereich des Samples bleibt
 erhalten.


 11) OK

 Hiermit wird der Marker-Dialog geschlossen. Der ausgew&auml;hlte Blockbereich
 ist g&uuml;ltig und wird &uuml;bernommen.

</PRE>

<A HREF="#4.14.12">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>