<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Einf&uuml;hrung</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="3.4">

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0040.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0042.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Einf&uuml;hrung</H1></CENTER>

<PRE>

<H3> 3.4 Einf&uuml;hrung in die Arbeit mit mehreren Spuren</H3>


 Nun wollen wir einmal 8 Spuren (sogenannte Tracks) zusammenmischen und
 abspielen. Nehmen sie daf&uuml;r aber zuerst 4 komplette St&uuml;cke (jeweils ca. 3-4
 Minuten) auf Festplatte auf. Nehmen sie daf&uuml;r m&ouml;glichst eine mindestens 200 MB
 gro&szlig;e, leere Partition. Sie sehen schon, HD-Recording braucht Unmengen an
 Festplattenkapazit&auml;t. W&auml;hlen sie danach in der <A HREF="page0058.htm">Button-Toolbar</A> den
 Tracker-Button(6) aus. Es &ouml;ffnet sich das <A HREF="page0087.htm">Tracker-Fenster</A>.

<A HREF="p068_1.htm" TARGET="_new"><IMG SRC="../images/scaled/p068_1.gif" WIDTH="480" HEIGHT="340"></A>

 Hier kann man komplette Musikst&uuml;cke arrangieren wie bei einem analogen
 Mehrspur-Tonbandger&auml;t, nur wesentlich komfortabler und rein digital.
 Vertikal sind die einzelnen Tracks angeordnet. Hier werden auch sp&auml;ter unsere
 Samples dargestellt. Das kennen sie ja bereits vom Editor-Fenster, allerdings
 k&ouml;nnen hier nicht nur 2, sondern bis zu 99 Spuren bearbeitet werden.

 Wir werden nun unsere 4 vorher aufgenommenen Musikst&uuml;cke auf die 4
 sichtbaren Stereospuren verteilen. Am linken Rand des Fensters im Spurfeld(3)
 sehen sie die Nummerierung der Tracks.

<A HREF="p068_2.htm" TARGET="_new"><IMG SRC="../images/scaled/p068_2.gif" WIDTH="320" HEIGHT="80"></A>

 Klicken sie nun diesen Spurnummer-Button(1) mit Track Nr.1 (oberste Spur) an.
 Der Spurnummer-Button wird selektiert (schwarz), und ist nun der aktuelle
 Track, auf den sich alle weiteren Aktionen beziehen. Schauen sie nun auf die
 <A HREF="page0058.htm"> Button-Toolbar</A> am oberen Rand des <A HREF="page0087.htm">Tracker-Fenster</A>.
 Im Filebereich finden sie den Load-Button(16). 

<A HREF="p069_1.htm" TARGET="_new"><IMG SRC="../images/scaled/p069_1.gif" WIDTH="403" HEIGHT="32"></A>

 Hiermit laden sie eines der aufgenommenen Musikst&uuml;cke in den ausgew&auml;hlten
 Track. Sie sehen nun einen schmalen rotumrandeten
 (bei monochrom gestrichelt) Block am linken Rand des Spurfeldes.
 Sie k&ouml;nnen nun ausw&auml;hlen, welchen Bereich sie in den <A HREF="page0087.htm">Tracker</A> f&uuml;r ihr
 Arrangement &uuml;bernehmen m&ouml;chten. Es gibt hierf&uuml;r vielf&auml;ltige M&ouml;glichkeiten,
 diese alle hier zu erkl&auml;ren aber den Rahmen sprengen w&uuml;rde. Dr&uuml;cken sie im
 <A HREF="page0096.htm">Steuerungsfeld</A> des <A HREF="page0087.htm">Tracker-Fensters</A> nun die Play-Taste. Sie h&ouml;ren das gerade
 geladene St&uuml;ck. Sie k&ouml;nnen durch die Abh&ouml;rfunktion ohne Parameter bzw.
 Zeiteingabe direkt den Block ausw&auml;hlen, der sie interessiert. Dr&uuml;cken sie nach
 ca. 30 Sekunden die Stop-Taste. Sie m&ouml;chten diese Stelle nun als Startpunkt
 definieren. Dr&uuml;cken sie hierf&uuml;r im <A HREF="page0092.htm">Markerfeld</A> nun den Start-Button(1).

<IMG SRC="../images/p069_2.gif" WIDTH="464" HEIGHT="120">
 
 Dr&uuml;cken sie anschlie&szlig;end wieder die Play-Taste (Space). Die Wiedergabe wird an
 der gleichen Stelle fortgef&uuml;hrt. Dr&uuml;cken sie nach einer gewissen Zeit (ca. 1-2
 Minuten) wieder die Stop-Taste. Diesen Punkt m&ouml;chten wir nun als Ende des
 Blocks definieren. Dr&uuml;cken sie hierf&uuml;r im <A HREF="page0092.htm">Markerfeld</A> den End-Button(2).
 Sie sehen anschlie&szlig;end den markierten Block mit der Sampledarstellung, wie sie
 das schon vom Editor her kennen. Dr&uuml;cken sie nun den Spurnummer-Button
 mit der Nummer 2. Dieser ist nun unser aktueller Track. Laden sie
 nun das zweite Musikst&uuml;ck, wie vorhin gezeigt wurde. Wir wollen nun das 
 gesamte Musikst&uuml;ck als Block markieren. Dr&uuml;cken sie daf&uuml;r im <A HREF="page0096.htm"> Steuerungsfeld</A>
 die End-Taste(11).

<IMG SRC="../images/p069_3.gif" WIDTH="464" HEIGHT="120">

 Hiermit gelangen sie direkt zum Ende des Musikst&uuml;cks. Dr&uuml;cken sie nun
 im <A HREF="page0092.htm">Markerfeld</A> wieder den End-Button. Das komplette Musikst&uuml;ck
 wird nun als Block &uuml;bernommen und dargestellt. Wiederholen sie das f&uuml;r
 die St&uuml;cke 3 und 4 auf den entsprechenden Tracks (Spurnummer 3 und 4).
 Sie sehen nun die 4 Stereospuren (also insgesamt 8 Monospuren=8 Tracks)
 untereinander aufgereiht.
 Sie k&ouml;nnen die Spuren kleiner oder gr&ouml;&szlig;er darstellen (zoomen).
 Probieren sie einmal etwas mit dem Zoomslider(1) herum.

<IMG SRC="../images/p070_1.gif" WIDTH="720" HEIGHT="120">

 Sie sehen die Zeitachse wird gedehnt bzw. gestaucht. Zoomen sie einen
 Ausschnitt etwas n&auml;her heran. Sie k&ouml;nnen sich mit dem Scrollslider(2) rechts
 daneben in der Zeitachse bewegen. Sie sehen, die Sampledarstellung ist sehr
 detailiert. Gehen sie wieder auf Zeitposition Null (Scrollslider ganz nach links
 bewegen), und zoomen sie die Bl&ouml;cke so, da&szlig; sie komplett in der
 Sampledarstellung dargestellt werden und rechts daneben noch etwas Luft ist.

 Nun m&ouml;chten wir unsere 8 Spuren zusammenmischen und abspielen lassen.
 Wir m&uuml;ssen aber zuerst dem <A HREF="page0087.htm">Tracker</A> mitteilen, welche der insgesamt
 m&ouml;glichen 99 Spuren wir mischen m&ouml;chten. Daf&uuml;r gibt es am linken Rand des
 Spurfeldes den Activate-Button(2).

<A HREF="p070_2.htm" TARGET="_new"><IMG SRC="../images/scaled/p070_2.gif" WIDTH="320" HEIGHT="80"></A>

 Ist er selektiert, erscheint er als roter Punkt. Das bedeutet, da&szlig; diese Spur
 als Mischspur gekennzeichnet, also mit den anderen Spuren zusammen
 wiedergegeben werden soll. &quot;Aktivieren&quot; sie nun hiermit alle 4 Stereospuren.
 Wenn sie alles richtig gemacht haben, k&ouml;nnen wir nun mit der Wiedergabe der
 4 Stereotracks beginnen. Allerdings sollten wir dem <A HREF="page0087.htm">Tracker</A> noch mitteilen,
 wieviele Spuren insgesamt gemischt werden sollen. Jetzt werden
 sie sagen, da&szlig; haben wir doch bereits durch die activated-Buttons getan. Das
 stimmt im Prinzip auch, aber es ist so, da&szlig; das Progamm R&uuml;cksicht auf
 leistungsschw&auml;chere Rechner nehmen mu&szlig;. Daher gibt es jeweils optimierte
 Mischroutinen f&uuml;r 4, 8, 12 und 16 Spuren. Auf der rechten Seite, unten im
 <A HREF="page0087.htm">Tracker-Fenster</A>, sehen sie die Kanalanzahl-Buttons.
 
<IMG SRC="../images/p070_3.gif" WIDTH="160" HEIGHT="150"> 
 
 Hier w&auml;hlen sie bitte den 8-Button f&uuml;r 8 Spuren aus.

 Nun wollen wir unser erstes Arrangement abspeichern.
 Gehen sie in die <A HREF="page0058.htm">Button-Toolbar</A> und w&auml;hlen den Save all-Button(18) aus.

<A HREF="p069_1.htm" TARGET="_new"><IMG SRC="../images/scaled/p069_1.gif" WIDTH="403" HEIGHT="32"></A>

 Geben sie dem Arrangement einen Namen.
 Die Dateiendung hierf&uuml;r (*.TRK) wird automatisch eingef&uuml;gt, sie k&ouml;nnen
 diese aber selbstverst&auml;ndlich auch manuell eingeben.

 Je nach Tracker-Wiedergabemodus wird mit den Kanalanzahl-Buttons
 auch der 4Kanal, 8Kanal und 16Kanal-Modus ausgew&auml;hlt.
 Da das Zusammenmischen mehrerer Spuren sehr rechenintensiv ist, gibt es
 mehrere M&ouml;glichkeiten dies zu optimieren, vor allem um leistungsschw&auml;cheren
 Rechnern wie dem TT dies zu erm&ouml;glichen.

 Lesen sie sich nun bitte zuerst das Kapitel <A HREF="page0081.htm">"Workmode"</A> im Referenzteil des
 Handbuchs durch, um die richtige Auswahl des Mischverfahrens zu treffen.

 Nun, ich hoffe sie haben das <A HREF="page0081.htm">Workmode</A>-Kapitel einigerma&szlig;en verstanden.
 &Ouml;ffnen sie nun das <A HREF="page0081.htm">Workmode-Fenster</A> mit der Tastenkombination CTRL-W.
 Haben sie einen Hades oder Milan-Rechner mit leistungsstarker CPU, so
 w&auml;hlen sie bitte den CPU-Mixmode im <A HREF="page0081.htm">Workmode-Fenster</A>. Haben sie einen TT,
 so sollten sie unbedingt den DSP-Mixmode w&auml;hlen. Voraussetzung daf&uuml;r ist
 nat&uuml;rlich die DSP-Erweiterung. Haben sie eine DSP-Erweiterung und m&ouml;chten
 die 8 Kan&auml;le getrennt &uuml;ber ein Einzelausgangsinterface (ADAT, Jam-Out,
 Soundpool Analog8, FA8) am DSP-Port ausgeben, so w&auml;hlen sie bitte den
 Matrix-Mixmode.

 Nun wollen wir endlich mit der Wiedergabe der 8 Spuren beginnen.
 Wechseln sie nun wieder vom Edit-Fenster in das dahinterliegende
 <A HREF="page0087.htm">Tracker-Fenster</A> (Fenster einfach anklicken).
 Dr&uuml;cken sie nun f&uuml;r die Wiedergabe der 8 Spuren in der <A HREF="page0058.htm">Button-Toolbar</A> den
 Mixer-Button(5). Das System geht in Wiedergabe-Bereitschaft (Pause).
 Dr&uuml;cken sie nun die Pause-Taste um die Wiedergabe zu starten. Abbrechen
 k&ouml;nnen sie wie bei allen Fenstern mit Laufwerksfunktionen, mit der ESC-Taste
 bzw. dem Stop-Button.

 Sie h&ouml;ren nun den etwas chaotisch klingenden Mix der vier &uuml;berhaupt nicht
 zusammenpassenden Musikst&uuml;cke. Nunja, hier geht es ja um die prinzipielle
 Vorgehensweise. Ich hoffe, sie haben bis hierher alles nachvollziehen k&ouml;nnen.

 Sie k&ouml;nnen die Bl&ouml;cke auch per Drag&amp;Drop in der Zeitachse und auch auf
 andere Spuren verschieben (mit der rechten Maustaste bewegen). Wie das genau
 geht erfahren sie im Kapitel <A HREF="page0088.htm">"Tracker/Spurfeld"</A> unter Samplebl&ouml;cke(12).

 Viel Spa&szlig; bei der weiteren Lekt&uuml;re und gutes Gelingen.

</PRE>

<A HREF="#3.4">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>