<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Referenz</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="4.14.2"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0087.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0089.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Referenz</H1></CENTER>

<PRE>

<H3> 4.14.2 Spurfeld</H3>
<A HREF="p068_2.htm" TARGET="_new"><IMG SRC="../images/scaled/p068_2.gif" WIDTH="320" HEIGHT="80"></A>

 Hier werden am linken Rand die Parameter-Einstellungen f&uuml;r die Spur
 vorgenommen, wie z.B. Lautst&auml;rke der Spur. Hinter dem Parameterblock folgen
 die Samplebl&ouml;cke, wobei auch der Amplitudenverlauf der Samples dargestellt
 werden kann.

 1) Spurnummer

 Hier steht die Nummer der Spur. Es gibt insgesamt 99 Spuren. Man kann eine
 Spur ausw&auml;hlen, indem man die Spurnummer selektiert. Samples die geladen
 werden, erscheinen automatisch als letztes Sample auf der selektierten,
 ausgew&auml;hlten Spur. Wenn man eine ganze Spur kopieren m&ouml;chte, selektiert
 man die Spurnummer und zieht (draggt) sie mit gedr&uuml;ckter Maustaste in das
 Clipboard. Dabei wird das Clipboard-Symbol selektiert. Nun l&auml;&szlig;t man die
 Maustaste los. Damit wurde die gesamte Spur mit allen Sampleeintr&auml;gen
 zun&auml;chst ins Clipboard kopiert (eine Art Zwischenspeicher). Nun sucht man
 mit dem Slider die gew&uuml;nschte Spur, auf die der Clipboardeintrag kopiert
 werden soll. Hat man die Zielspur im Sichtfeld, klickt man auf das Clipboard.
 Man h&auml;lt dabei die linke Maustaste gedr&uuml;ckt. An der Maus h&auml;ngt nun das
 Spurnummer-Symbol. Dieses zieht man jetzt &uuml;ber den Spurnummer-Button des
 Spurfeldes, in das kopiert werden soll. Dabei wird der Spurnummer-Button
 der Zielspur automatisch selektiert. Ist der Spurnummer-Button selektiert,
 l&auml;&szlig;t man die Maus los - fertig. Der Clipboard-Inhalt bleibt solange
 vorhanden, bis man eine andere Spur oder Sampleblock hineinkopiert.


 2) active

 Man w&auml;hlt hiermit aus allen virtuellen Spuren die Spuren aus, die bei der
 Wiedergabe gemischt und abgespielt werden sollen. Ist der Button selektiert,
 gilt die Spur als ausgew&auml;hlt. Es k&ouml;nnen soviel Spuren als &quot;active&quot; gekennzeichnet
 werden, wie im <A HREF="page0087.htm">Tracker-Kanalanzahlfeld</A> angegeben wurde. Dabei z&auml;hlen 
 Stereospuren als 2 Spuren, d.h. wenn im Kanalanzahl-Feld z.B. 8 selektiert
 wurde, k&ouml;nnen maximal 8 Spuren gemischt werden, also k&ouml;nnen dann max.
 4 Stereospuren oder 2 Stereo- und 4 Monospuren als activated
 gekennzeichnet werden.


 3) Stereosample

 Hiermit kann man w&auml;hlen, ob es sich um eine Stereo- oder Monospur handelt.
 Ist das Feld deselektiert, handelt es sich um eine Monospur. Man kann auf
 einer solchen Spur nur Mono-Samples verwenden!
 Ist das Feld selektiert, handelt es sich um eine Stereospur. Man kann auf
 einer solchen Spur nur Stereo-Samples verwenden!
 Die bestehenden Routinen sind bisher allerdings nur in der Lage, Stereospuren
 zu verarbeiten. Die Verarbeitung von Monospuren folgt in einer sp&auml;teren Version
 des Programms. Daher sollte dieser Button normalerweise auf &quot;S&quot; stehen.
 

 4) mute

 Ist der mute-Button selektiert, wird diese Spur stummgeschaltet, d.h. auch
 wenn sie als activated gekennzeichnet wurde, ist diese Spur bei der
 Wiedergabe unh&ouml;rbar bzw. abgeschaltet.


 5) Volume up

 Hiermit wird die Lautst&auml;rke um 1 Prozent erh&ouml;ht. Man kann den Button auch
 gedr&uuml;ckt lassen, um die Lautst&auml;rke weiter zu erh&ouml;hen. Man kann die
 Lautst&auml;rke des Originals maximal um Faktor 2 auf 200 Prozent verst&auml;rken.


 6) Volume down

 Hiermit wird die Lautst&auml;rke um 1 Prozent verringert. Man kann den Button
 auch gedr&uuml;ckt lassen (Repeat-Funktion), um die Lautst&auml;rke weiter zu verringern.


 7) Volume

 Hier wird der Wert des Spur-Lautst&auml;rkereglers angegeben. Jede Spur kann
 einzeln in seiner Lautst&auml;rke eingestellt werden. Der Wert gibt das Verh&auml;ltnis
 zur Originallautst&auml;rke in Prozent an und bewegt sich von 0-200.
 Die Lautst&auml;rkeeinstellung wird in zuk&uuml;nftigen Versionen durch die M&ouml;glichkeit,
 Volume- und Effektkurven in die Spuren einzuzeichnen, erg&auml;nzt. 


 8) Spurname

 Hier erscheint der Name der Spur. Man kann jeder Spur einen Namen zur
 schnelleren Identifikation geben. Daf&uuml;r klickt man auf das Spurname-Feld.
 Es erscheint dann ein <A HREF="page0089.htm">Dialog</A>, in dem man den max. f&uuml;nfstelligen Namen
 eingeben kann. Die max. 5 Stellen sind ein Zugest&auml;ndnis an die beengten
 Platzverh&auml;ltnisse, da die Software ab einer Bildaufl&ouml;sung von 640x400
 laufen soll.


 9) balance left

 Hiermit wird die Balance nach links verschoben. Man kann den
 Button auch gedr&uuml;ckt lassen, um die Balance weiter zu verschieben.
 Die Balance l&auml;&szlig;t sich um 50 Prozent nach links und rechts 
 verschieben.


 10) balance right

 Hiermit wird die Balance nach rechts verschoben. Man kann den
 Button auch gedr&uuml;ckt lassen, um die Balance weiter zu verschieben.
 Die Balance l&auml;&szlig;t sich um 50 Prozent nach links und rechts 
 verschieben.


 11) balance

 Hier wird der Wert des Spur-Balancereglers angegeben. Jede Spur kann einzeln
 in seiner Balance eingestellt werden. Der Wert gibt das Verh&auml;ltnis zur
 Originallautst&auml;rke in Prozent an und bewegt sich von 0-50 Prozent.
 Der vorangestellte Buchstabe kennzeichnet die Balanceverschiebung nach
 L-inks oder R-echts.


 12) Sample-Bl&ouml;cke

 Die Samples werden als Bl&ouml;cke dargestellt. Dabei gibt es verschiedene
 Darstellungsoptionen f&uuml;r die Sample-Bl&ouml;cke. Die L&auml;nge der Bl&ouml;cke entspricht
 der L&auml;nge bzw. Abspieldauer des Sample-Blocks. Ein Sampleblock wird durch
 den Start- und Endpoint-Marker definiert.
 Normalerweise wird in den Bl&ouml;cken zus&auml;tzlich der Amplitudenverlauf, &auml;hnlich
 wie im <A HREF="page0042.htm">Editor</A>, dargestellt. Der Amplitudenverlauf des linken Kanals wird in
 der oberen H&auml;lfte und der Amplitudenverlauf des rechten Kanals in der
 unteren H&auml;lfte im Sampleblock dargestellt. Man kann die Amplituden-
 darstellung aber auch abschalten (siehe unter <A HREF="page0097.htm">Funktionsfeld</A>), da die
 Darstellung auf langsamen Rechnern etwas tr&auml;ge sein kann.
 In jedem Sampleblock steht in der Ecke oben links der Name der Sample-Datei:

<IMG SRC="../images/p210.gif" WIDTH="480" HEIGHT="115">

 Man kann sich hier aber auch den Sample-Kommentar einblenden lassen, der in
 der <A HREF="page0140.htm">Information-Datei</A> (*.INF) definiert wurde. Dieser ist normalerweise
 aussagekr&auml;ftiger. Deshalb ist diese Anzeigeart sehr zu empfehlen:

<IMG SRC="../images/p211.gif" WIDTH="480" HEIGHT="115">

 Diesen Kommentar kann man im <A HREF="page0101.htm">Tracker-Fileselector</A> (siehe <A HREF="page0100.htm">Button-Toolbar</A>)
 beliebig &auml;ndern. Die ge&auml;nderten Kommentarfelder werden in der <A HREF="page0143.htm">Tracker-Datei</A>
 (*.TRK) abgespeichert, der Kommentar im SampleInfo-File (*.INF) bleibt
 unver&auml;ndert.

 Das Drag&amp;Drop-Konzept wurde hier voll verwirklicht:

 Man w&auml;hlt einen Block aus, indem man mit der Maus auf den Block zeigt und auf
 die linke Maustaste (wechselt dadurch automatisch in den Selectmode) klickt.
 Dabei wird der Block mit einem roten (bei Farbe) oder gestrichelten Rand dargestellt.
 Man kann den Block per Drag&amp;Drop anfassen und auf der Zeitachse oder auf eine
 andere Spur verschieben. Dazu zeigt man mit der Maus auf den Block und dr&uuml;ckt
 die rechte Maustaste. Man h&auml;lt die rechte Maustaste (wechselt dadurch automatisch
 vom Selectmode in den Movemode) gedr&uuml;ckt und zieht dabei den Block auf die
 gew&uuml;nschte Position. Da dabei der Blockinhalt dargestellt wird, kann man den
 Block sehr genau zu anderen Bl&ouml;cken passend positionieren. Hat man die
 richtige Position gefunden, l&auml;&szlig;t man die rechte Maustaste wieder los - fertig.
 
 H&auml;lt man bei dieser Aktion zus&auml;tzlich die Taste ALT gedr&uuml;ckt 
 (wechselt dadurch automatisch in den Copymode), wird der Block kopiert,
 der Block bleibt an der alten Position und der neue Block h&auml;ngt an der Maus
 und kann beliebig positioniert werden.
 H&auml;lt man stattdessen die Tasten CTRL+ALT gedr&uuml;ckt (wechselt dadurch automatisch
 in den Clipmode), kann man den Block in das Clipboard schieben. Ist das Clipboard
 selektiert, l&auml;&szlig;t man die Maustaste los. Das Clipboard flackert auf, der Sampleblock
 wurde in das Clipboard kopiert.
 Wenn man nun mit der linken Maustaste auf das Clipboard klickt, klebt der
 zuvor kopierte Sampleblock an der Maus. Man kann nun den Sampleblock an die
 gew&uuml;nschte Position schieben und l&auml;&szlig;t die Maustaste wieder los - fertig.
 
 H&auml;lt man stattdessen die linke Shifttaste gedr&uuml;ckt, wandert der Block an das
 Ende des zeitlich vor ihm liegenden Sampleblocks. Ist das aktuelle Sample das
 erste in der Liste, wandert es zum Anfang der Liste.
 H&auml;lt man stattdessen die rechte Shifttaste gedr&uuml;ckt, wandert der Block vor den
 Anfang des zeitlich hinter ihm liegenden Sampleblocks. Ist das aktuelle Sample
 das erste in der Liste, bleibt der Block an der alten Stelle.
 
 Dr&uuml;ckt man die CTRL-Taste und klickt mit der linken Maustaste auf den
 Sampleblock, wird das Sample in den <A HREF="page0042.htm">Editor</A> &uuml;bertragen. Dort kann man nun die
 Marker (Marker-S und Marker-E) definieren, die in den Tracker &uuml;bernommen
 werden sollen. Ist man mit den Markern zufrieden, klickt man auf den
 QUIT-Button im <A HREF="page0042.htm">Editor</A>. Dabei wird aber nicht das Programm verlassen, wie es
 normal der Fall ist, sondern die Marker werden in den Tracker als Start- und
 Endpunkt des Sampleblocks &uuml;bernommen.
 
 Damit man sich die vielen Tastenkombinationen nicht merken mu&szlig;, kann man
 die verschiedenen Blockoperationen auch direkt in der <A HREF="page0100.htm">Button-Toolbar</A>
 (Mode-Bereich) ausw&auml;hlen. Eine Erkl&auml;rung der entsprechenden Buttons
 finden sie im Kapitel <A HREF="page0100.htm">&quot;Button-Toolbar&quot;</A>.

</PRE>

<A HREF="#4.14.2">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>