<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 3.2 //EN">
<HTML>

<HEAD>
  <TITLE>Einf&uuml;hrung</TITLE>
</HEAD>

<BODY BACKGROUND="../images/001.jpg">

<BASE TARGET="Right">

<LINK REV=made href="mailto:stepwil@aol.com">

<A NAME="3.2"></A>

<TABLE WIDTH="100%">
<TR>
<TD WIDTH="33%"><P ALIGN="LEFT"><A HREF="page0038.htm"><img src="../images/buttlft.gif" width="70" height="25"></A></TD>
<TD WIDTH="33%"><P ALIGN="CENTER">&nbsp;</TD>
<TD WIDTH="33%"><P ALIGN="RIGHT"><A HREF="page0040.htm"><img src="../images/buttrgt.gif" width="70" height="25"></A></TD>
</TR>
</TABLE>

<HR NOSHADE COLOR=#000000>

<CENTER><H1>Einf&uuml;hrung</H1></CENTER>

<PRE>

<H3> 3.2 Das erste HD-Recording (Aufnahme auf Festplatte)</H3>

 W&auml;hle im <A HREF="page0061.htm">Connection-Fenster</A> den Analogeingang aus.
 Als Samplerate w&auml;hlen wir 48 kHz. Wie das geht haben sie ja im Kapitel <A HREF="page0038.htm">"Die
 erste Aufnahme"</A> gelernt. Wir verlassen das Fenster und gehen nun in das <A HREF="page0060.htm">Setup</A>.
 Die maximale Aufnahmezeit kann im <A HREF="page0060.htm">Setup</A> (Toolbar,13) vorgegeben werden.
 Wir m&ouml;chten 1 Minute aufzeichnen und stellen dies nun im <A HREF="page0060.htm">Setup</A> ein.
 Das max-Feld sollte ebenfalls ausgew&auml;hlt sein,da sonst der gesamte freie
 Platz auf der Festplatte verwendet wird. Das w&auml;re allerdings nicht schlimm,
 da ja die Aufnahme jederzeit mit dem Stop-Button unterbrochen werden kann.
 Pro Minute sollten bei 48kHz mindestens 10 MB auf dem Laufwerk frei sein !
</PRE> 

<TABLE WIDTH="100%">

<TR>
<TD WIDTH="50%"><P ALIGN="LEFT"><IMG SRC="../images/p062_1.gif" WIDTH="224" HEIGHT="64"></A></TD>
<TD WIDTH="50%"><P ALIGN="LEFT"><IMG SRC="../images/p062_2.gif" WIDTH="128" HEIGHT="80"></A></TD>
</TR>
</TABLE>

<PRE>  
 Speichern sie das <A HREF="page0060.htm">Setup</A> nun mit dem Save-Button und verlassen sie das <A HREF="page0060.htm">Setup</A>.
 Gehen sie nun in das <A HREF="page0062.htm">Peakmeter-Fenster</A>. Pegeln sie den Eingang so ein,das die 
 Aussteuerungsanzeige bis zum oberen Drittel reicht. Man sollte bei der
 Aussteuerung immer etwas Reserve lassen, um eventuell auftretende
 Lautst&auml;rkespr&uuml;nge nicht zu &uuml;bersteuern. Auf keinen Fall sollte die Clip-Anzeige
 leuchten. Das bedeutet eine &Uuml;bersteuerung, und f&uuml;hrt zu extremen
 Verzerrungen. Ist man mit der Aussteuerung zufrieden, selektiert man den
 HDR-Button(20). Damit w&auml;hlt man zwischen Aufnahme in das Sampleram oder
 - wie hier - Aufnahme direkt auf Festplatte. Anschlie&szlig;end w&auml;hlt man
 den Aufnahme-Button um die Aufnahme zu starten.
 Bevor es soweit ist, mu&szlig; man allerdings noch  den Dateinamen f&uuml;r das Sample
 im Fileselector eingeben. Dabei kann man die Extension (*.S16) auch weglassen,
 also nur den Namen (z.B. &quot;TEST&quot;). Dann wird der Name automatisch mit der
 Extension des Default-Sampleformat (im <A HREF="page0060.htm">Setup</A> ausw&auml;hlbar) erweitert.
 Nun geht das System in Aufnahmebereitschaft. Sobald sie den Pause-Button
 anklicken, wird die Aufnahme gestartet. Sie k&ouml;nnen die Aufnahmebereitschaft
 bzw. Aufnahme mit dem Stop-Button (oder der ESC-Taste) jederzeit abbrechen.
 Diese erste Aufnahme wird nun direkt auf Festplatte aufgezeichnet.
 Im Max-Feld(3) wird die maximal m&ouml;gliche Aufnahmel&auml;nge angezeigt, also in
 diesem Fall 1 Minute = 00:01:00 00.
 Im Position-Feld(4) wird die bereits abgelaufene Aufnahmezeit angezeigt.
 
 Das war nun ihre erste Aufnahme auf Festplatte. Herzlichen Gl&uuml;ckwunsch!
 
<IMG SRC="../images/p060_1.gif" WIDTH="480" HEIGHT="500"> 
 
 Nach der Aufnahme wird automatisch in den <A HREF="page0042.htm">Editor</A> gewechselt und das Sample
 im Samplebereich dargestellt. Dort kann man es auch direkt bearbeiten.
 Nun wollen wir die gerade gemachte Aufnahme abspielen.
 Daf&uuml;r kann die Wiedergabe mit dem Play-Button(19) gestartet werden.
 Man kann die Wiedergabe jederzeit mit dem Stop-Button(18) stoppen oder mit
 dem Pause-Button(21) unterbrechen.
 Ein weiterer Druck auf den Pause-Button f&auml;hrt mit der Wiedergabe fort.
 
 Damit es bei gro&szlig;en Projekten nicht so schnell zum Chaos kommt, gibt es die
 M&ouml;glichkeit, durch zus&auml;tzliche Informationen bzw. Angaben erg&auml;nzend zum
 Filenamen, die &Uuml;bersichtlichkeit zu erh&ouml;hen. Diese Zusatzinformationen werden
 mit den <A HREF="page0047.htm">Markern</A> in der SampleInf-Datei abgespeichert (*.INF).
 Klicken sie nun im <A HREF="page0054.htm">Info-Bereich</A> des <A HREF="page0042.htm">Editors</A> auf den Namen des Samples.
 
<IMG SRC="../images/p063_2.gif" WIDTH="192" HEIGHT="131"> 
 
 Nun erscheint der <A HREF="page0056.htm">Sample-Information-Dialog</A>. Hier werden
 verschiedene Angaben zum Sample gemacht, wie z.B. Aufnahmel&auml;nge,
 Samplerate und unter anderem kann man hier im Source-Feld(5) und
 Comment-Feld(6) die Zusatzinformationen eintragen. 

<IMG SRC="../images/p064_1.gif" WIDTH="704" HEIGHT="100">

 Das Source-Feld ist f&uuml;r die Angabe des Musiktitels vorgesehen,
 z.B. &quot;I believe-Celvin Rotane&quot;. Im Comment-Feld kann man weitere Angaben
 zum Titel machen (z.B. f&uuml;r Aufnahmequelle, sp&auml;teres Verwendungsziel, BPM).
 Man kann hier nat&uuml;rlich beliebige Informationen eingeben. Diese sind jederzeit
 wieder &auml;nderbar, wenn das Sample in den <A HREF="page0042.htm">Editor</A> geladen wurde.
 Durch Klick auf den OK-Button werden die Kommentare und <A HREF="page0047.htm">Marker</A> ge&auml;ndert
 und abgespeichert.
 
 Tip: Das Programm unterst&uuml;tzt dieses Info-System durch
 einen speziellen <A HREF="page0069.htm">Audio-Fileselector</A> der diese Angaben zus&auml;tzlich zum
 Filenamen anzeigt. Diesen erreicht man &uuml;ber die <A HREF="page0058.htm">Editor-Toolbar</A> mit dem
 Audio-Fileselect-Button(22).

<A HREF="p064_2.htm" TARGET="_new"><IMG SRC="../images/scaled/p064_2.gif" WIDTH="331" HEIGHT="150"></A>

</PRE>

<A HREF="#3.2">Zum Seitenanfang</A>

<HR NOSHADE COLOR=#000000>

<P align=center>&copy; 1999 by <A HREF="mailto:stepwil@aol.com">Stephan Wilhelm</A></P>
<P align=center>HTML-Programmierung <A HREF="mailto:manfred.seidl@gmx.de">Manfred Seidl</A></P>



</BODY>
</HTML>